{
  "id": "doc_1746547470",
  "title": "Classical-Physics.pdf",
  "content": "Classical Mechanics\n1 Introduction\nClassical mechanics is important as it gives the foundation for most of physics. The theory, based\nonNewton\u0092 s laws of motion , provides essentially an exact description of almost all macroscopic\nphenomena. The theory requires modi\u0085cation for\n1.microscopic systems , e.g. atoms, molecules, nuclei - use quantum mechanics\n2.particles travelling at speeds close to the speed of light - userelativistic mechanics\nThese other theories must reduce to classical mechanics in the limit of large bodies travelling at speed\nmuch less than the speed of light.\nThe subject is usually divided into\n1.statics - systems at rest and in equilibrium ,\n2.kinematics - systems in motion, often accelerating. Concerned here with general relationships,\ne.g.F=dp\ndt, (Newton\u0092 s second law, without specifying the details of the force.)\n3.dynamics - details of the force law are speci\u0085ed, e.g. gravitational force, force due to a stretched\nspring.\n2 Newton\u0092 s laws of motion\nThese were formulated in his book Principia Mathematica in 1687. They are the basis of all classical\nmechanics.\n1. A body remains at rest or in a state of uniform motion (non-accelerating) unless acted on by an\nexternal force.\n2. Force = time rate of change of momentum, i.e.\nF=dp\ndt; (1)\nwhere p=mv= momentum of body of mass mmoving with velocity v. Ifmis constant then\nF=mdv\ndt=ma; (2)\nwith acceleration, a=dv\ndt.\n3. To every force (action ) there is an equal but opposite reaction .\nThese laws are only true in an inertial (non-accelerating) frame of reference . We shall discuss\nlater how we can treat motion relative to an accelerating frame of reference.\nFrom the second law, if F= 0, then the acceleration a=dv\ndt= 0, so the velocity, v, is constant. Thus\n\u0085rst law is special case of the second law.\nWe can also derive the third law from the second law as follows. Apply a force Fto body 1. Body 1\npushes on body 2 with force F2and body 2 pushes back on body 1 with force F1as shown in \u0085g 1.\nApplying Newton\u0092 s second law, for the combined system,\nF= (m1+m2)a: (3)\nFor body 1,\nF+F1=m1a; (4)\n1\n\nFigure 1: Demonstration of Newton\u0092 s Third Law\nfor body 2,\nF2=m2a: (5)\nAdding\nF+F1+F2= (m1+m2)a=F (6)\nF1+F2= 0 (7)\nand hence\nF1=\u0000F2: (8)\nSo that forces F1andF2are equal in magnitude but opposite in direction.\n3 Scalars and Vectors\nThere are two main types of variables in mechanics.\nScalar \u0096has only magnitude, e.g. mass, energy, speed.\nVector \u0096has magnitude and direction, e.g. position, velocity, acceleration, force.\nA vector may be represented graphically by a directed line segment. The length of the line represents\nthe magnitude of the vector, the direction of the line shows the direction of the vector. In printed text\nvectors are often written in bold type, and will be underlined in hand written text. A certain knowledge\nof vectors is assumed, in particular their Cartesian form.\nConsider Newton\u0092 s second law,\nF=ma: (9)\nThis is a vector equation which means that not only is the magnitudes on both sides of the equation\nequal, but the direction of the acceleration ais the same as the force, F. If we express Fandain\nCartesian form,\nF=Fx+Fy+Fz (10)\na=ax+ay+az; (11)\nthen\nFx=max=mdvx\ndt=md2x\ndt2; (12)\nFy=may=mdvy\ndt=md2y\ndt2; (13)\nFz=maz=mdvz\ndt=md2z\ndt2: (14)\n2\n\n4 Units and Dimensions\nIn order to discuss concepts such as velocity, force energy, etc. we must introduce a standard set of units\nof the fundamental variables or dimensions. The fundamental variables are mass [M], length [L]and\ntime [T]. The most widely used set of units for these variables is the Système International (S.I.).\nThe base units of the S.I. system are\nvariable unit name abbreviation\nmass [M]kilogram kg\nlength [L]metre m\ntime [T] second s\nFrom these base units we can obtain derived units for other variables, e.g. speed = distance/time, with\ndimensions of speed [v] = [L]=[T]and the S.I. unit is m/s, or ms\u00001. For force = mass \u0002acceleration\nthe dimensions are [F] = [m] [L] [T]\u00002and the unit is kg m s\u00002= Newton ( N). Units have dimensions\nandallequations in physics must be dimensionally homogeneous ; i.e. both sides and each term of\nthe equation must have the same dimensions. As an example,\n1. distance travelled in time tat constant speed viss=vt. The dimension are\n[L] = [L] [T]\u00001[T] = [L]: (15)\n2. distance travelled in time tunder a constant acceleration afrom an initial speed uis\ns=ut+1\n2at2: (16)\nThe dimensions are\n[L] = [ L] [T]\u00001[T] + [L] [T]\u00002[T]2(17)\n[L] = [ L] + [L]: (18)\nDimensional analysis of equations provides a very useful check on the correctness of algebraic expres-\nsions. However it does not give information about dimensionless constants, such as the1\n2in equation\n(16) above.\n5 Time rate of change of vectors\nNewton\u0092 s second law, F=mdv\ndt, involves the time rate of change of the velocity vector, v. Consider\nv=dr\ndt: (19)\nChange of position of particle in time interval \u0001tis\u0001r, so velocity (see \u0085g 2\nv= lim\n\u0001t!0\u0001r\n\u0001t=dr\ndt: (20)\nIn Cartesian coordinates\nr=xbi+ybj+zbk; (21)\nv=dr\ndt=dx\ndtbi+dy\ndtbj+dz\ndtbk; (22)\n=vxbi+vybj+vzbk: (23)\nThe speed of the particle is\nv=jvj=pv\u0001v=q\nv2x+v2y+v2z: (24)\n3\n\nFigure 2: Time-dependent vectors\nFor acceleration, replace rbyvin the above expressions,\na= lim\n\u0001t!0\u0001v\n\u0001t=dv\ndt: (25)\nIn Cartesian coordinates\na=vxbi+vybj+vzbk; (26)\na=dv\ndt=dvx\ndtbi+dvy\ndtbj+dvz\ndtbk; (27)\n=d2x\ndt2bi+d2y\ndt2bj+d2z\ndt2bk: (28)\n6 Motion in one dimension\nConsider a particle of mass, m, moving along the positive x-axis as in \u0085g 3.\nFigure 3: Motion along x-axis\nThe velocity is positive for motion in sense of xincreasing and negative for xdecreasing.\nIn time dtdistance travelled by particle is dx=vdt. In the \u0085nite time interval between t1, when\nposition of particle is x1, and time t2when position is x2, distance travelled is\ns= (x2\u0000x1) =Zt2\nt1vdt: (29)\nThis is represented by the shaded area in \u0085g 4(a). We need to know how vvaries with tin order to\ncalculate s.\n4\n\nFigure 4: (a) Left: Velocity - time graph; (b) Right: Acceleration - time graph\nSimilarly for acceleration, a, the change in velocity in time interval between time t1andt2is\n(v2\u0000v1) =Zt2\nt1adt; (30)\nand is represented by the shaded area in \u0085g 4(b). As before we need to know how avaries as a function\nof time.\n7 Motion under a constant force\nIf the force is constant, then by Newton\u0092 s second law, F=ma, then so is the acceleration. Hence from\n\u0085g 3\nv2=v1+a(t2\u0000t1); (31)\nv=at+K (32)\nwhere Kis an arbitrary constant of integration. Suppose v=uatt= 0, this is a boundary orinitial\ncondition , so\nv=u+at (33)\ndx\ndt=u+at (34)\nand integrating gives\nx=ut+1\n2at2+K2; (35)\nwhere K 2is another constant of integration determined by another boundary (initial) condition. Suppose\nx=x0att= 0, then\nx=x0+ut+1\n2at2(36)\nand distance travelled in time t, is\ns= (x\u0000x0) =ut+1\n2at2: (37)\nSince t= (v\u0000u)=a, then\ns=u(v\u0000u)\na+1\n2a\u0014(v\u0000u)\na\u00152\n(38)\n5\n\nand re-arranging,\nv2=u2+ 2as (39)\nCollecting together the equations of motion we have for linear motion under a constant acceleration (or\nforce)\nv=u+at; (40)\ns=ut+1\n2at2; (41)\nv2=u2+ 2as; (42)\ns=1\n2(u+v)t: (43)\n7.1 Free fall under gravity\nIn this case the constant acceleration is downwards, with a=\u0000g, asx,v, and aare positive when\nmeasured upwards. Consider a body thrown upwards with an initial speed u. Forces are as shown in\nFigure 5: Mass falling freely under in\u0087 uence of gravity\n\u0085g 5. The initial conditions are, x= 0,v=uatt= 0. To \u0085nd the maximum height reached, we \u0085nd s\nwhere v= 0. Thus from eq(42), 0 =u2\u00002gsgiving s=u2=(2g). The time to the maximum height is\nfound using eq(40) giving t=u=g. To \u0085nd the time to reach some speci\u0085ed height, x1, then use eq(41),\nx1=ut\u00001\n2gt2(44)\ngt2\u00002ut+ 2x1= 0: (45)\nThis is a quadratic equation in t, with two roots,\nt=u\u0006p\nu2\u00002gx1\ng: (46)\nIfu2>2gx1, the body can reach a height greater than x1and the two roots are real, with\nt1=u\u0000p\nu2\u00002gx1\ng(47)\ngiving the time to reach x1on the way up and\nt2=u+p\nu2\u00002gx1\ng(48)\ngiving the time to reach height x1going down after reaching the maximum height. Note that t1andt2\nare symmetric about the time to maximum height t=u=g. Ifx1> u2=gno particle can reach this height\n(the two roots of the quadratic are complex quantities).\n6\n\n8 Force of friction\nConsider a block of mass msliding on a rough surface. The frictional force, Ff,as it acts on the\nblock , is in a direction opposite to the motion of the block. It acts at the surface of the block in contact\nwith the rough surface. The normal reaction ,N, of the surface on the block is perpendicular to the\nsurface. As there is no resultant vertical force on the block, (see \u0085g 6) then the magnitude\nFigure 6: Block sliding over rough horzontal surface\nN=mg: (49)\nIf the block is sliding the frictional force is proportional to the normal reaction. The constant of pro-\nportionality is called the coe¢ cient of friction, often denoted by \u0016. Hence we write Ff=\u0016Nfor the\nmagnitude.\nSome typical values of \u0016aresurfaces \u0016\nsteel on steel 0.4\nte\u0087 on on te\u0087 on 0.04\nlead on steel 1\nIf applied force Fis not su¢ ciently large to cause the block to slide, there is still a frictional force Ff\nacting in the direction opposite to that in which the body would move if there were no friction, but\nFf< \u0016N .\nIf the body is just about to slide we shall assume that Ff=\u0016N. In practice the coe¢ cient of\nsliding friction is slightly less than the coe¢ cient of static friction .\nConsider the motion of a block sliding on a rough horizontal surface. Resolving the forces vertically,\nmg\u0000N= 0 (50)\nso\nFf=\u0016N=\u0016mg (51)\nand the resultant horizontal force on the body is\n(F\u0000Ff) =ma=mdv\ndt: (52)\nThis is the equation of motion of the body.\nExample 1 Suppose body is initially sliding to the right and the applied force F= 0. The body slides\nto rest under the in\u0087 uence of the frictional force. Equation of motion is\n\u0000Ff=\u0000\u0016mg =ma; (53)\nso the acceleration\na=\u0000\u0016g (54)\n7\n\nis constant. Hence previous results for motion under a constant acceleration can be used. In particular\nthe time to come to rest if initial velocity is uis given by\n0 = u\u0000\u0016gt; (55)\nt=u=(\u0016g): (56)\n8.1 Motion of body on rough inclined plane\nConsider the body being pulled/pushed upthe plane at a constant speed. The forces are as in the\ndiagram, \u0085g 7. The body is sliding so we take frictional force Ff=\u0016N. There is no resultant force\nFigure 7: Mass pulled up an inclined plane\nperpendicular to the plane (it remains in contact) so\nN=mgcos\u000b: (57)\nResolving forces parallel to plane surface,\nF\u0000Ff\u0000mgsin\u000b=ma=mdv\ndt(58)\nF\u0000\u0016mg cos\u000b\u0000mgsin\u000b=mdv\ndt: (59)\nExample 2 What is largest value for the angle of inclination of the plane for which body remains at rest\non the plane without sliding down . In this case the body wants to slide down, so the frictional force Ff\nacts up the plane, as in \u0085g 8. For equilibrium there is no resultant force on the particle in any direction.\nFigure 8: Body sliding down an inclined plane\nResolving forces perpendicular to the plane\nN=mgcos\u000b (60)\n8\n\nand parallel to the plane\nFf=mgsin\u000b: (61)\nThe maximum value of Ffis\u0016N, so\nFf=\u0016N=\u0016mg cos\u000b (62)\nso the maximum value of \u000bis when\n\u0016mg cos\u000b=mgsin\u000b (63)\ntan\u000b=\u0016: (64)\n8.2 Role of friction in accelerating a car\nForces are as shown for a rear-wheel drive car in \u0085g 9. The frictional force between the rear wheels and\nFigure 9: Rear-wheel driven vehicle\nthe ground is Ff, and this force provides the force needed to accelerate the car, Ff=ma.\n9 Kinematical relations\nBefore considering other one-dimensional problems we need to develop some other general aspects of\nmechanics.\n9.1 Work\nForce Fis applied to a body. If point of application of the force, i.e. body moves a distance dras in \u0085g\n10, the work done by the force is de\u0085ned to be\ndW=F\u0001dr= (Fcos\u000b) dr (65)\nwhere Fcos\u000bis component of force in direction of motion of the body. Hence work is a scalar\nquantity .\nFor \u0085nite displacements of a particle from position r1tor2as in \u0085g 10 the work done bythe force is\nW=Zr2\nr1F\u0001dr (66)\nNote that Fmay vary with position.\n9\n\nFigure 10: Force displaced\nFigure 11: Body moving over curved path\nFor a constant force (in both magnitude anddirection ), work done is\nW=F\u0001(r2\u0000r1): (67)\nWork isenergy and the S.I. unit is the newton metre ( N m) .\nIf force acts in the x-direction and the particle can only move in the x-direction, then we can drop\nthe scalar product in eq(66) and write\nW=Zx2\nx1Fdx (68)\nas the work done by force Fin moving particle from position x1tox2.\nExample 3 Work that must be done to stretch a spring, as illustrated in \u0085g 12: Tension in the spring\nFigure 12: Stretched spring\nwhen extended is proportional to the (small) extension, (Hooke\u0092 s law), so T=\u0000kxwhere kis the sti¤ness\nconstant. To stretch the spring we must apply a force F= +kx. The work done by force F(i.e. by us)\nto stretch spring to an extension x1is\nW=Zx1\n0Fdx=Zx1\n0kxdx=1\n2kx2\n1: (69)\n10\n\nWe assume there are no dissipative forces (e.g. friction) so this energy is stored in the stretched spring\naspotential energy . Potential energy will be discussed in more detail later.\nExample 4 Work done bygravity when particle falls from position x1tox2where (x1\u0000x2) =h. The\nFigure 13: Body falling through distance hunder gravity\nforce F=\u0000mgand the work\nW=Zx2\nx1Fdx=Zx2\nx1(\u0000mg) dx= (\u0000mgx )jx2\nx1=\u0000mg(x2\u0000x1) =mgh: (70)\nThe work done manifests itself as kinetic energy of the particle.\nExample 5 Suppose particle is constrained to fall under gravity inside a smooth tube, as in the \u0085g\n14. Force of tube onthe particle is Nand is normal to the tube. (The tube being smooth produces no\nFigure 14: Contrained motion of particle under gravity\nfrictional force - an idealized situation!) So resultant force on particle is N+F. Work done by these\nforces as particle moves a distance dralong the tube is\ndW= (N+F)\u0001dr=N\u0001dr+F\u0001dr: (71)\n11\n\nButNis orthogonal (perpendicular) to drat every point along tube, so N\u0001dr= 0. Hence\ndW=F\u0001dr (72)\nand constraining forces which are not dissipative (i.e. no friction) do no work. For this problem,\nF=\u0000mgbianddr= dxbi+ dybj, so\ndW=F\u0001dr=\u0000mgbi\u0001\u0010\ndxbi+ dybj\u0011\n=\u0000mgdx (73)\nand hence the work done by gravity when particle falls from height x1tox2is\nW=Zx2\nx1(\u0000mg) dx=mgh (74)\nas before.\n9.2 Power\nPower, P, is de\u0085ned as the rate of doing work,\nP=dW\ndt: (75)\nThe S.I. unit is the joule/second\u0000\nJ s\u00001\u0001\nor watt ( W). Since dW=F\u0001drthen\nP=dW\ndt=F\u0001dr\ndt=F\u0001v=Fxvx+Fyvy+Fzvz: (76)\nAverage power over extended time interval tisP=W=t, where Wis work done in time t.\n9.3 Impulse\nConsider a force Fwhich acts on a body of mass mduring a time interval from t1tot2. The impulse (a\nvector quantity) of Fduring this time interval is de\u0085ned as\nI=Zt2\nt1Fdt (77)\nBut from Newton\u0092 s second law\nF=dp\ndt(78)\nso\nI=Zt2\nt1dp\ndtdt=Zp2\np1dp= (p2\u0000p1) (79)\nwhere p1=mv1, the momentum of particle at time t, and similarly p2=mv2at time t2. Hence\nNewton\u0092 s second law can also be stated as Impulse = change in momentum,\nI= \u0001p= (p2\u0000p1): (80)\nIf force, F, is constant (in direction and magnitude) throughout the time interval \u0001t= (t2\u0000t1), then\nI=F(t2\u0000t1) =F\u0001t: (81)\nAn important special case is when force, F, is very large and \u0001tis very small, so that I= \u0001pis \u0085nite.\nNote as I=Rt2\nt1Fdtthen\nF=dp\ndt=dI\ndt(82)\nExample 6 Particle of mass mbouncing o¤ a wall elastically (no loss of kinetic energy) as in \u0085g 15.\nChange in momentum of particle is \u0001p= (\u0000mv)\u0000mv=\u00002mvis the impulse on the particle. Therefore\nby Newton\u0092 s third law the impulse on the wall is +2mv.\n12\n\nFigure 15: Particle bouncing elastically from a wall (very large mass)\n9.4 Kinetic energy and potential energy\nConsider a one-dimensional problem with the force Fin the x-direction acting on a particle of mass m.\nThe equation of motion is\nF=ma=mdv\ndt=mdv\ndxdx\ndt=mvdv\ndx: (83)\nThe work done by the force in moving the particle from position x1to position x2in \u0085g 16 is\nFigure 16: Work done between two points\nW=Zx2\nx1Fdx=Zx2\nx1mvdv\ndxdx=Zv2\nv1mvdv=1\n2mv2jv2\nv1=1\n2mv2\n2\u00001\n2mv2\n1; (84)\nwhere v1is velocity of particle at position x1and similarly at position 2. We de\u0085ne kinetic energy\n(K.E.) as KE=1\n2mv2. Hence the work done by the force is equal to the change (increase) in kinetic\nenergy.\nWe can also consider the work done by the force as the di¤erence inpotential energy (P.E.)\nbetween positions x1andx2, thus we de\u0085ne (mechanical) potential V(x)by\nW=Zx2\nx1Fdx=V(x1)\u0000V(x2) =\u0000[V(x2)\u0000V(x1)] =1\n2mv2\n2\u00001\n2mv2\n1 (85)\nand\nV(x1) +1\n2mv2\n1=V(x2) +1\n2mv2\n2: (86)\nThe above relationship only de\u0085nes the di¤erence in potential energy. To de\u0085ne an absolute\npotential energy of a particle at x1we need an arbitrary but conveniently chosen position, x0, at which\nthe potential V= 0by de\u0085nition. Then\nV(x1) =Zx0\nx1Fdx (87)\nand\nV(x1)\u0000V(x2) =Zx0\nx1Fdx\u0000Zx0\nx2Fdx=Zx0\nx1Fdx+Zx2\nx0Fdx=Zx2\nx1Fdx=W: (88)\n13\n\nSince\nV(x1) +1\n2mv2\n1=V(x2) +1\n2mv2\n2 (89)\nthen potential energy + kinetic energy is constant, i.e. total energy is constant. Hence total energy ,\nE=V+KE,is conserved throughout the motion provided force Fis non-dissipative (i.e. no friction).\nIf we know the potential energy as a function of position, V(x)we can determine the force Ffrom\nF=\u0000dV\ndx: (90)\nNote Fis in the direction of decreasing V.\nExample 7 Gravitational force F=\u0000mg. Then\nFigure 17: Particle falling under gravity\nV(x1) =Zx0\nx1Fdx=Zx0\nx1(\u0000mg) dx= (\u0000mgx )jx0\nx1=mgx 1\u0000mgx 0: (91)\nWe can choose x0= 0as the ground, giving\nV(x) =mgx (92)\nand\nF=\u0000dV\ndx=\u0000mg (93)\nas above.\nExample 8 Equation for motion under constant acceleration of gravity given earlier,\nv2=u2\u00002g(x\u0000x0) (94)\ncan be re-written by multiplying by1\n2mas\n1\n2mv2=1\n2mu2\u00001\n2m2g(x\u0000x0) (95)\n1\n2mv2+mgx =1\n2mu2+mgx 0 (96)\ni.e. conservation of total energy.\nIn three-dimensions we have\nW=Zr2\nr1F\u0001dr=1\n2mv2\n2\u00001\n2mv2\n1: (97)\n14\n\nalso\nW=V(r1)\u0000V(r2) = change of P :E: (98)\nand\nV(r1) =Zr0\nr1F\u0001dr (99)\nV(r0) = 0 (100)\nF=\u0000rV (101)\nwhere the gradient operator\nr\u0011bi@\n@x+bj@\n@y+bk@\n@z: (102)\nWe can only write F=\u0000rVand de\u0085ne a potential energy function V(r)for a non-dissipative or\nconservative force. A conservative force is one such that the work done by the force in moving the\nparticle from position r1tor2isindependent of the path between r1andr2, see \u0085g 18 The work\nFigure 18: Work done over di¤erent paths by a conservative force\ndone just depends on the initial and end points,\nWAB=W=ZrB\nrAF\u0001dr=V(rA)\u0000V(rB): (103)\nExamples of conservative forces are: electrostatics, gravitation, force due to a stretched spring.\n10 Simple Harmonic motion\nConsider a particle of mass mattached to a light (massless) spring with a displacement xfrom the\nequilibrium (unstretched) position x= 0 as shown in \u0085g 19. Positive xmeans extension, negative x\nmeans compression of the spring. The restoring force is given by Hooke\u0092 s law, F=\u0000kx. The equation\nof motion is\nF=\u0000kx=md2x\ndt2(104)\nor, writing !=p\nk=m\nd2x\ndt2+!2x= 0: (105)\n15\n\nFigure 19: Stretched spring\nThis equation, in one form or another, is one of the most common equations in physics.\nThe general solution is\nx(t) =Acos!t+Bsin!t; (106)\nwhere AandBare two arbitrary constants of integration of the second-order di¤erential equation eq(105).\nThe functions sin!tandcos!tare shown in \u0085gs 20 and 21. This solution can also be written in the form\nx(t) =Cei!t+De\u0000i!t; (107)\nwhere CandDare two arbitrary constants of integration, or as\nx(t) =rcos (!t+\u001e) (108)\nwith distance rand angle \u001earbitrary constants. The values of these arbitrary constants are determined\nby the initial orboundary conditions .\n10 7.5 5 2.5 01\n0.5\n0\n-0.5\n-1tx\ntx\nFigure 20: sin !t\n10 7.5 5 2.5 01\n0.5\n0\n-0.5\n-1tx\ntx\nFigure 21: cos !t\nAny solution to the equation of motion is periodic , the time for one complete period/oscillation being\nT=2\u0019\n!= 2\u0019rm\nk: (109)\n16\n\nThe frequency of oscillation is\n\u0017=1\nT=!\n2\u0019=1\n2\u0019r\nk\nmHz: (110)\nand the angular frequency !=p\nk=m rad/s.\nExample 9 Suppose x=aanddx=dt= 0att= 0are the initial conditions. Then from\nx(t) = Acos!t+Bsin!t; (111)\ndx\ndt=\u0000!Asin!t+!Bcos!t (112)\nsubstituting the initial values gives,\na=A; (113)\n0 = !B: (114)\nThus a particular solution satisfying the initial conditions is\nx(t) = acos!t (115)\nv(t) = \u0000a!sin!t: (116)\nThe largest displacement ais called the amplitude.\n10.1 Potential and kinetic energy in simple harmonic motion\nWe now consider the variations of the potential energy and kinetic energy of the particle as it undergoes\nsimple harmonic motion. The force F=\u0000kxis a conservative force so the potential energy\nV(x) =1\n2kx2+V0: (117)\nWe can choose V(x= 0) = 0 giving V0= 0and the potential energy is\nV(x) =1\n2ka2cos2(!t) (118)\nThe kinetic energy KEis\nKE=1\n2mv2=1\n2ma2!2sin2(!t): (119)\nThe total energy E=KE+Vis\nE=1\n2ma2!2sin2(!t) +1\n2ka2cos2(!t): (120)\nBut!2=k=m so\nE=1\n2ma2k\nmsin2(!t) +1\n2ka2cos2(!t); (121)\n=1\n2ka2\u0002\nsin2(!t) + cos2(!t)\u0003\n; (122)\nE=1\n2ka2=KE+V: (123)\nFig 22 shows the potential energy curve for a stretched spring. If total energy is E, then the motion is\nrestricted to jxj< a. Atx=a,V=1\n2ka2=E, and KE= 0; atx= 0,V= 0, and KE=1\n2ka2=E.\nWhenever the potential energy function of a system has a rounded minimum, the vibrational motion\nabout the equilibrium position of minimum potential energy approximates to simple harmonic motion.\nAn example is two atoms bound together to form a molecule, such as in \u0085g 23,. If r0is the separation\nfor minimum potential energy, (the equilibrium separation), the two atoms vibrate about this value r0.\n17\n\nFigure 22: Potential energy curve for simple harmonic motion\n1.25 1.125 1 0.875 0.75 0.62575\n50\n25\n0\n-25\n-50\n-75\n-100rV\nrV\nFigure 23: Potential energy curve as a function of the separation of two atoms\nThis can be shown by taking a Taylor\u0092 s series expansion about the equilibrium position. If x0is the\nexquilibrium separation, then\nV(x)\u0000V(x0) =\u0012dV\ndx\u0013\nx=x0(x\u0000x0) +1\n2\u0012d2V\ndx2\u0013\nx=x0(x\u0000x0)2+: : : : (124)\nBut at x=x0is a minimum, so\u0000dV\ndx\u0001\nx=x0= 0and\u0010\nd2V\ndx2\u0011\nx=x0>0. Since the force for small displace-\nments (x\u0000x0)is\nF(x) = \u0000\u0012dV\ndx\u0013\n; (125)\n=\u0000\u0012d2V\ndx2\u0013\nx=x0(x\u0000x0): (126)\nHence force is of the form F=\u0000kxwhere xis displacement from equilibrium, with k > 0, i.e.S.H.M.\n18\n\n10.2 Damped oscillations\nIn all real mechanical oscillators there is some damping (or friction). The damping force opposes the\nmotion of the particle. Consider a damping force that is proportional to the velocity of the particle,\ni.e.Ff=\u0000\u0015dx\ndtwith \u0015a positive constant. Suppose the velocity is positive, i.e. motion in direction of\nincreasing x, then the damping force is in the opposite direction (see \u0085g 24). The equation of motion of\nFigure 24: Displacement and forces in a damped harmonic oscillator\nthe particle is\nF+Ff=md2x\ndt2; (127)\n\u0000kx\u0000\u0015dx\ndt=md2x\ndt2(128)\nor\nmd2x\ndt2+\u0015dx\ndt+kx= 0: (129)\nThis is a second-order, linear, homogeneous di¤erential equation with constant coe¢ cients, m,\u0015andk.\nThe general solution is\nx(t) =Aeq1t+Beq2t; (130)\nwhere q1andq2are the roots of the quadratic equation (the auxiliary equation)\nmq2+\u0015q+k= 0; (131)\nq=\u0000\u0015\u0006p\n\u00152\u00004mk\n2m: (132)\nIn the absence of damping, \u0015= 0, then the natural angular frequency of oscillation, denoted by !0=p\nk=m. Then\nq=\u0000\u0015\n2m\u0006s\n\u00152\n4m2\u0000k\nm=\u0000\u0015\n2m\u0006is\nk\nm\u0000\u00152\n4m2(133)\n=\u0000\u0015\n2m\u0006is\n!2\n0\u0000\u00152\n4m2(134)\n=\u0000\u0015\n2m\u0006i!; (135)\nwhere the angular frequency\n!=s\n!2\n0\u0000\u00152\n4m2: (136)\nThere are three possibilities;\n(a)\u00152<4mk, so\u00152=4m < k=m =!0, and !is real and positive and 0< ! < ! 0\n(b)\u00152= 4mk, so\u00152=4m=k=m =!0and!= 0,\n(c)\u00152>4mk, so\u00152=4m > k=m =!0so!is complex and qis wholly real, and there is no oscillation.\nWe will consider these cases in turn.\n19\n\n(a)\u00152<4mk, known as light damping (0< ! < ! 0).\nThe roots are complex quantities, q1=\u0000\u0015\n2m+i!andq2=\u0000\u0015\n2m\u0000i!, so\nx(t) = Aeq1t+Beq2t; (137)\n= e\u0000(\u0015=2m)t\u0002\nAei!t+Be\u0000i!t\u0003\n: (138)\nFrom de Moivre\u0092 s theorem ei\u0012= cos \u0012+isin\u0012,x(t)can be re-written as\nx(t) = e\u0000(\u0015=2m)t[Ccos!t+Dsin!t] (139)\nwhich is a product of a function e\u0000(\u0015=2m)texponentially decaying with time and an oscillating function\n[Ccos!t+Dsin!t]of time with angular frequency !as shown in \u0085g 25.\n20 15 10 5 01\n0.5\n0\n-0.5\n-1tx\ntx\nFigure 25: Displacement as function of time in an under damped oscillator\nEnergy is continually being lost due to the damping force but at any given time the energy of the\noscillator is\nE=KE+V=1\n2mv2+1\n2kx2: (140)\nUsing the above expressions for x(t)it can be shown that for very light damping\nE(t)'E0e\u0000\u0015t=m; (141)\nwhere E0is the total energy at t= 0. Therefore E0=1\n2ka2for an initial displacement a, and\ndE\ndt' \u0000\u0015\nmE0e\u0000\u0015t=m' \u0000\u0015\nmE: (142)\nHence in time interval dtthe fractional energy loss\ndE\nE=\u0000\u0015\nmdt: (143)\n20\n\nIn a time interval dt= 1=!, the fractional energy loss is \u0015=(m!). The reciprocal of this quantity\nE\ndE=Q=m!\n\u0015'm!0\n\u0015(144)\nis called the Q-factor orquality factor . For a lightly damped oscillator the Q-factor is large.\n(b)\u00152= 4mk,(!= 0)known as critical damping\nThe two roots are equal to \u0000\u0015=(2m). In this case the general solution to the equation of motion is\nx(t) = (A+Bt)e\u0000(\u0015=2m)t: (145)\nIfx=aand dx=dt= 0att= 0,x(t)is never negative - there is no oscillation and the system returns\nto the equilibrium position is the shortest time (see \u0085g 26).\n80 60 40 20 01\n0.75\n0.5\n0.25\ntx\ntx\nFigure 26: Displacement as function of time for critical damping\nCritical damping is required for swing-doors and car suspensions.\n(c)\u00152>4mk, known as heavy damping, !is complex and qis wholly real. The two roots are\nq1=\u0000\u0015\n2m+s\n\u00152\n4m2\u0000!2\n0<0; (146)\nq2=\u0000\u0015\n2m\u0000s\n\u00152\n4m2\u0000!2\n0<0: (147)\nBoth roots are negative but q2is more negative then q1, i.e.jq2j>jq1j. The displacement\nx(t) =Ae\u0000jq1jt+Be\u0000jq2jt(148)\nis the addition of two term, the \u0085rst Ae\u0000jq1jtdies away slowly (middle curve in \u0085g 27), the second\nBe\u0000jq2jtdies away more quickly (lower curve in \u0085g 27). As damping increases jq1jbecomes smaller and\nthe displacement decreases more slowly with time.\n21\n\n35 30 25 20 15 10 5 02\n1.5\n1\n0.5\n0\nxy\nxyFigure 27: Displacement as function of time for overdamped (heavy) oscillator\n10.3 Forced damped oscillator\nConsider applying a periodic force F=F0cos!ftto a damped oscillator in order to keep it oscillating.\nThe equation of motion of the particle is\nmd2x\ndt2+\u0015dx\ndt+kx=F0cos!ft (149)\nwhere the term on the R.H.S. is the driving or forcing term. The general solution to this equation is the\nsum of the general solution to the homogeneous equation (zero on R.H.S., eq(129)) plus a particular\nsolution to the full equation. It was shown above that the solution to the homogeneous equation eq(129)\ndies away exponentially (this is called the transient solution) so that after a su¢ ciently long time the\nmotion of the particle is described by the particular solution alone.\nLet\u0092 s take as an ansatz solution a particular solution of the form\nx(t) =Acos (!ft+\u001e): (150)\nThat is one having the same frequency !fas the driving frequency but with an unknown phase di¤erence\n\u001eand amplitude A. To determine Aand\u001esubstitute the assumed solution into the di¤erential equation\nof motion. As\ndx\ndt=\u0000!fAsin (!f+\u001e); (151)\nd2x\ndt2=\u0000!2\nfAcos (!f+\u001e); (152)\nwe have\n\u0000m!2\nfAcos (!f+\u001e)\u0000\u0015!fAsin (!f+\u001e) +kAcos (!ft+\u001e) =F0cos!ft (153)\nA\u0000\nk\u0000m!2\nf\u0001\ncos (!f+\u001e)\u0000\u0015!fAsin (!f+\u001e) =F0cos!ft (154)\nExpanding the cosine and sine terms,\nA\u0000\nk\u0000m!2\nf\u0001\n[cos!ftcos\u001e\u0000sin!ftsin\u001e]\u0000\u0015!fA[sin!ftcos\u001e+ cos !ftsin\u001e] =F0cos!ft (155)\n22\n\nThis equation must be true for all values of t. (Note cosine and sine are orthogonal functions.) Choose\ntsuch that cos!ft= 1, then sin!ft= 0, and\nA\u0000\nk\u0000m!2\nf\u0001\ncos\u001e\u0000\u0015!fAsin\u001e=F0: (156)\nNow choose tsuch that sin!ft= 1, then cos!ft= 0, and\n\u0000A\u0000\nk\u0000m!2\nf\u0001\nsin\u001e\u0000\u0015!fAcos\u001e= 0: (157)\nSquaring eq(156) and eq(157) and adding gives,\nA2\u0000\nk\u0000m!2\nf\u00012+\u00152!2\nfA2=F2\n0; (158)\nand\nA=F0\u0014\u0010\nk\u0000m!2\nf\u00112\n+\u00152!2\nf\u00151=2: (159)\nFor an undamped, unforced oscillator the natural angular frequency is\n!0=r\nk\nm(160)\nsok=m!2\n0, which gives\nA=F0\u0014\nm2\u0010\n!2\n0\u0000!2\nf\u00112\n+\u00152!2\nf\u00151=2: (161)\nWe can now investigate the variation of Awith !f. If there were no damping, \u0015= 0, then\nA=F0\nm\f\f\f\u0010\n!2\n0\u0000!2\nf\u0011\f\f\f: (162)\nHence A! 1 as!f!!0. Even with damping, Ahas its maximum value when !f'!0. This is the\nphenomena of resonance .Amplitude of the oscillation becomes much larger when the angular frequency\n10.5 10.25 10 9.75 9.50.75\n0.5\n0.25\n0\nwfA\nwfA\nFigure 28: Amplitude of forced oscillator; Lower curve - heavy damping; Upper curve - light damping\nof the driving force is equal to the natural frequency of the undamped oscillator as shown in \u0085g 28.\nDramatic example - Facoma Narrows bridge.\n23\n\nFrom eq(157)\ntan\u001e=\u0015!f\u0010\nm!2\nf\u0000k\u0011=\u0015!f\nm\u0010\n!2\nf\u0000!2\n0\u0011: (163)\nBelow the resonance frequency, !f< ! 0the phase angle \u001eis fairly small, but negative as shown in \u0085g\n20 15 10 5 0\n0\n-0.5\n-1\n-1.5\n-2\n-2.5\n-3wf\nphiwf\nphi\nFigure 29: Phase in forced oscillator as function of driving frequency\n29. Therefore the displacement xis approximately in phase with the driving force. As !fincreases\nthrough !0the phase angle increases rapidly and drops through \u0000\u0019=2to\u0000\u0019, at which stage xis then\nout of phase with the driving force for !f> ! 0.\n11 Motion in a plane (two-dimensions)\nParticle at point P as in \u0085g 30. Its position, velocity and acceleration are\nFigure 30: Vectors for motion in two dimensions\nr=xbi+ybj; (164)\nv=dr\ndt=dx\ndtbi+dy\ndtbj; (165)\na=dv\ndt=d2x\ndt2bi+d2y\ndt2bj: (166)\n24\n\nWe will consider various examples of motion in a plane\n11.1 Trajectories of particle in a uniform gravitational \u0085eld (ballistic trajec-\ntories)\nInitial velocity u0makes an angle \u000bwith the horizontal (sometimes called the angle of elevation) as in\n\u0085g 31. Equation of motion is\nFigure 31: Ballistic trajectory\nmdv\ndt=m\u0012dvx\ndtbi+dvy\ndtbj\u0013\n=\u0000mgbj: (167)\nHence immediately we see that\ndvx\ndt= 0 (168)\nand so vxis constant, equal to its initial value\nvx(t) = u0cos\u000b; (169)\nx(t) = u0tcos\u000b: (170)\nAlso\ndvy\ndt=\u0000g; (171)\nvy=u0sin\u000b\u0000gt; (172)\ny=u0tsin\u000b\u00001\n2gt2; (173)\nand (from v2=u2+ 2as)\nv2\ny=u2\n0sin2\u000b\u00002gy: (174)\n11.1.1 Shape of trajectory\nSince x(t) =u0tcos\u000bthen t=x=(u0cos\u000b). Hence using the yposition, eq(173)\ny=u0\u0012x\nu0cos\u000b\u0013\nsin\u000b\u00001\n2g\u0012x\nu0cos\u000b\u00132\n(175)\n=xtan\u000b\u0000\u0012gx2\n2u2\n0cos2\u000b\u0013\n: (176)\nThis is the equation of a parabola.\n25\n\nThe range Ron the horizontal plane is found from setting y= 0. Then\n0 =xtan\u000b\u00001\n2g\u0012x2\nu2\n0cos2\u000b\u0013\n(177)\nwhich has one solution, x= 0, and the other\nx=R=2u2\n0\ngsin\u000bcos\u000b=u2\n0\ngsin 2\u000b: (178)\nTime to reach y= 0is found from\n0 =u0tsin\u000b\u00001\n2gt2(179)\ngiving either t= 0(the initial position) or for the whole range\nT=2u0sin\u000b\ng: (180)\nMaximum range occurs when sin 2\u000b= 1, so when \u000b=\u0019=4 = 45\u000e, and Rmax=u2\n0=g.\nFor a range R < R maxthere are two values of \u000bwhich give rise to the same range, as illustrated in\n\u0085g 32 and \u0085g 33.\nFigure 32: Angle for di¤erent ranges\nFigure 33: Two trajectories giving the same range\nSince R=Rmaxsin 2\u000b, and sin 2\u000b= sin ( \u0019\u00002\u000b)then\n2\u000b1= sin\u00001\u0012R\nRmax\u0013\n= sin\u00001\u0012gR\nu2\n0\u0013\n; (181)\n26\n\n(\u0019\u00002\u000b2) = sin\u00001\u0012R\nRmax\u0013\n= 2\u000b1: (182)\nHence\n\u000b2=\u0019\n2\u0000\u000b1 (183)\nand then\n\u000b2\u0000\u0019\n4=\u0019\n4\u0000\u000b1 (184)\nso we see that the two angles for the same range are symmetric about \u0019=4, see \u0085g 33. Maximum range\noccurs when \u000b1=\u000b2=\u0019=4.\n12 Conservation of momentum for isolated systems of particles\nFrom Newton\u0092 s second law, F=dp\ndt, ifF= 0, then pis constant. Consider a body of mass Mmoving with\nvelocity Vand not subject to any forces. Its momentum remains constant, i.e. p=MV=constant.\nThe body then explodes into several pieces (say at least three) with masses mi,i= 1,2,3: : :travelling\nwith velocities vi,i= 1,2,3: : :as illustrated in \u0085g 34. The total momentum of the pieces is\nFigure 34: Exploding mass\np1+p2+p3+: : :=m1v1+m2v2+m3v3+: : : : (185)\nThe explosion gives impulses Iito each of the three pieces. Because of Newton\u0092 s third law (action and\nreaction are equal an opposite). If impulse on particle 1 due to particle 2 is I12and that due to particle\n2 on particle 1 is I21, then\nI12=I21: (186)\nFor particle 1 the total impulse on it due to the other particles is\nI1=I12+I13 (187)\nand for the whole system we have\nI1+I2+I3= (I12+I13) + (I21+I23) + (I31+I32) (188)\n= (I12+I21) + (I23+I21) + (I31+I32) (189)\n= 0 + 0 + 0 (190)\nThus total impulse is zero and so the total momentum is the same before and after the explosion,\np=p1+p2+p3+: : : (191)\nMV=m1v1+m2v2+m3v3+: : : (192)\nthat is, total momentum is conserved . In this case (non-relativistic) mass is conserved,\nM=m1+m2+m3+: : : : (193)\n27\n\nOn the other hand kinetic energy is not conserved ,\n1\n2MV26=1\n2m1v2\n1+1\n2m2v2\n2+1\n2m3v2\n3+: : : (194)\nbut the extra kinetic energy comes from chemical potential energy or energy stored in springs.\nExample 10 Two particles, one initially at rest, collide and stick together (opposite of the explosion).\nInitial momentum is\npi=m1v1+ 0: (195)\nFinal momentum is\npf=MV= (m1+m2)V: (196)\nSince total momentum is conserved, pi=pf, som1v1= (m1+m2)Vand\nV=m1\nm1+m2v1 (197)\nand combined particle moves in the same direction as the incoming one, but at a reduced speed. The\ninitial kinetic energy is\nKEi=1\n2m1v2\n1+ 0: (198)\nThe \u0085nal kinetic energy\nTf=1\n2(m1+m2)V2=1\n2(m1+m2)\u0012m1\nm1+m2v1\u00132\n=1\n2m2\n1\n(m1+m2)v2\n1<1\n2m1v2\n1: (199)\nThus there is a loss of kinetic energy in a \u0091 sticking\u0092collision. The energy is converted into heat and/or\nsound.\n13 Collisions between bodies\nThese are very important in many branches of physics and chemistry.\n13.1 With a rigid wall\nIf wall is smooth, i.e. no friction, then impulse given to the particle by the wall is perpendicular to the\nwall, there is no component parallel to the wall\u0092 s surface. as in \u0085g 35 Hence tangential component of\nvelocity is unaltered so\nvisin\u000b=vfsin\f: (200)\nIf collision is perfectly elastic, i.e. no loss of kinetic energy,\n1\n2mv2\ni=1\n2mv2\nf (201)\nand so\nvi=vf; (202)\n\u000b=\f: (203)\nThus the normal component of velocity is simply reversed in the collision.\nIn practice the normal component of velocity is reduced by a factor e < 1(called coe¢ cient of\nrestitution), such that\nvfcos\f=evicos\u000b: (204)\nSince\nvfsin\f\u0000visin\u000b (205)\nand\ntan\f=tan\u000b\ne; (206)\n28\n\nFigure 35: Collision of small mass with a rigid wall\nsovf< viand\f > \u000b . There is a loss of kinetic energy since\nv2\nf=v2\ni(sin2\u000b+e2cos2\u000b) =v2\ni+v2\ni\u0000\ne2\u00001\u0001\ncos2\u000b (207)\n1\n2mv2\nf\u00001\n2mv2\ni=1\n2mv2\ni\u0000\ne2\u00001\u0001\ncos2\u000b < 0: (208)\nFor an elastic collision, e= 1, and kinetic energy is conserved\n13.2 Between two bodies of \u0085nite mass, one initially at rest\nNo external forces act during the collision so the total momentum is conserved (always true).\n13.2.1 Head-on elastic collision ( e= 1)\nFigure 36: Head-on elastic collision\nConservation of momentum gives from \u0085g 36\nm1u1+ 0 = m1v1+m2v2; (209)\nv2=m1\nm2(u1\u0000v1) (210)\n29\n\nConservation of kinetic energy gives\n1\n2m1u2\n1+ 0 =1\n2m1v2\n1+1\n2m2v2\n2 (211)\nm1u2\n1=m1v2\n1+m2\u0014m1\nm2(u1\u0000v1)\u00152\n(212)\nu2\n1=v2\n1+m1\nm2(u1\u0000v1)2(213)\nu2\n1\u0000v2\n1=m1\nm2(u1\u0000v1)2(214)\n(u1\u0000v1) (u1+v1) =m1\nm2(u1\u0000v1)2: (215)\nThus one solution is v1=u1. The other is found from\n(u1+v1) =m1\nm2(u1\u0000v1); (216)\nv1=(m1\u0000m2)\n(m1+m2)u1: (217)\nThe corresponding velocities for particle 2 are\nv2= 0 ; (218)\nv2=m1\nm2\u0012\nu1\u0000(m1\u0000m2)\n(m1+m2)u1\u0013\n(219)\nv2=2m1u1\n(m1+m2): (220)\nThe solution v1=u1,v2= 0corresponds to no collision. The non-trivial solution is\nv1=(m1\u0000m2)\n(m1+m2)u1< u1 v2=2m1u1\n(m1+m2)>0: (221)\nIfm1> m 2then v1is positive; if m1< m 2then v1is negative. If m1=m2then v1= 0andv2=u1,\nthe incident particle is brought to rest and the struck one moves of with the initial velocity. If m1\u001dm2\nthen v1'u1andv2'2u1. Ifm2\u001dm1then v1' \u0000u1andv2'0, i.e. collision with a \"\u0085xed\" wall.\n13.2.2 Glancing collision of two balls\nWe shall assume balls are smooth, so that the impulse on each ball can only be along line of their centres.\nSuppose ball 2 is initially at rest as shown in \u0085g 37. The impulse on it, I2=m2v2, is along the line of\ncentres, so the direction of v2is along line of ball centres at impact. Impulse on ball 1 is\nI1=\u0000I2=mv1\u0000m1u1: (222)\nThe direction of v2is determined by angle \u001e, the angle between line of centres and the initial direction\nofu1.\nMomentum is conserved in the collision, so\nm1u1+ 0 = m1v1+m2v2 (223)\nIf collision is elastic then kinetic energy is conserved and\n1\n2m1u2\n1+ 0 =1\n2m1v2\n1+1\n2m2v2\n2: (224)\nExpressing momentum in the xandydirections\nm1u1=m1v1cos\u0012+m2v2cos\u001e; (225)\nm1v1sin\u0012\u0000m2v2sin\u001e= 0: (226)\n30\n\nFigure 37: Glancing collision\nThe angle \u001eis determined by the geometry of the collision. Thus we have three equations to solve for\nthree unknowns v1,v2and\u0012. The solution is rather complicated for general masses m1andm2but is\nquite simple for the special case of m1=m2. Then conservation of momentum gives\nmu1=mv1+mv2; (227)\nu1=v1+v2: (228)\nKinetic energy conservation gives\n1\n2mu2\n1=1\n2mv2\n1+1\n2mv2\n2 (229)\nu2\n1=v2\n1+v2\n2 (230)\nBut from the magnitude of u1\nu1\u0001u1= (v1+v2)\u0001(v1+v2) (231)\nu2\n1=v2\n1+v2\n2+ 2v1\u0001v2 (232)\nComparing equations eq(230) and eq(232) we see that\nv1\u0001v2= 0 (233)\nand so v1is perpendicular to v2, and \u0012+\u001e=\u0019=2.\n14 Motion in a plane expressed in plane polar coordinates\nParticle of mass mis at position P de\u0085ned by Cartesian coordinates (x; y)or polar coordinates (r; \u0012)or\nvector ras shown in \u0085g 38. Let us introduce a unit radial vector brand unit transverse vector b\u0012;brandb\u0012\nare orthogonal (perpendicular) to each other. The position P is r=rbr. In terms of unit vectors along\nthe \u0085xed Cartesian axes\nbr= cos \u0012bi+ sin \u0012bj (234)\nb\u0012=\u0000sin\u0012bi+ cos \u0012bj: (235)\nAs the particle moves the directions ofbrandb\u0012vary .\n31\n\nFigure 38: Diagram for unit vectors for two-dimensional motion\nConsider velocity of the particle,\nv=dr\ndt=d\ndt(rbr) =dr\ndtbr+rdbr\ndt: (236)\nAn expression for dbrcan be found algebraically or graphically as shown in \u0085g 39. Algebraically we have\nbr= cos \u0012bi+ sin \u0012bj; (237)\ndbr\ndt=\u0000sin\u0012d\u0012\ndtbi+ cos \u0012d\u0012\ndtbj; (238)\n=d\u0012\ndt\u0010\n\u0000sin\u0012bi+ cos \u0012bj\u0011\n; (239)\ndbr\ndt=d\u0012\ndtb\u0012: (240)\nSo\nv=dr\ndt=dr\ndtbr+rd\u0012\ndtb\u0012: (241)\nThe radial component of visdr\ndt; transverse component is rd\u0012\ndt.\nAn often used abbreviation for di¤erentiation with respect to time is to put a dot above the quantity,\nso the above expression for vis written as\nv=\u0005r=\u0005rbr+r\u0005\n\u0012b\u0012 (242)\nSpeed of the particle is\nv=jvj=pv\u0001v=q\n:r2+r2:\n\u00122\n: (243)\nConsider acceleration of the particle\na=dv\ndt=d\ndt\u0012dr\ndtbr+rd\u0012\ndtb\u0012\u0013\n(244)\n=d2r\ndt2br+dr\ndtdbr\ndt+dr\ndtd\u0012\ndtb\u0012+rd2\u0012\ndt2b\u0012+rd\u0012\ndtdb\u0012\ndt: (245)\n32\n\nFigure 39: Time dependence of polar vectors\nThe time derivativedb\u0012\ndtcan be found also algebraically or graphically, as illustrated in \u0085g 39.\nb\u0012=\u0000sin\u0012bi+ cos \u0012bj; (246)\ndb\u0012\ndt=\u0000cos\u0012d\u0012\ndtbi\u0000sin\u0012d\u0012\ndtbj; (247)\ndb\u0012\ndt=\u0000d\u0012\ndt\u0010\ncos\u0012bi+ sin \u0012bj\u0011\n=\u0000d\u0012\ndtbr: (248)\nHence the acceleration\na=d2r\ndt2br+dr\ndtd\u0012\ndtb\u0012+dr\ndtd\u0012\ndtb\u0012+rd2\u0012\ndt2b\u0012\u0000rd\u0012\ndtd\u0012\ndtbr; (249)\n=\"\nd2r\ndt2\u0000r\u0012d\u0012\ndt\u00132#\nbr+\u0014\n2dr\ndtd\u0012\ndt+rd2\u0012\ndt2\u0015\nb\u0012; (250)\na=\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012: (251)\nThe radial component of the acceleration is\u0012\n::r\u0000r:\n\u00122\u0013\n, the transverse component is\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n.\n14.1 Circular motion\nConsider a particle moving in a circle of radius ras shown in \u0085g 40. Then ris constant, so\u0001r= 0,\u0001\u0001r= 0.\nHence\nv=r\u0005\n\u0012b\u0012 (252)\n33\n\nFigure 40: Motion in a circle\nand the velocity is purely transverse.\nWe sometimes write !=d\u0012\ndt=\u0005\n\u0012, in which case\nv=r!b\u0012: (253)\nThe acceleration\na=\u0012\n\u0000r:\n\u00122\u0013\nbr+r::\n\u0012b\u0012: (254)\nIf the angular velocity is constant,\u0001!=\u0001\u0001\n\u0012= 0, and\na=\u0000r:\n\u00122\nbr=\u0000r!2br: (255)\nSince v=r!b\u0012then for the magnitudes v=!rand so\na=\u0000v2\nrbr (256)\nand the acceleration is directed towards the centre of the circle. This acceleration is called the centripetal\nacceleration . It follows that there must be a force F=ma=\u0000m!2rbr=\u0000mv2\nrbracting radially.\n15 Central force\nA central force is one which is purely directed along a radius, either towards or away from the centre, so\nthat\nF(r) =F(r)br: (257)\nIfF(r)ispositive the force is repulsive orcentrifugal ; ifF(r)isnegative the force is attractive\norcentripetal . Examples of central forces are\n(a) electrostatic force between point or spherically symmetric charges; like charges repel and unlike\ncharges attract,\n(b) gravitational force\nF(r) =\u0000GM1M2\nr2br (258)\nbetween point or spherically symmetric masses; this is always attractive.\n(c) tension in a string or spring.\nThe expressions above for velocity (see \u0085g 41) and acceleration in plane polar coordinates are partic-\nularly important in the case of central forces. The equation of motion is\nma=F=F(r)br; (259)\n34\n\nFigure 41: Vectors for rotational motion\nm\u0014\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012\u0015\n=F(r)br (260)\nWe see that that the force only enters into the radial component,\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=F(r) (261)\nand the transverse component\nm\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n= 0: (262)\nis independent of the nature of the force. Hence one may therefore make signi\u0085cant deductions about the\nmotion regardless of the force. The radial component of velocity is vr=\u0001rand the transverse component\nisv\u0012=r\u0001\n\u0012. Wede\u0085ne the magnitude of the angular momentum ,L, of the particle about point O\nas\nL= (mv\u0012)r=mr2\u0001\n\u0012: (263)\n[In general, to be discussed later, angular momentum L=r\u0002p=mr\u0002v. For randvin the plane of\nthe paper, then Lis out of the paper and perpendicular to it.] Thus\nL=mr2\u0001\n\u0012 (264)\ndL\ndt=d\ndt\u0012\nmr2\u0001\n\u0012\u0013\n=m\u0012\n2r\u0001r\u0001\n\u0012+r2\u0001\u0001\n\u0012\u0013\n(265)\n=mr\u0012\n2\u0001r\u0001\n\u0012+r\u0001\u0001\n\u0012\u0013\n=mra \u0012 (266)\nwhere we have used the expression for the transverse acceleration a\u0012= 2\u0001r\u0001\n\u0012+r\u0001\u0001\n\u0012. But for a central force\nthe transverse acceleration must be zero, so\ndL\ndt= 0; (267)\nand hence the angular momentum Lisconstant during the motion for any central force .\n15.1 Examples of central force motion\n15.1.1 Motion in a circle\n(1) Consider a planet, mass m, moving in a circular orbit about a star of mass Mas in \u0085g 42 The\n35\n\nFigure 42: Planet in circular motion about Sun\ncentripetal force is due to gravity,\nF(r) = \u0000GMm\nr2br (268)\n\u0000GMm\nr2br=m\u0012\n\u0000r:\n\u00122\u0013\nbr (269)\nr:\n\u00122\n=GM\nr2(270)\n:\n\u00122\n=!2=GM\nr3: (271)\nThe period of rotation T= 2\u0019=!, so\n\u00122\u0019\nT\u00132\n=GM\nr3(272)\nT2=4\u00192\nGMr3(273)\nT2/r3; (274)\nas expressed in Kepler\u0092 s third law of planetary motion.\nSpeed of the planet is v=r!, so\nv=r\nGM\nr: (275)\n(2) Consider a car of mass mmoving in a circular path of radius ron a horizontal surface with\ncoe¢ cient of friction \u0016as in \u0085g 43. What is the maximum speed without skidding sideways (ignore\ntoppling over for the moment)? The centripetal force necessary for it to travel round the circular path is\nFigure 43: Car in circular motion on horizontal track\nF=m\u0012\n\u0000v2\nr\u0013\nbr (276)\n36\n\nand this must be provided by the frictional force between the wheels and the ground. So as the normal\nreaction N=mg, then\nm\u0012\n\u0000v2\nr\u0013\nbr=\u0000Ffriction (277)\nm\u0012v2\nr\u0013\n=\u0016mg (278)\nvmax =p\u0016gr: (279)\nIf\u0016= 1,g'10 m s\u00002then vmax'p\n10rm s\u00001. Thus for r= 20 m ,vmax'14 m s\u00001'31mph.\nExample 11 (From 2000 exam paper, question 11.)\nParticle of mass mmoves on a smooth horizontal table subjected to a force\nF=\u0000K\nr3br: (280)\nIf particle is initially moving in a circle of radius ras in \u0085g 44we will determine the speed of the particle\nand its angular momentum. For this motion,\nFigure 44: Motion in a circle\nF=\u0000K\nr3br=m\u0012\n\u0000r:\n\u00122\u0013\nbr; (281)\nso\n\u0005\n\u0012=1\nr2r\nK\nm: (282)\nThe initial value of the angular momentum at r=r0is\nL=mr2\u0005\n\u0012=p\nmK; (283)\nis independent of r0and so is the only possible value for the angular momentum for motion in a circle\nunder an inverse cube force law.\nSuppose particle is given a radially outward impulse. The impulse does not change the angular\nmomentum so it remains at a valuep\nmK for any subsequent motion. Radial equation of motion after\nthe impulse is\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=\u0000K\nr3: (284)\nBut\u0005\n\u0012=1\nr2q\nK\nmso\nm2\n4::r\u0000r \n1\nr2r\nK\nm!23\n5=\u0000K\nr3; (285)\nm::r= 0 : (286)\nHence\u0001ris constant. So particle moves in a spiral with constant radial component of velocity as illustrated\nin \u0085g 45.\n37\n\nFigure 45: Trajectory of particle\nExample 12 Motion of a particle attached to a string and moving in a vertical circle, radius R, under\ngravity, see \u0085g 46. Assume string remains taut throughout the motion. At highest point, A, force is\nFigure 46: Motion of mass on string swung in circle in vertical plane\nF=\u0000(TA+mg)br=m\u0012\n\u0000R:\n\u00122\nA\u0013\nbr (287)\ngiving A\n\u0005\n\u0012A=r\n(TA+mg)\nmR: (288)\nThe velocity at A\nvA=R\u0005\n\u0012A=r\n(TA+mg)R\nm: (289)\nThe minimum speed at A is when the tension TA= 0, i.e.\nvAmin=p\ngR: (290)\nBy conservation of energy at lowest point B\n1\n2mv2\nB=1\n2mv2\nA+mg(2R) (291)\nv2\nB=v2\nA+ 4mgR: (292)\n38\n\nAt lowest point B the tension in the string TB, is given by\n(\u0000TB+mg)br=m\u0012\n\u0000R:\n\u00122\nB\u0013\nbr (293)\nTB\u0000mg =m\u0012\nR:\n\u00122\nB\u0013\n=mv2\nB\nR(294)\n=m\nR\u0000\nv2\nA+ 4mgR\u0001\n: (295)\nIfvA=vAmin=pgRthen\nTB=mg+m\nR(gR+ 4mgR ) = 6 mg: (296)\n16 Motion under inverse square law of force\nMotion under an inverse square law of force has been extensively analyzed because gravitation is such a\nforce. This is a central force with\nF=K\nr2br: (297)\nThus the potential energy function is\nV=K\nr(298)\nsince\nF=\u0000rV=\u0000br@V\n@r=K\nr2br: (299)\nNote V!0asr! 1 . IfKis positive the force is repulsive; if Kis negative the force is attractive.\nFor the gravitational force K=\u0000GMm and is always attractive. The gravitational constant G=\n6:67\u000210\u000011N m2kg\u00002. For the electrostatic force K=Q1Q2=(4\u0019\"0)where Q1andQ2are the charges\nwhich can be of either sign. The equation of motion of the particle is (see eq(260) and \u0085g 47)\nFigure 47: Rotational motion in a plane\nm\u0014\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012\u0015\n=K\nr2br: (300)\nThus for the radial component\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=K\nr2(301)\nand for the transverse component\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n= 0: (302)\n39\n\nIt was noted earlier that\nd\ndt\u0010\nr2:\n\u0012\u0011\n= 2r\u0005r:\n\u0012+r2\u0001\u0001\n\u0012=r\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n= 0: (303)\nThus as r6= 0, then r2:\n\u0012is constant, and so the angular momentum L=mr2:\n\u0012is also constant. Hence\n:\n\u0012=L\nmr2(304)\nand the radial equation can therefore be written in the form\nm\u0012\n::r\u0000L2\nm2r3\u0013\n=K\nr2: (305)\nInstead of solving for rand\u0012as functions of time we will consider the shape of the orbit, i.e. determine\nras a function of \u0012. To do this we de\u0085ne u= 1=r. We then have\n\u0001r=dr\ndt=d\ndt\u00121\nu\u0013\n=\u00001\nu2du\ndt=\u00001\nu2du\nd\u0012d\u0012\ndt; (306)\n\u0001r=\u00001\nu2du\nd\u0012\u0012L\nmr2\u0013\n=\u0000L\nmdu\nd\u0012: (307)\nDi¤erentiating again we get\n::r=d\u0001r\ndt=d\ndt\u0012\n\u0000L\nmdu\nd\u0012\u0013\n=d\nd\u0012\u0012\n\u0000L\nmdu\nd\u0012\u0013d\u0012\ndt=\u0000L\nmd2u\nd\u00122\u0012L\nmr2\u0013\n(308)\n::r=\u0000L2\nm2u2d2u\nd\u00122: (309)\nIn terms of uthe radial equation (305)is\nm\u0012\n\u0000L2\nm2u2d2u\nd\u00122\u0000u3L2\nm2\u0013\n=Ku2: (310)\nMultiplying through by \u0000m=\u0000\nL2u2\u0001\ngives\nd2u\nd\u00122+u=\u0000mK\nL2: (311)\nIn terms of the variable y=u+mK=L2this is the equation of simple harmonic motion,\nd2y\nd\u00122+y= 0 (312)\nwith solution y=Acos (\u0012\u0000\u00120). Thus the general solution of eq(311) is\nu=Acos (\u0012\u0000\u00120)\u0000mK\nL2=1\nr: (313)\nThis is of the same form as the general equation of a conic section , (see eq(317))\nu=1\nr=1\nh(1 +ecos\u0012): (314)\nWe can choose \u00120= 0as this de\u0085nes the orientation of the trajectory.\nIfKis negative, i.e. attractive force, the trajectory is of the form shown in \u0085g 48.\nIfKis positive, i.e. repulsive force, the trajectory is of this form in \u0085g 49\n40\n\nFigure 48: Trajectory for attractive inverse square force law, focus at O\nFigure 49: Trajectory for repulsive inverse square law, focus at O\n41\n\nFigure 50: De\u0085nition of terms for conic section\n16.1 Conic sections\nA conic section is a locus of a point which moves in a plane such that its distance from a \u0085xed point, the\nfocus, is a constant ratio e, the eccentricity, to the distance from a \u0085xed straight line, the directrix, see\n\u0085g 50.\nConsider an attractive force so that the relevant conic section is as in the diagram, \u0085g50. The quantity\nhis the value of rwhen \u0012=\u0019=2. From the geometry and de\u0085nitions of eandh, we have\nrcos\u0012+r\ne=h\ne; (315)\nand\nr(1 +ecos\u0012) =h; (316)\nor in terms of u= 1=r,\nu=1\nr=1\nh(1 +ecos\u0012): (317)\nWe shall see that possible forms of the trajectory depend on whether the force is repulsive or attractive.\nFor the attractive force it matters whether the total energy is positive, zero or negative.\n16.1.1 Trajectories - Attractive force ( Kis negative)\nFor an attractive central force , such as gravity there are three types of orbit:\n1. If total energy E > 0, eccentricity e >1the trajectory is a hyperbola, as in \u0085g 51.\n2. If E= 0,e= 0, the trajectory is a parabola, as in \u0085g 52.\n3. If E < 0,e <1, the trajectory is an ellipse, as in \u0085g 53.\nA circle is a special case of an ellipse with zero eccentricity.\n42\n\nFigure 51: Hyperbola trajectory, E > 0,e >1\nFigure 52: Parabola trajectory, E= 0,e= 0\nFigure 53: Ellipse trajectory, E < 0,e <1\n43\n\n16.1.2 Determination of eccentricity\nWe shall determine the eccentricity of an orbit for given total energy Eand angular momentum L. The\ntotal energy of the particle is\nE=1\n2mv2+V (318)\nand constant throughout the motion (gravitation is a conservative force). So\nE=1\n2m\u0012\n\u0001r2\n+r2:\n\u00122\u0013\n+K\nr: (319)\nBut\u0001r=\u0000L\nmdu\nd\u0012, and:\n\u0012=L\nmr2=L\nmu2so\nE=1\n2m\"\u0012L\nmdu\nd\u0012\u00132\n+1\nu2\u0012L\nmu2\u00132#\n+Ku (320)\n=1\n2m\"\nL2\nm2\u0012du\nd\u0012\u00132\n+L2\nm2u2#\n+Ku (321)\n= [positive kinetic energy] + potential energy : (322)\nHence we have that\n(i) if Kis positive then Emust also be positive.\n(ii) if Kis negative then Emay be positive, zero or negative.\nThe equation of the orbit is (see eq(313))\nu=Acos\u0012\u0000mK\nL2; (323)\nsodu\nd\u0012=\u0000Asin\u0012 (324)\nand the expression for the total energy becomes\nE=1\n2m\"\nL2\nm2(\u0000Asin\u0012)2+L2\nm2\u0012\nAcos\u0012\u0000mK\nL2\u00132#\n+K\u0012\nAcos\u0012\u0000mK\nL2\u0013\n: (325)\nSince the energy is constant throughout the motion we can evaluate the expression for Eat any convenient\npoint. Choose \u0012=\u0019=2. The energy is\nE=1\n2m\u0014L2A2\nm2+L2\nm2m2K2\nL4\u0015\n\u0000mK2\nL2(326)\n=A2L2\n2m\u0000mK2\n2L2: (327)\nWe can use this to determine the arbitrary constant A, since re-arranging\nA2=2m\nL2\u0012\nE+mK2\n2L2\u0013\n=m2K2\nL4\u0012\n1 +2EL2\nmK2\u0013\n; (328)\nand\nA=mjKj\nL2s\u0012\n1 +2EL2\nmK2\u0013\n: (329)\nThus the orbit is determined completely if the values of EandLare known for a given Kandm.\nThe solution for the motion is\nu=Acos\u0012\u0000mK\nL2(330)\nand the general form of a conic section is\nu=1\nh(1 +ecos\u0012) (331)\n=e\nhcos\u0012+1\nh: (332)\n44\n\nHence we have\ne\nh=A; (333)\n1\nh=\u0000mK\nL2; (334)\ne=\u0000L2A\nmK=\u0000jKj\nKs\u0012\n1 +2EL2\nmK2\u0013\n: (335)\nFor an attractive inverse square law (such as gravitation) Kis negative and so\ne=s\u0012\n1 +2EL2\nmK2\u0013\n: (336)\nClearly\n(a) if E > 0then e >1and the motion is a hyperbola,\n(b) if E= 0then e= 1and motion is a parabola,\n(c) if E < 0then e <1and motion is an ellipse. In this case the particle cannot escape to in\u0085nity\nbecause at in\u0085nity V= 0and the kinetic energy \u00150. Therefore to escape to in\u0085nity requires E\u00150.\nConsider an elliptic orbit as in the diagram, If we know speed of particle at position of closest approach,\nFigure 54: Parameters for an elliptical orbit\nwe know everything about the orbit. The angular momentum is\nL=mrAvA (337)\nand energy is\nE=1\n2mv2\nA\u0000jKj\nrA: (338)\nWe can determine the eccentricity eand the length of the semi-major axis, a. From general equation\nr(1 +ecos\u0012) =h (339)\nwe have for rA(\u0012= 0) and rB(\u0012=\u0019),\nrA(1 +e) = h; rB(1\u0000e) =h; (340)\n2a=rA+rB=h\n(1 +e)+h\n(1\u0000e)=2h\n(1\u0000e2); (341)\na=h\n(1\u0000e2): (342)\n45\n\nFrom the expressions for handeabove in terms of EandL,\na=\u0000L2\nmK\n\u00002EL2\nmK2=K\n2E=\f\f\f\fK\n2E\f\f\f\f: (343)\nFor the gravitational force, K=\u0000GMm with Gthe gravitational constant, 6:67\u000210\u000011N m2kg\u00002. The\npoint A is the perihelion if the Sun is at the focus, and perigee if the Earth is at the focus. Similarly\npoint B is the aphelion (Sun at the focus) or apogee (Earth at the focus).\nIf origin of coordinates is taken at mid-point of the major axis, the focus is at (ae;0)and the Cartesian\nequation of the orbit is\nx2\nh\nh2\n(1\u0000e2)2i+y2\nh\nh2\n1\u0000e2i= 1 ; (344)\nx2\na2+y2\nb2= 1 (345)\nwith\na=h\n1\u0000e2; b =hp\n1\u0000e2: (346)\n16.2 Kepler\u0092 s laws of planetary motion\n1. Planets move in elliptic orbits with Sun at a focus,\n2. The radius vector sweeps out equal areas in equal times as illustrated in \u0085g 55.\nFigure 55: Areas for Kepler\u0092 s law\n3. (Period of rotation)2/(semi-major axis)3.\nFrom \u0085g 56, the area of triangle is\ndA=1\n2rv\u0012dt=1\n2rr\u0001\n\u0012dt (347)\ndA\ndt=1\n2r2\u0001\n\u0012: (348)\nBut the angular momentum L=mr2\u0001\n\u0012is a constant for any central force so\n46\n\nFigure 56: Kepler\u0092 s law diagram\ndA\ndt=1\n2L\nm=const : (349)\nHence we have Kepler\u0092 s second law.\nThe third law was derived earlier for a circular orbit where a=rand will not be done again for the\ngeneral elliptical motion.\n17 Equivalent one-dimensional equation of motion\nThe radial equation of motion for a central force is\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=F(r) (350)\nand\nL=mr2\u0001\n\u0012= cons tan t : (351)\nThus\n\u0001\n\u0012=L\nmr2(352)\nand\nm \n::r\u0000r\u0012L\nmr2\u00132!\n=F(r) (353)\nm::r\u0000L2\nmr3=F(r) (354)\nm::r=F(r) +L2\nmr3: (355)\nThis is the same equation of motion for a particle moving in one-dimension under an e¤ective force\nFeff=F(r) +L2\nmr3: (356)\nThe second termL2\nmr3is called a centrifugal force\nFC=L2\nmr3: (357)\n47\n\nIfF(r)is a conservative force we can introduce a potential function V(r)such that\nF(r) =\u0000dV\ndr: (358)\nWe can also introduce the centrifugal potential\nVC=1\n2L2\nmr2(359)\nso that\nFC(r) =\u0000dVC\ndr: (360)\nconsider an attractive inverse square law, F(r) =\u0000jKj=r2, then V=\u0000jKj=rand the total e¤ective\npotential function (see \u0085g 57) is\nVeff=\u0000jKj\nr+L2\n2mr2: (361)\nIf total energy E < 0then the energy line crosses Veffatr=rminandr=rmax, with rmin+rmax= 2a,\nFigure 57: E¤ective potential\nas in \u0085g 57. If total energy E > 0then rmaxis in\u0085nite and orbit is a hyperbola. If E= 0,rmaxis in\u0085nite\nbut particle has zero kinetic energy at in\u0085nity.\n18 Reduced mass\nWhen considering a planet orbiting the Sun we have assumed that the Sun is \u0085xed at the focus. However\nthe mass of the Sun, M, is \u0085nite and therefore the Sun and planet both move with respect to their overall\ncentre of mass. The centre of mass is at point O in \u0085g 58 such that\n48\n\nFigure 58: Rotation about centre of mass of two bodies\nR=M\n(M+m)r: (362)\nThe acceleration of mrelative to O is\na=d2R\ndt2=M\n(M+m)d2r\ndt2: (363)\nThus the equation of motion of the planet is\nF=ma=mM\n(M+m)d2r\ndt2=\u0016d2r\ndt2: (364)\nThat is the same as a particle of mass\n\u0016=mM\n(M+m)< m (365)\nat a position rrelative to the \u0085xed point O (centre of mass). The real system in which both bodies\norbit about a common centre of mass is equivalent to a body of the reduced mass \u0016orbiting at a distance\nrfrom the (centre of mass) \u0085xed point, see \u0085g 59.\nFigure 59: Equivalent system: reduced mass\nNote that \u0016=mM\n(M+m)< m < M . Ifm\u001cM, then \u0016'm; ifm=Mthen \u0016=m=2.\nNow let\u0092 s look at the kinetic energy of the system. If velocity of mass MisV, that of mass misv,\nthen the total kinetic energy is\nE=1\n2MV2+1\n2mv2: (366)\nSince from \u0085g 58\nR=M\n(M+m)r (367)\nand both masses must have the same angular velocity about the centre of mass, then\nv=!R=!\u0012M\nm+M\u0013\nr; V=!\u0012m\nm+M\u0013\nr: (368)\n49\n\nThe kinetic energy of the system\nE=1\n2M!2r2\u0012m\nm+M\u00132\n+1\n2m!2r2\u0012M\nm+M\u00132\n(369)\n=1\n2!2r2\u00121\nm+M\u00132\u0000\nMm2+mM2\u0001\n=1\n2!2r2\u00121\nm+M\u00132\nmM (m+M) (370)\n=\u0012mM\nm+M\u0013\n!2r2=1\n2\u0016!2r2(371)\nis the same as that of a mass \u0016orbiting the centre of mass at a radius rat angular velocity !. Thus the\nreduced mass and the combined masses have the same kinetic energy.\nSimilarly if we look at the angular momentum of the system\nL=m(!R)R+M!(r\u0000R) (r\u0000R): (372)\nSince\nR=M\n(M+m)r (373)\nthen\n(r\u0000R) =m\n(m+M)r (374)\nand\nL=m!\u0014M\n(M+m)r\u00152\n+M!\u0014m\n(m+M)r\u00152\n(375)\n=mM\n(m+M)2(M+m) =mM\n(m+M)!r2=\u0016!r2: (376)\nThe angular,omentum of the reduced mass particle is the same as that of the two particles.\n19 Frames of reference\nA frame of reference is de\u0085ned by a set of coordinate axes (x; y; z )at rest relative to a particular\nobserver. The observer can express position ,velocity andacceleration of a particle relative to this\nframe of reference . We want to consider transformations of these quantities between di¤erent frames\nof reference. This is particularly important in the theory of relativity .\nConsider one frame of reference S, \u0085xed relative to the Earth and another frame of reference S0\u0085xed\nrelative to a car moving with constant velocity valong the x-axis, as in \u0085g 60. Suppose origins Oand\nO0coincide at time t= 0. A point Phas coordinates xat time tinSandx0inS0, so that\nx0=x\u0000vt: (377)\nIf the point Pis not on the x-axis the yandzcoordinates are the same in both frames, i.e.\nx0=x\u0000vt; (378)\ny0=y; (379)\nz0=z: (380)\nNow suppose the point Pis a bird \u0087 ying at a constant velocity ualong the x-axis relative to the Earth,\nthen\nu=dx\ndt: (381)\nVelocity of the bird relative to the car is\nu0=dx0\ndt=dx\ndt\u0000v=u\u0000v: (382)\n50\n\nFigure 60: Two Cartesian inertial frames of reference\nGenerally if the bird has velocity uand the car has velocity vrelative to the Earth, the velocity of the\nbird relative to the car is\nu0=u\u0000v: (383)\nIn terms of components\nu0\nx=ux\u0000vx; (384)\nu0\ny=uy\u0000vy; (385)\nu0\nz=uz\u0000vz: (386)\nThe velocity diagram is (see \u0085g 61)\nFigure 61: Velocity diagram\nExample 13 Rain falling vertically down with velocity urelative to the Earth; pedestrian is walking\nhorizontally with velocity vrelative to the Earth. Velocity of rain relative to pedestrian is u0=u\u0000v=\nu+ (\u0000v), see \u0085g 62.\nExample 14 Ship sailing north-east at velocity u0relative to the water. Current of water \u0087 owing with\nvelocity vfrom east to west. What is velocity of ship relative to the Earth? Then u0=u\u0000v, sou=u0+v\nis velocity of ship relative to the Earth, as in \u0085g 63. Note ship is pointing in the direction of velocity u0\nbut is travelling along direction of velocity u.\n51\n\nFigure 62: Velocity diagram fro rain and pedestrian\nFigure 63: Velocity diagram for boat and water\n19.1 Appropriate direction for interception\nConsider two ships that want to intercept. Ship 1 is travelling with constant velocity u1on a given\nbearing. Ship 2 is travelling at a constant speed u2. We need to determine the bearing (direction)\nof ship 2 such that the two ships will intercept, given that the ships are at known positions AandB\nrespectively at time t. What must angle \fbe for interception in \u0085g 64? Consider motion of ship 2 relative\nto ship 1, i.e. u0\n2=u2\u0000u1. For interception ship 2 must appear relative to ship 1 to be travelling along\nthe direction BtoA. Thus u0\n2=u2\u0000u1is in direction\u0000 \u0000 !BA. Time to intercept is\nt1=D\nju0\n2j: (387)\nWe can draw the velocity diagram with u1,u2,\u000bgiven and use sine rule to determine \f.\nu1\nsin\f=u2\nsin\u000b=u0\n2\nsin\r: (388)\nThe problem could be solved in the Earth frame, since the positions of ship 1 and 2 are given by\nrA(t) = rA+u1t; (389)\nrB(t) = rB+u2t: (390)\nInterception occurs when rB(t) =rA(t)i.e.\nrB+u2t=rA+u1t; (391)\nrA\u0000rB=u2t\u0000u1t; (392)\nt=ju2\u0000u1j\njrA\u0000rBj: (393)\n52\n\nFigure 64: (a) Spatial and (b) velocity diagrams for interception\nThus u0\n2is along rA\u0000rBandtis the time to interception.\nExample 15 Q3 1B27 Exam 2003. u1= 25 km =h,u2= 35 km =h, distance AB= 10 km . Velocity\ndiagram \u0085g 65. u0\n2must lie in direction of line BA, i.e. due N, and \u000b+\f= 45\u000e. From sine rule\nFigure 65: Space and velocity diagram for exam problem\nu1\nsin\u000b=u2\nsin 135\u000e=u2\n1=p\n2; (394)\nsin\u000b=u1\nu2p\n2=25\n35p\n2= 0:505; (395)\n\u000b= 30 :34\u000e: (396)\nTherefore \f= 45\u0000\u000b= 14:66\u000e. Also\nu0\n2\nsin\f=u1\nsin\u000b(397)\nu0\n2=u1sin\f\nsin\u000b=25\u00020:253\n0:505= 12:52 km =h: (398)\n53\n\nTime to interception is\nt=10 km\n12:52 km =h= 0:80 h: (399)\n19.2 Transformation of velocity and acceleration\nConsider again a car travelling along the x-axis with velocity vand a bird \u0087 ying along the x-axis with\nvelocity urelative to the ground as in \u0085g 66.\nFigure 66: Diagram for acceleration as seen in two frames\nVelocity of bird relative to car is (from x0=x\u0000vt),\nu0=u\u0000v: (400)\nSuppose vis constant but bird is accelerating relative to the ground, then\ndu0\ndt=du\ndt(401)\nand the acceleration of the bird is the same in both frames of reference. Suppose now that the car is\nalso accelerating relative to the Earth, then\ndu0\ndt=du\ndt\u0000dv\ndt; (402)\nwithdu0\ndtbeing the acceleration of the bird relative to the car,du\ndtbeing the acceleration of the bird\nrelative to the Earth, anddv\ndtbeing the acceleration of the car relative to the Earth. The force on the\nbird necessary to accelerate it in frame S (Earth) is\nF=mdu\ndt: (403)\nThe equation of motion of the bird in the reference frame of the car, S0, isNOT\nF=mdu0\ndt: (404)\nIt is correctly\nF0=mdu\ndt\u0000mdv\ndt; (405)\ni.e. the e¤ective force on the bird in the car\u0092 s frame of reference, S0, is\nF0=F\u0000ma; (406)\nwhere a=dv\ndtis the acceleration of the car (in frame S). Thus if we want to apply Newton\u0092 s laws of\nmotion in an accelerating frame we must add to the real force Fthe\u0085ctitious force (\u0000ma). An\naccelerating frame of reference is also called a non-inertial frame. An inertial (or non-accelerating)\nframe of reference is one in which Newton\u0092 s laws of motion apply without needing to introduce \u0085ctitious\nforces.\n54\n\n20 Rotating frame of reference\nConsider a person standing on a rotating roundabout as in \u0085g 67. Real force of friction at the feet\nFigure 67: Observer in a rotating frame\nprovides the centripetal acceleration r!2, therefore F=mr!2.Relative to the roundabout the\nperson is at rest under the in\u0087 uence of a real centripetal force F=mr!2and a \u0085ctitious centrifugal\nforce F=mr!2acting through the centre of mass. If !is large enough, the person may fall over\noutwards under the in\u0087 uence of these two forces, which constitute a couple acting on the person (see\nsection on rotational motion and couples later).\n20.1 Geostationary satellite\nSatellite appears stationary relative to an observer on a rotating Earth as shown in \u0085g 67. Real force on\nFigure 68: Geostationary satellite\nthe satellite if the gravitational force (centripetal force)\nF=\u0000GMm\nR2=\u0000mR!2: (407)\nThe observer on Earth thinks there is also a \u0085ctitious centrifugal force\nF=mR!2=GMm\nR2(408)\nso there is no net force, and so the satellite is at rest and in equilibrium in this frame.\n20.2 Observing a moving body in a rotating frame\nConsider a person Bat rest on the roundabout observing a moving body, e.g. a \u0087 ying bird, as in \u0085g\n69 Consider the same bird being observed by a second person Aat rest on the ground and not on\nthe roundabout. To observer Athe path of the bird is a straight line. Relative to observer Bon the\n55\n\nFigure 69: Observers in rotaing and inertial frames\nroundabout the path of the bird is curved. Hence observer Bassumes there is a transverse horizontal\nforce Fcoracting on the bird de\u0087 ecting the bird to the right for the given sense of rotation. This is the\nCoriolis force .\nThe general expression for the Coriolis force is\nFcor=\u00002m!\u0002v; (409)\nwhere !is the angular velocity vector of rotating frame, vis velocity of particle of mass mrelative to\nthe rotating frame of reference. Note Fcoris perpendicular to both !andvand so always transverse to\nthe direction of motion. There are several interesting consequences of the Coriolis force:\nConsider the e¤ect of the rotating Earth:\nThrow a ball horizontally due East at three di¤erent places on the Earth\u0092 s surface, A,B, and Cas in\n\u0085g 70 - dotted line is the local horizontal at each place on the Earth. In the northern hemisphere (point\nA) the Coriolis force de\u0087 ects the ball to the right as it has a component in this direction. On the equator\n(point B) the Coriolis force has no horizontal component so the ball is not de\u0087 ected. (Coriolis force is\nvertical so a¤ects the local e¤ective force due to gravity.) In the southern hemisphere the ball is de\u0087 ected\nto the left.\nWeather systems are determined by the Coriolis force. Wind blows anticlockwise (clockwise) around\nregion of low pressure in the northern (southern) hemispheres. Winds blow approximately along isobars\ninstead of down the pressure gradient.\nOne should set the size of the Coriolis force on the rotating Earth into context. The maximum value\nof the Coriolis acceleration is a=\u00002!v. Since != (2\u0019)=(24\u000260\u000260) rad s\u00001= 7:272 2\u000210\u00005rad s\u00001\nthen for a speed of 15 m s\u00001('33 mph) ,a= 2:2\u000210\u00003m s\u00002, (quite small compared to the vertical\ncomponent of acceleration due to gravity on the Earth\u0092 s surface).\n20.3 Simple derivation of expression for Coriolis force\nConsider a massless smooth rod on which there is a small ring of mass m. The rod is rotating with\nconstant angular velocity !in a horizontal plane. As the rod is smooth there can be no radial force (from\nfriction) on the ring. The only force on the ring is a transverse normal reaction force Nas shown in \u0085g\n71.\n56\n\nFigure 70: E¤ect of Coriolis force at Earth\u0092 s surface\nFigure 71: Diagram for simple derivation of expression for Coriolis force\nThe equation of motion of the ring is, relative to the inertial reference frame,\nma=N (410)\nm\u0014\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012\u0015\n=Nb\u0012: (411)\nTherefore the radial equation of motion is\nm\u0012\n::r\u0000r:\n\u00122\u0013\n= 0 (412)\nand the transverse one is\nm\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n=N: (413)\nBut:\n\u0012=!=constant, so\nm\u0000::r\u0000r!2\u0001\n= 0 ; (414)\n2m\u0001r! =N: (415)\n57\n\nNow consider the equation of motion of the ring relative to the rotating rod. In this frame the ring can\nonly move in one dimension along the rod. If we work in this frame we must add to the real forces the\n\u0085ctitious centrifugal force Fcand, because the ring is moving relative to the rotating frame, the Coriolis\nforce Fcoras in \u0085g 72 In the rotating frame the equations of motion is radially\nFigure 72: Forces on ring in inertial and rotating frames\nm\u0001\u0001r=Fc (416)\nand transversely,\nN\u0000Fcor= 0 (417)\nas there is no transverse motion in the rotating frame. Comparing eq(414) with eq(416) gives a centrifugal\nforce\nFc=mr!2(418)\nand comparing eq(415) and eq(417) gives a Coriolis force\nFcor= 2m\u0001r!: (419)\nIn the rotating frame the ring has only radial velocity v=\u0001r. Thus the magnitude of the Coriolis force\nFcor= 2mv!: (420)\nThe direction of Fcorand its magnitude is consistent with the general expression quoted previously, i.e.\nFcor=\u00002m!\u0002v (421)\nas!is out of the page and vis along the rod.\n21 Angular momentum and torques\nParticle of mass mhas velocity vat position vector ras in \u0085g 73. The angular momentum is de\u0085ned\nby\nL=r\u0002p=mr\u0002v (422)\nabout point O. The direction of Lis given by the usual right-hand rule for a vector product.\nConsider a force Facting on the particle. The torque ormoment of force about point Oisde\u0085ned\nby\n\u001c=r\u0002F: (423)\nBut\nF=mdv\ndt(424)\n58\n\nFigure 73: Position and velocity vectors for rotational motion\nso\n\u001c=mr\u0002dv\ndt: (425)\nConsider\nd (r\u0002v)\ndt=dr\ndt\u0002v+r\u0002dv\ndt(426)\n=v\u0002v+r\u0002dv\ndt= 0 + r\u0002dv\ndt(427)\nd (r\u0002v)\ndt=r\u0002dv\ndt(428)\nand therefore\n\u001c=mr\u0002dv\ndt=md (r\u0002v)\ndt=d (mr\u0002v)\ndt(429)\n\u001c=dL\ndt: (430)\nHence torque is equal to the rate of change of angular momentum . This is analogous to the\nlinear case of force equal to rate of change of linear momentum, i.e. Newton\u0092 s second law. If \u001c=0thenL\nis constant in magnitude and direction. If \u001c=0then either force F= 0orr\u0002Fin which case force Fand\nrare parallel and the force is a central force. Thus Lis constant for any central force, F(r) =F(r)br.\nFor a system in equilibrium, L= 0and constant so there is no net torque about any point. This is\nthe basis of taking moments to determine the magnitude of forces.\nExample 16 A massless beam is supported at points AandBand masses m1andm2are attached as in\nthe \u0085g 74. Resolving vertically,\nN1+N2=m1g+m2g= (m1+m2)g: (431)\nTake moments about A, (assume clockwise moment is positive, anti-clockwise moment is negative)\nm1gx1\u0000N2x2+m2gx3= 0 (432)\nN2=(m1x1+m2x3)g\nx2; (433)\nN1= (m1+m2)g\u0000N2: (434)\nExample 17 Motorcyclist with uniform acceleration such that front wheels lift o¤ the ground as in \u0085g\n75!The real forces are, weight mg, friction F=maand normal reaction N=mg. In motorcyclists\u0092own\nframe of reference (which is accelerating relative to the ground) he is in equilibrium under in\u0087 uences of\n59\n\nFigure 74: Masses on supported beam\nFigure 75: Accelerating cyclist\nrealand \u0085ctitious force F=maacting through the centre of mass as shown. Taking moments about point\nof contact of rear wheel with the ground,\nmgd\u0000Fh= 0: (435)\nExample 18 An accelerating car as shown in \u0085g 76:We will assume rear-wheel drive; that centre of mass\nis at height habove the ground; distances d1andd2from wheels as shown in the diagram. Real forces\nare: weight mg; friction F=maat the driven rear wheels contact with the ground (There is also friction\nbetween front wheels and the ground acting in the opposite sense causing the front wheels to turn rather\nthan skid.); normal reactions at wheels, N1andN2. We have\nN1+N2=mg: (436)\nIn the car\u0092 s accelerating frame we add a \u0085ctitious force F=maas shown. In this frame the car is now\nin equilibrium. Taking moments about point A,\nmgd 1\u0000N2(d1+d2)\u0000Fh= 0; (437)\nN2=1\n(d1+d2)(mgd 1\u0000mah ) =m\n(d1+d2)(gd1\u0000ah); (438)\n60\n\nFigure 76: Accelerating vehicle\nand\nN1=mg\u0000N2=mg\u0000m\n(d1+d2)(gd1\u0000ah) (439)\nN1=m\n(d1+d2)(gd2+ah): (440)\nFor a rear-wheel drive car the maximum acceleration of the car is either when (a) F=ma=\u0016N1where\n\u0016is coe¢ cient of friction, whence\na=\u0016\n(d1+d2)(gd2+ah); (441)\nor (b) if \u0016is large enough when N2= 0whence\na=gd1\nh: (442)\n(Hence the need for a low centre of mass in racing cars!) Any higher acceleration than this will cause the\ncar to somersault backwards. For a front-wheel drive car, maximum acceleration occurs for F=ma=\n\u0016N2. The front wheels can never leave the ground because they will skid \u0085rst.\n22 Systems of particles - properties of centre of mass\nConsider a system of nparticles of masses, mi(i= 1;2; : : : ; n )at position vectors ri(i= 1;2; : : : ; n )as\nshown in \u0085g 77. Total mass is\nM=nX\ni=1mi: (443)\nThecentre of mass is at position\nR=Pn\ni=1miriPn\ni=1mi=Pn\ni=1miri\nM: (444)\nThe position Ris such that if the total mass Mwere at Rit would have the same moment about origin\nOas the actual system, i.e.\nMR=nX\ni=1miri: (445)\nThe centre of mass is therefore that point about which a rigid body will balance if in a uniform gravita-\ntional \u0085eld.\n61\n\nFigure 77: System of particles acted on by forces\nIf the system of particles is not subjected to any external forces the centre of mass remains at\nrest or in uniform motion , i.e. no acceleration of the centre of mass. This is true even if the particles\nin the system are moving relative to each other and interact with each other. Also, if system of particles\nis subjected to external forces the centre of mass behaves as if all the forces acted at that\nposition . In addition, any \u0085ctitious force appears to act at through the centre of mass.\nProof. LetFibe force on i-th particle, then\nFi=Fiext+Fiint; (446)\nwhere Fiextis external force on particle i, and Fiintis the internal force on particle idue to internal\ninteractions with all other particles. The equation of motion of particle iis\nFi=mid2ri\ndt2(447)\nand the resultant force on the system is\nF=nX\ni=1Fi=nX\ni=1mid2ri\ndt2=d2\ndt2 nX\ni=1miri!\n(448)\nF=d2\ndt2(MR) =Md2R\ndt2: (449)\nTherefore the centre of mass moves as if all the forces act on a mass Mat the position of the centre of\nmass.\nSince\nF=nX\ni=1Fi=nX\ni=1Fiext+nX\ni=1Fiint (450)\nandnX\ni=1Fiint= 0 (451)\nby Newton\u0092 s third law, we have\nF=nX\ni=1Fi=Md2R\ndt2: (452)\n62\n\nTherefore only external forces in\u0087 uence the motion of the centre of mass. If F= 0(no resultant external\nforce) then\nd2R\ndt2= 0 (453)\nand velocity of centre of massdR\ndtis constant.\n23 Rigid bodies\n23.1 Centre of mass\nRigid bodies can be considered as a system of particles rigidly joined together. An example is a uniform\nthin rod of length Land mass Mas in \u0085g 78. We can determine the position of the centre of mass as\nFigure 78: Uniform thin rod\nfollows:\nMass per unit length is\n\u001b=M\nL(454)\nso the mass of an element of length dxisdm=\u001bdx. Therefore from the de\u0085nition, the position of the\ncentre of mass is given by\nX=RL\n0xdm\nRL\n0dm=RL\n0x \u001bdx\nRL\n0\u001bdx=1\n2\u001bx2jL\n0\nM=1\n2\u001bL2\nM=1\n2\u001bL2\nM=1\n2M\nLL2\nM=1\n2L (455)\nas might have been expected. Note this procedure works even when \u001bis not constant.\nExample 19 Position of centre of mass of a thin wedge shaped rod (as shown in \u0085g 79) where the mass\nper unit length is proportional to distance from one end, i.e. \u001b=kxwith ka constant. Then mass of\nFigure 79: Centre of mass of wedge rod\nelement of length dxisdm=\u001bdx=kxdxand total mass is\nM=ZL\n0dm=ZL\n0\u001bdx=ZL\n0kxdx=1\n2kL2: (456)\nThe position of the centre of mass is\nX=RL\n0xdm\nRL\n0dm=RL\n0x \u001bdx\nM=RL\n0kx2dx\nM=1\n3kL3\n1\n2kL2=2\n3L: (457)\n63\n\n23.2 Rotation of a rigid body about a \u0085xed axis\nConsider rotation of a rigid body as depicted in \u0085g 80, with the axis of rotation perpendicular to the\npage. Let !be the angular velocity. A mass element miis at a perpendicular distance rifrom the pivot.\nThe only velocity is transverse to this direction of magnitude vi=!ri. For a rigid body, all elements\nmust have the same angular velocity. The kinetic energy of rotation is\nFigure 80: Rotating rigid body\nKE=nX\ni=11\n2miv2\ni=nX\ni=11\n2mi(!ri)2=1\n2!2nX\ni=1mir2\ni: (458)\nThe last summation depends only on the distribution of mass within the body. We can de\u0085ne the\nmoment of inertia, I,of the body about this axis by\nI=nX\ni=1mir2\ni; (459)\nand\nKE=1\n2I!2: (460)\nFor a continuous mass distribution with density \u001awhich may vary with position, an element of volume dv\nhas mass dm=\u001adv. Ifr?is the perpendicular distance from the axis, the moment of inertia is obtained\nfrom\nI=Z\nvolr2\n?\u001adv: (461)\nThe value of the moment of inertia depends on the mass distribution in the body and the position of\nthe pivot . Later we will calculate the moment of inertia of various bodies.\n23.3 Angular momentum of a rotating rigid body.\nThe angular momentum of a point mass mmoving in a circle of radius rwith angular velocity !is\nL=mr2!=mvr: (462)\n64\n\nTherefore the angular momentum of an extended rigid body is\nL=nX\ni=1mir2\ni!=!nX\ni=1mir2\ni=I!: (463)\nAngular momentum is a vector quantity so we should write\nL=I! (464)\nwhere direction of vector is along the axis of rotation in a sense given by a right-handed screw.\n23.4 Correspondence between rotational and translational motion\nThe previous sections show that we can establish a table of correspondences between quantities related\nto linear motion and to rotational motion.\nLinear Rotation\nmass m I moment of inertia\nvelocity v ! angular velocity\nlinear momentum p=mv L =I! angular momentum\nlinear kinetic energy1\n2mv2 1\n2I!2rotational kinetic energy\nforce F=dp\ndt\u001c=dL\ndttorque\nF=mdv\ndtF=Id!\ndt\n23.5 Compound pendulum\nThe mass of the body is M. The centre of mass is a distance `from the pivot as shown in \u0085g81. It will be\nassumed that the moment of inertia, I, of this body about an axis through the pivot point Ais known.\nTorque of the weight about Ais\nFigure 81: Compound pendulum\n\u001c=\u0000Mg` sin\u0012: (465)\nNote the negative sign as the torque is in the sense of decreasing \u0012.\nThe equation of motion for rotation about the axis through Ais\n\u001c=dL\ndt=d\ndt(I!) =Id!\ndt=Id2\u0012\ndt2(466)\nId2\u0012\ndt2=\u0000Mg` sin\u0012: (467)\n65\n\nIf the angle \u0012is always small, then sin\u0012'\u0012(in radians) and\nId2\u0012\ndt2+Mg`\u0012 = 0 ; (468)\nd2\u0012\ndt2+Mg`\nI\u0012= 0 ; (469)\nd2\u0012\ndt2+!2\u0012= 0 ; (470)\nwhere\n!=r\nMg`\nI: (471)\nThis is the equation for simple harmonic motion (in \u0012) with a period\nT=2\u0019\n!= 2\u0019s\nI\nMg`: (472)\nIf we express the moment of inertia by\nI=Mk2(473)\nwith kcalled the radius of gyration\u0010\nk=p\nI=M\u0011\nthen\nT= 2\u0019s\nMk2\nMg`= 2\u0019s\nk2\ng`: (474)\nAsimple pendulum is a point mass Mon the end of a massless inextensible string (!). The moment\nof inertia of a point mass Mat a distance `from a pivot is I=M`2, sok=`. The period becomes\nT= 2\u0019s\n`2\ng`= 2\u0019s\n`\ng: (475)\n23.6 Determination of moment of inertia\nThe basic de\u0085nition is\nI=nX\ni=1mir2\ni\u0000!Z\nvolr2\n?\u001adv: (476)\n1. Point mass Mat distance `from axis of rotation, I=M`2.\n2. Ring of mass Mand of radius Rabout an axis through O, the centre of the ring as in \u0085g 82, and\nperpendicular to the plane of the ring. As all the mass is the same distance from O, then eq(476)\nFigure 82: Moment of inertia of a ring\nimmediately gives I=MR2. It is important to note that for all other axes the moment of inertia\nis di¤erent.\n66\n\nFigure 83: Moment of inertia of a uniform rod\n3. Uniform thin rod, mass M, length Labout an axis through one end of the rod and perpendicular\nto the rod, as in \u0085g 83. Mass per unit length is \u001a=M\nLso mass of length dxisdm=\u001adx. Thus\nfrom eq(476)\nIA=Z\nx2dm=ZL\n0x2\u001adx=1\n3\u001aL3=1\n3M\nLL3=1\n3ML2: (477)\nIf the axis were through the centre of the rod, point O, and perpendicular to it then\nIO=ZL=2\n\u0000L=2x2\u001adx=1\n3\u001ax3jL=2\n\u0000L=2=1\n24\u001aL3+1\n24\u001aL3=1\n12\u001aL3=1\n12M\nLL3=1\n12ML2: (478)\nThis clearly illustrates that the moment of inertia is not a \u0085xed quantity for a rigid body but\ndepends on the choice of axis about which rotation is to occur. Two important theorems help us\ndetermine moments of inertia. These theorems are called (a) the theorem of perpendicular axes\nand (b) the theorem of parallel axes.\n23.7 Theorem of perpendicular axes\nIt is important to note that this theorem only applies to plane lamina . Consider a lamina (sheet)\nlying in the x\u0000yplane, with mass per unit area \u001a(not necessarily constant) as shown in \u0085g 84. Mass\nof an element of area dxdyisdm=\u001adxdy. Thus moment of inertia of lamina about the z-axis is\nIz=ZZ\narear2dm=ZZ\u0002\n\u001a\u0000\nx2+y2\u0001\u0003\ndxdy; (479)\n=ZZ\u0002\n\u001a\u0000\nx2+y2\u0001\u0003\ndxdy= (480)\n=ZZ\n\u001ax2dxdy+ZZ\n\u001ay2dxdy (481)\n=Z\nxx2\u0012Z\ny\u001adxdy\u0013\n+Z\nyy2\u0012Z\nx\u001adxdy\u0013\n: (482)\nSince \u0012Z\ny\u001adxdy\u0013\n= dM (483)\nis the mass of a strip of width dxparallel to the y-axis, the \u0085rst integral on the right-hand side\nZ\nxx2dM=Iy; (484)\nis the moment of inertia of the lamina about the y-axis as shown in \u0085g 85. Similarly the second integral\n67\n\nFigure 84: Diagram for perpendicular axes theorem of moments of inertia\nFigure 85: Diagram for identi\u0085cation of integrals\ngives Ixthe moment of inertia of the lamina about the x-axis. Therefore\nIz=Ix+Iy: (485)\nNote the xandyaxes can be chosen anywhere in the lamina, but the z-axismust be taken through the\npoint of intersection of the xandyaxes.\n23.8 Theorem of parallel axes\nThis theorem applies to any solid body. Consider any axis through the centre of mass. Let I0be the\nmoment of inertia of the body about this axis. Now consider a parallel axis at a distance afrom the\naxis through the centre of mass (see \u0085g 86). The moment of inertia about a given axis depends only\non the perpendicular distance from the axis of each mass element. Therefore we may squash the three-\ndimensional body down onto a plane perpendicular to the axis. Suppose this is the x\u0000yplane. Then\nthe distance of an element from the axis through Oisrand\nr2=x2+y2; (486)\nand\na2=a2\nx+a2\ny: (487)\n68\n\nFigure 86: Diagram for parallel axes theorem of moments of inertia\nDistance from Ato mass element is Rsuch that\nR2= (x+ax)2+ (y+ay)2: (488)\nMoment of inertia of body about axis through Operpendicular to the x\u0000yplane is\nI0=Z\nvolr2dm=Z\nvol\u0000\nx2+y2\u0001\ndm (489)\nand the total mass\nM=Z\ndm: (490)\nMoment of inertia about parallel axis through Ais\nIA=Z\nvolR2dm (491)\n=Z\nvolh\n(x+ax)2+ (y+ay)2i\ndm (492)\n=Z\nvol\u0002\u0000\nx2+y2\u0001\n+\u0000\na2\nx+a2\ny\u0001\n+ 2xax+ 2yay\u0003\ndm (493)\nIA=Z\nvol\u0000\nx2+y2\u0001\ndm+a2Z\ndm+ 2axZ\nxdm+ 2ayZ\nydm: (494)\nBut by de\u0085nition of the centre of mass\nZ\nxdm=Z\nydm= 0 (495)\nand so\nIA=I0+Ma2: (496)\nThis theorem is true for any body.\nExample 20 Consider previous example of a uniform rod of length L. We showed explicitly that I0=\n1\n12ML2. Thus by the parallel axes theorem the moment of inertia about a parallel axis through one end\nof the rod is IA=I0+M\u0000L\n2\u00012=1\n3ML2as explicitly shown previously.\n69\n\n23.9 Kinetic energy of rigid body with rotation and translation\nWe shall \u0085nd an expression for the kinetic energy of a body which is rotating through its centre of mass\nand also is in rectilinear motion. Body has mass Mand moment of inertia about axis through centre of\nFigure 87: Rotational and translational motion\nmass of I0. The kinetic energy of rotation about axis through centre of mass is1\n2I0!2. Kinetic energy of\nrectilinear motion is1\n2Mv2. Thus the total kinetic energy is simply\nKE=1\n2I0!2+1\n2Mv2: (497)\nConsider a wheel rolling on a surface without skidding . As the point in contact with the surface is\nnot slipping, it must be momentarily stationary. Thus the speed of the centre of mass v=!R. The total\nFigure 88: Rolling wheel\nkinetic energy is\nKE=1\n2I0!2+1\n2Mv2(498)\n=1\n2I0!2+1\n2M!2R2(499)\n=1\n2\u0000\nI0+MR2\u0001\n!2(500)\n=1\n2IA!2; (501)\nwhere\nIA=I0+MR2(502)\nis the moment of inertia of the wheel about an axis through A(the point of contact with the surface)\nperpendicular to the plane of the wheel. Therefore the wheel can be considered as momentarily rotating\nabout point A(the point of contact with the surface) with angular velocity !. The moment of inertia\n70\n\nabout axis through centre of mass of the wheel (ring) perpendicular to the wheel is I0=MR2. In this\ncase\nKE=1\n2\u0000\nI0+MR2\u0001\n!2=1\n2\u0000\nMR2+MR2\u0001\n!2=M!2r2=Mv2: (503)\n23.10 E¤ect of external force\nWe wish to see what is the e¤ect of an external force applied to a free rigid body if the force does not\nact through the centre of mass of the body, see \u0085g 89. If we now add forces Fand\u0000Facting through the\nFigure 89: Left: External force not through C.o.M; Right: equivalent force system\ncentre of mass we now have a system with a force Fthrough the centre of mass and a couple made up\nfrom the force \u0000Fthrough the centre of mass and the original force F. Force acting through the centre\nof mass accelerates the mass according to\nF=Md2R\ndt2: (504)\nThe couple, with a torque \u001c=Fh, produces an angular acceleration\n\u001c=dL\ndt=I0d!\ndt(505)\nabout an axis through the centre of mass and perpendicular to the plane de\u0085ned by the direction of the\nforce and the centre of mass.\nSuppose force Fis applied for a very short time dtto a system initially at rest. Then\nFdt=MV (506)\nwhere Vis velocity of centre of mass, and\n\u001cdt=I0!; (507)\nwhere !is the angular velocity about axis through the centre of mass. Immediately after the impulse is\napplied the speeds of the points AandB(see \u0085g 90) are\nvA=V+`A! (508)\nvB=V\u0000`B!: (509)\nIt may be that vB= 0. The point at which the impulse is applied for which vB= 0is called the centre\nof percussion . If a body, e.g. a door is hinged at Band is struck at the centre of percussion there is no\nimpulsive reaction at the hinge. Similarly if a cricket bat or tennis racket is held at one end (i.e. B) and\nthe ball strikes the centre of percussion there is no painful jarring sensation at the player\u0092 s hand.\n71\n\nFigure 90: Impulse given to body free to rotate\nDetermination of position of centre of percussion IfvB= 0then V=`B!. But\nMV =Fdt (510)\nand\nI0!=\u001cdt=Fhdt=MV h (511)\nso\nI0!=M`B!h (512)\nh=I0\nM`B: (513)\nFor a uniform rod of length Land mass M, we have I0=1\n12ML2and`B=1\n2L, soh=1\n6L, i.e. 2/3 of\nthe length of the rod from B.\n23.11 Simple theory of the gyroscope\nConsider spinning a disc with moment of inertia I0about an axis perpendicular to the disc, as in \u0085g91.The\ntorque of the weight about Ois\u001c=Mgx . The direction of the torque vector \u001cis into the paper. Since\n\u001c=dL\ndt(514)\nthen in time dtthe angular momentum of the spinning disc changes by an amount\ndL=\u001cdt (515)\nin the direction of \u001c. Thus viewed from above we have the vector diagram with L(t)the angular\nmomentum at time t. As can be seen from the diagram, the angular momentum vector Lis rotated\nthrough an angle d\u000bin time dtbut it is still horizontal and of the same magnitude. Hence\nd\u000b=dL\nL=\u001cdt\nL=Mgx dt\nI0!: (516)\n72\n\nFigure 91: Spinning disc\nFigure 92: Vector diagram\nThe rate of rotation of L, orrate of precession , is\nd\u000b\ndt=\u001c\nL=Mgx\nI0!: (517)\nThis simple theory is valid ifd\u000b\ndt\u001c!.\nThere are many applications of gyroscopes in maintaining stability of rotating bodies and in various\ncontrol systems.\n24 Fluid Mechanics\nA \u0087 uid is a substance that can readily be deformed, that \u0087 ows when an external force is applied. Obvious\nexamples are gases and liquids.\nHydrostatics - is study of \u0087 uids at rest and in equilibrium.\nHydrodynamics - study of \u0087 uids in motion.\n24.1 Hydrostatics\nConsider equilibrium of a small cube of liquid in a tank under gravity as in \u0085g 93. Density of the liquid\nis\u001a. There is no horizontal net force so forces on each pair of opposite parallel vertical faces must cancel.\nHence if P1is average pressure on face 1, and P2is average pressure on face 2, then force on face 1 is\ndF1=P1dydz (518)\n73\n\nFigure 93: Small element of volume of a \u0087 uid\nand force of face 2 is\ndF2=P2dydz (519)\nbutdF1= dF2and hence P1=P2. Therefore pressure is same at all points of same depth .\nConsider forces on upper and lower horizontal faces. Downward force on top force is\ndF5=Pdxdz: (520)\nUpward force on bottom face is\ndF6= (P+ dP) dxdz: (521)\nTherefore for equilibrium of mass of liquid \u001a(dxdydz),\ndF6\u0000dF5=\u001a(dxdydz)g; (522)\ndPdxdz=\u001a(dxdydz)g (523)\ndP=\u001agdy : (524)\nOn integrating\nP=\u001agy+P0; (525)\nwhere P0is pressure at y= 0. Hence pressure in a static liquid under gravity varies only with the vertical\nheight.\nPressure is measured in Pascals (Pa), 1 Pa = 1 Nm\u00002.\n24.1.1 Hydraulic press\nApply force F2to piston 2 of area A2as in \u0085g 94 The pressure in the liquid P2=F2=A2. Same pressure\nunder piston 1 of area A1so upward force on piston 1 is\nF1=P1A1=A1\nA2F2: (526)\nIfA1> A 2then F1> F 2.\nPiston 2 moves a distance x2, piston 1 moves distance x2then if liquid is incompressible,\nA1x1=A2x2 (527)\nand\nx1=A2\nA1x2: (528)\n74\n\nFigure 94: Hydraulic press\nWork done by force F1is\nF1x1=A1\nA2F2A2\nA1=F2x2 (529)\nif there are no dissipative forces such as friction at the pistons or viscosity of the liquid.\n24.1.2 Buoyancy\nConsider a cylinder of mass mwith end-face area A\u0087 oating partially submerged in a liquid of density \u001a\nas in \u0085g 95. Force on top face FT=P0A. Force on bottom face is FB=P1A= (P0+\u001agy)A. Thus for\nFigure 95: Floating cylinder\nequilibrium\nmg=FB\u0000FT=\u001agyA = [(yA)\u001a]g; (530)\ni.e. upthrust = FB\u0000FTis equal to the weight of liquid displaced.\nConsider a fully immersed body. Let Nbe reaction of cylinder on legs as in \u0085g 96. Force on top face\nis\nFT=P1A: (531)\n75\n\nFigure 96: Submerged cylinder\nForce on bottom face is\nFB=P2A+\u001ag(lA): (532)\nThus upthrust FB\u0000FT=\u001a(lA)g. Again upthrust equals weight of liquid displaced. For equilibrium\nmg= upthrust + N: (533)\nWhether body is partially or fully immersed there is an upthrust equal to weight of \u0087 uid displaced. This\nisArchimedes\u0092Principle . The result applies to any shape of body.\n24.2 Hydrodynamics - \u0087 uids in motion\nConsider an ideal liquid which is\n1. incompressible,\n2. non-viscous,\n3. constant temperature throughout,\n4. \u0087 owing steadily, i.e. no time variation in \u0087 ow pattern,\n5. non-turbulent.\nAt each point with coordinates (x; y; z )the liquid has a velocity vector vand pressure p(scalar).\nConsider following a small element of liquid as it travels along, as in \u0085g 97. The velocity may change in\nmagnitude and direction along the path. This path of a \u0087 uid element is called a streamline . Consider\nanother \u0087 uid element. This will follow another streamline. Two streamlines can never cross because\nit would mean that the velocity vector would have two di¤erent directions at the same point which is\nimpossible (see \u0085g 98).\nFlow along stream lines, with the velocity vector changing smoothly is called streamline \u0087 ow .\nConsider a thin bundle of adjacent streamlines as in \u0085g 99 forming a stream tube . Because streamlines\ncannot cross any \u0087 uid that enters a stream tube at end A must exit through end B. There is no loss of\n\u0087 uid through the side of the stream tube.\n76\n\nFigure 97: A streamline\nFigure 98: Two streamlines\nFigure 99: A streamtube\n77\n\nIf density of \u0087 uid at A is \u001a1and density at B is \u001a2, mass of \u0087 uid entering tube at A in time tis\nm1=\u001a1v1tdA1and the mass of \u0087 uid leaving through end B is m2=\u001a2v2tdA2. Since mass is conserved,\nm1=m2and\n\u001a1v1tdA1=\u001a2v2tdA2; (534)\n\u001a1v1dA1=\u001a2v2dA2: (535)\nThis is the equation of continuity . This is true for liquids and gases. For an ideal liquid which is\nincompressible, so \u001a1=\u001a2, then\nv1dA1=v2dA2: (536)\nExample 21 Hose-pipe nozzle of area A2; volume rate of \u0087 ow of water along the pipe of cross sectional\nareaA1isv1A1=v2A2, sov2=v1A1=A2at the nozzle, and hence v2> v1since A2< A 1.\n24.2.1 Bernoulli\u0092 s equation\nThis is a most important equation relating to \u0087 uid \u0087 ow. Consider an ideal liquid \u0087 owing along under\ngravity as in \u0085g 100. Assume there is no viscosity (i.e. no dissipative forces) so that the total energy of\na small volume of liquid as it \u0087 ows along a stream tube must be conserved.\nFigure 100: Diagram for Bernoulli\u0092 s eqaution\nConsider the work done by the pressure in time dt. Work done bypressure at end A1is\ndW1= (p1dA1)v1dt; (537)\nand work done against pressure at end A2is\ndW2= (p2dA2)v2dt: (538)\nBy the continuity equation, mass of liquid element dmis (note \u001a1=\u001a2=\u001aas liquid is incompressible)\ndm=\u001adA1v1dt=\u001adA2v2dt: (539)\nChange of kinetic energy of this mass from end A1to end A2is\ndW3=1\n2dm\u0000\nv2\n2\u0000v2\n1\u0001\n(540)\n=1\n2\u001adA1v1dt\u0000\nv2\n2\u0000v2\n1\u0001\n: (541)\n78\n\nWork done against gravity in raising this mass of liquid from h1toh2is\ndW4= d m g(h2\u0000h1) (542)\n=\u001adA1v1dt g(h2\u0000h1): (543)\nTherefore from conservation of energy\ndW1\u0000dW2= d W3+ dW4 (544)\n(p1dA1)v1dt\u0000(p2dA2)v2dt=1\n2\u001adA1v1dt\u0000\nv2\n2\u0000v2\n1\u0001\n+\u001adA1v1dt g(h2\u0000h1): (545)\nThe continuity equation gives dA1v1= dA2v2, so\np1\u0000p2=1\n2\u001a\u0000\nv2\n2\u0000v2\n1\u0001\n+\u001ag(h2\u0000h1) (546)\np1+1\n2\u001av2\n1+\u001agh1=p2+1\n2\u001av2\n2+\u001agh2: (547)\nThus in general along a stream tube\np+1\n2\u001av2+\u001agh=cons tant: (548)\nThis is Bernoulli\u0092 s equation. This has been derived for an ideal liquid, but is approximately true for\ngases if there is no great change in density, otherwise the equation becomes\nZdp\n\u001a+1\n2v2+gh=cons tant: (549)\nIf \u0087 uid is not moving, v= 0, then Bernoulli\u0092 s equation becomes\np+\u001agh= cons tan t (550)\ni.e. pressure increases with depth as derived earlier. as his measured in upwards sense.\nExample 22 Flow of water through a small hole in a tank, as in \u0085g 101. At the surfaces p0=p1is the\natmospheric pressure and v'0as the water level falls slowly(!) So\np0+1\n2\u001av2\n1+\u001agh1=p0+ 0 + \u001agh2 (551)\nv2\n1= 2g(h2\u0000h1): (552)\nThis is the same speed as free fall under gravity through a height h=h2\u0000h1.\nRate of \u0087 ow (volume per second) through area AisAv.\nFigure 101: Flow from ori\u0085ce in tank\n79\n\n24.2.2 Venturi meter\nIf the \u0087 ow is horizontal so with no change in height then\np+1\n2\u001av2=cons tant (553)\nand pressure is greater where speed of \u0087 ow is less. This is the basis of the Venturi meter as illustrated in\n\u0085g 102.\nFigure 102: Venturi meter\nFrom the diagram\np1+1\n2\u001av2\n1=p2+1\n2\u001av2\n2 (554)\nand\np1\u0000p2=\u001a0gh (555)\nso\n\u001a0gh=1\n2\u001av2\n2\u00001\n2\u001av2\n1: (556)\nBut the continuity equation is v1A1=v2A2sov2=v1A1=A2so substituting for v2\n\u001a0gh =1\n2\u001av2\n1\u0012A2\n1\nA2\n2\u00001\u0013\n(557)\nv1=s\n2\u001a0ghA2\n2\n\u001a(A2\n1\u0000A2\n2)(558)\nand volume rate of \u0087 ow along pipe is\nA1v1=s\n2\u001a0ghA2\n1A2\n2\n\u001a(A2\n1\u0000A2\n2): (559)\nExample 23 Flow of air over an aircraft wing as in \u0085g 103.Air \u0087 ow over the top of the wing, v1is faster\nthan under the bottom, v2so pressure above wing, p1is less than than under the wing p2which gives rise\nto the upward force (lift) on the wing.\n80\n\nFigure 103: Flow over an aerofoil\nFigure 104: Ball suspended in upward air jet\nExample 24 Stability of table-tennis ball suspended on air jet. The air speed v1> v 2sop1< p 2\nproducing a resultant force pushing the ball towards the centre of the air jet (see \u0085g 104).\nExample 25 De\u0087 ection of a spinning rough ball. Ball moving at speed vthrough the air and spinning\nabout a vertical axis as in \u0085g 105.\nAs ball is rough it slows down air at A and tend to increase speed of air at B, such that v1< v2,\nso that p1> p2producing a resultant force in direction from A to B. The ball is de\u0087 ected horizontally.\nNote the ball is rough, a smooth ball does not drag the air round with it and the e¤ect is not observed.\n81\n\nFigure 105: De\u0087 ection of spinning ball\n82\n\n",
  "chunks": [
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_b2714172",
      "content": "Classical Mechanics\n1 Introduction\nClassical mechanics is important as it gives the foundation for most of physics. The theory, based\nonNewton\u0092 s laws of motion , provides essentially an exact description of almost all macroscopic\nphenomena. The theory requires modi\u0085cation for\n1.microscopic systems , e.g. atoms, molecules, nuclei - use quantum mechanics\n2.particles travelling at speeds close to the speed of light - userelativistic mechanics\nThese other theories must reduce to classical mechanics in the limit of large bodies travelling at speed\nmuch less than the speed of light.\nThe subject is usually divided into\n1.statics - systems at rest and in equilibrium ,\n2.kinematics - systems in motion, often accelerating. Concerned here with general relationships,\ne.g.F=dp\ndt, (Newton\u0092 s second law, without specifying the details of the force.)\n3.dynamics - details of the force law are speci\u0085ed, e.g. gravitational force, force due to a stretched\nspring.\n2 Newton\u0092 s laws of motion\nThese were formulated in his book Principia Mathematica in 1687. They are the basis of all classical\nmechanics.\n1. A body remains at rest or in a state of uniform motion (non-accelerating) unless acted on by an\nexternal force.\n2. Force = time rate of change of momentum, i.e.\nF=dp\ndt; (1)\nwhere p=mv= momentum of body of mass mmoving with velocity v. Ifmis constant then\nF=mdv\ndt=ma; (2)\nwith acceleration, a=dv\ndt.\n3. To every force (action ) there is an equal but opposite reaction .\nThese laws are only true in an inertial (non-accelerating) frame of reference . We shall discuss\nlater how we can treat motion relative to an accelerating frame of reference.\nFrom the second law, if F= 0, then the acceleration a=dv\ndt= 0, so the velocity, v, is constant. Thus\n\u0085rst law is special case of the second law.\nWe can also derive the third law from the second law as follows. Apply a force Fto body 1. Body 1\npushes on body 2 with force F2and body 2 pushes back on body 1 with force F1as shown in \u0085g 1.\nApplying Newton\u0092 s second law, for the combined system,\nF= (m1+m2)a: (3)\nFor body 1,\nF+F1=m1a; (4)\n1",
      "key_point": "Classical Mechanics\n1 Introduction\nClassical mechanics is important as it gives the foundation fo...",
      "context_label": "Paragraph 1",
      "importance_rank": 83
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_8499d8a9",
      "content": "Figure 1: Demonstration of Newton\u0092 s Third Law\nfor body 2,\nF2=m2a: (5)\nAdding\nF+F1+F2= (m1+m2)a=F (6)\nF1+F2= 0 (7)\nand hence\nF1=\u0000F2: (8)\nSo that forces F1andF2are equal in magnitude but opposite in direction.\n3 Scalars and Vectors\nThere are two main types of variables in mechanics.\nScalar \u0096has only magnitude, e.g. mass, energy, speed.\nVector \u0096has magnitude and direction, e.g. position, velocity, acceleration, force.\nA vector may be represented graphically by a directed line segment. The length of the line represents\nthe magnitude of the vector, the direction of the line shows the direction of the vector. In printed text\nvectors are often written in bold type, and will be underlined in hand written text. A certain knowledge\nof vectors is assumed, in particular their Cartesian form.\nConsider Newton\u0092 s second law,\nF=ma: (9)\nThis is a vector equation which means that not only is the magnitudes on both sides of the equation\nequal, but the direction of the acceleration ais the same as the force, F. If we express Fandain\nCartesian form,\nF=Fx+Fy+Fz (10)\na=ax+ay+az; (11)\nthen\nFx=max=mdvx\ndt=md2x\ndt2; (12)\nFy=may=mdvy\ndt=md2y\ndt2; (13)\nFz=maz=mdvz\ndt=md2z\ndt2: (14)\n2",
      "key_point": "Figure 1: Demonstration of Newton\u0092 s Third Law\nfor body 2,\nF2=m2a: (5)\nAdding\nF+F1+F2= (m1+m2)a=F...",
      "context_label": "Paragraph 2",
      "importance_rank": 82
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_97229459",
      "content": "4 Units and Dimensions\nIn order to discuss concepts such as velocity, force energy, etc. we must introduce a standard set of units\nof the fundamental variables or dimensions. The fundamental variables are mass [M], length [L]and\ntime [T]. The most widely used set of units for these variables is the Système International (S.I.).\nThe base units of the S.I. system are\nvariable unit name abbreviation\nmass [M]kilogram kg\nlength [L]metre m\ntime [T] second s\nFrom these base units we can obtain derived units for other variables, e.g. speed = distance/time, with\ndimensions of speed [v] = [L]=[T]and the S.I. unit is m/s, or ms\u00001. For force = mass \u0002acceleration\nthe dimensions are [F] = [m] [L] [T]\u00002and the unit is kg m s\u00002= Newton ( N). Units have dimensions\nandallequations in physics must be dimensionally homogeneous ; i.e. both sides and each term of\nthe equation must have the same dimensions. As an example,\n1. distance travelled in time tat constant speed viss=vt. The dimension are\n[L] = [L] [T]\u00001[T] = [L]: (15)\n2. distance travelled in time tunder a constant acceleration afrom an initial speed uis\ns=ut+1\n2at2: (16)\nThe dimensions are\n[L] = [ L] [T]\u00001[T] + [L] [T]\u00002[T]2(17)\n[L] = [ L] + [L]: (18)\nDimensional analysis of equations provides a very useful check on the correctness of algebraic expres-\nsions. However it does not give information about dimensionless constants, such as the1\n2in equation\n(16) above.\n5 Time rate of change of vectors\nNewton\u0092 s second law, F=mdv\ndt, involves the time rate of change of the velocity vector, v. Consider\nv=dr\ndt: (19)\nChange of position of particle in time interval \u0001tis\u0001r, so velocity (see \u0085g 2\nv= lim\n\u0001t!0\u0001r\n\u0001t=dr\ndt: (20)\nIn Cartesian coordinates\nr=xbi+ybj+zbk; (21)\nv=dr\ndt=dx\ndtbi+dy\ndtbj+dz\ndtbk; (22)\n=vxbi+vybj+vzbk: (23)\nThe speed of the particle is\nv=jvj=pv\u0001v=q\nv2x+v2y+v2z: (24)\n3",
      "key_point": "4 Units and Dimensions\nIn order to discuss concepts such as velocity, force energy, etc.",
      "context_label": "Paragraph 3",
      "importance_rank": 81
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_121e6312",
      "content": "Figure 2: Time-dependent vectors\nFor acceleration, replace rbyvin the above expressions,\na= lim\n\u0001t!0\u0001v\n\u0001t=dv\ndt: (25)\nIn Cartesian coordinates\na=vxbi+vybj+vzbk; (26)\na=dv\ndt=dvx\ndtbi+dvy\ndtbj+dvz\ndtbk; (27)\n=d2x\ndt2bi+d2y\ndt2bj+d2z\ndt2bk: (28)\n6 Motion in one dimension\nConsider a particle of mass, m, moving along the positive x-axis as in \u0085g 3.\nFigure 3: Motion along x-axis\nThe velocity is positive for motion in sense of xincreasing and negative for xdecreasing.\nIn time dtdistance travelled by particle is dx=vdt. In the \u0085nite time interval between t1, when\nposition of particle is x1, and time t2when position is x2, distance travelled is\ns= (x2\u0000x1) =Zt2\nt1vdt: (29)\nThis is represented by the shaded area in \u0085g 4(a). We need to know how vvaries with tin order to\ncalculate s.\n4",
      "key_point": "Figure 2: Time-dependent vectors\nFor acceleration, replace rbyvin the above expressions,\na= lim\n\u0001...",
      "context_label": "Paragraph 4",
      "importance_rank": 80
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_3a7576c7",
      "content": "Figure 4: (a) Left: Velocity - time graph; (b) Right: Acceleration - time graph\nSimilarly for acceleration, a, the change in velocity in time interval between time t1andt2is\n(v2\u0000v1) =Zt2\nt1adt; (30)\nand is represented by the shaded area in \u0085g 4(b). As before we need to know how avaries as a function\nof time.\n7 Motion under a constant force\nIf the force is constant, then by Newton\u0092 s second law, F=ma, then so is the acceleration. Hence from\n\u0085g 3\nv2=v1+a(t2\u0000t1); (31)\nv=at+K (32)\nwhere Kis an arbitrary constant of integration. Suppose v=uatt= 0, this is a boundary orinitial\ncondition , so\nv=u+at (33)\ndx\ndt=u+at (34)\nand integrating gives\nx=ut+1\n2at2+K2; (35)\nwhere K 2is another constant of integration determined by another boundary (initial) condition. Suppose\nx=x0att= 0, then\nx=x0+ut+1\n2at2(36)\nand distance travelled in time t, is\ns= (x\u0000x0) =ut+1\n2at2: (37)\nSince t= (v\u0000u)=a, then\ns=u(v\u0000u)\na+1\n2a\u0014(v\u0000u)\na\u00152\n(38)\n5",
      "key_point": "Figure 4: (a) Left: Velocity - time graph; (b) Right: Acceleration - time graph\nSimilarly for acc...",
      "context_label": "Paragraph 5",
      "importance_rank": 79
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_a82ca0bc",
      "content": "and re-arranging,\nv2=u2+ 2as (39)\nCollecting together the equations of motion we have for linear motion under a constant acceleration (or\nforce)\nv=u+at; (40)\ns=ut+1\n2at2; (41)\nv2=u2+ 2as; (42)\ns=1\n2(u+v)t: (43)\n7.1 Free fall under gravity\nIn this case the constant acceleration is downwards, with a=\u0000g, asx,v, and aare positive when\nmeasured upwards. Consider a body thrown upwards with an initial speed u. Forces are as shown in\nFigure 5: Mass falling freely under in\u0087 uence of gravity\n\u0085g 5. The initial conditions are, x= 0,v=uatt= 0. To \u0085nd the maximum height reached, we \u0085nd s\nwhere v= 0. Thus from eq(42), 0 =u2\u00002gsgiving s=u2=(2g). The time to the maximum height is\nfound using eq(40) giving t=u=g. To \u0085nd the time to reach some speci\u0085ed height, x1, then use eq(41),\nx1=ut\u00001\n2gt2(44)\ngt2\u00002ut+ 2x1= 0: (45)\nThis is a quadratic equation in t, with two roots,\nt=u\u0006p\nu2\u00002gx1\ng: (46)\nIfu2>2gx1, the body can reach a height greater than x1and the two roots are real, with\nt1=u\u0000p\nu2\u00002gx1\ng(47)\ngiving the time to reach x1on the way up and\nt2=u+p\nu2\u00002gx1\ng(48)\ngiving the time to reach height x1going down after reaching the maximum height. Note that t1andt2\nare symmetric about the time to maximum height t=u=g. Ifx1> u2=gno particle can reach this height\n(the two roots of the quadratic are complex quantities).\n6",
      "key_point": "and re-arranging,\nv2=u2+ 2as (39)\nCollecting together the equations of motion we have for linear ...",
      "context_label": "Paragraph 6",
      "importance_rank": 78
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_a180fd2d",
      "content": "8 Force of friction\nConsider a block of mass msliding on a rough surface. The frictional force, Ff,as it acts on the\nblock , is in a direction opposite to the motion of the block. It acts at the surface of the block in contact\nwith the rough surface. The normal reaction ,N, of the surface on the block is perpendicular to the\nsurface. As there is no resultant vertical force on the block, (see \u0085g 6) then the magnitude\nFigure 6: Block sliding over rough horzontal surface\nN=mg: (49)\nIf the block is sliding the frictional force is proportional to the normal reaction. The constant of pro-\nportionality is called the coe¢ cient of friction, often denoted by \u0016. Hence we write Ff=\u0016Nfor the\nmagnitude.\nSome typical values of \u0016aresurfaces \u0016\nsteel on steel 0.4\nte\u0087 on on te\u0087 on 0.04\nlead on steel 1\nIf applied force Fis not su¢ ciently large to cause the block to slide, there is still a frictional force Ff\nacting in the direction opposite to that in which the body would move if there were no friction, but\nFf< \u0016N .\nIf the body is just about to slide we shall assume that Ff=\u0016N. In practice the coe¢ cient of\nsliding friction is slightly less than the coe¢ cient of static friction .\nConsider the motion of a block sliding on a rough horizontal surface. Resolving the forces vertically,\nmg\u0000N= 0 (50)\nso\nFf=\u0016N=\u0016mg (51)\nand the resultant horizontal force on the body is\n(F\u0000Ff) =ma=mdv\ndt: (52)\nThis is the equation of motion of the body.\nExample 1 Suppose body is initially sliding to the right and the applied force F= 0. The body slides\nto rest under the in\u0087 uence of the frictional force. Equation of motion is\n\u0000Ff=\u0000\u0016mg =ma; (53)\nso the acceleration\na=\u0000\u0016g (54)\n7",
      "key_point": "8 Force of friction\nConsider a block of mass msliding on a rough surface.",
      "context_label": "Paragraph 7",
      "importance_rank": 77
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_3cc5843b",
      "content": "is constant. Hence previous results for motion under a constant acceleration can be used. In particular\nthe time to come to rest if initial velocity is uis given by\n0 = u\u0000\u0016gt; (55)\nt=u=(\u0016g): (56)\n8.1 Motion of body on rough inclined plane\nConsider the body being pulled/pushed upthe plane at a constant speed. The forces are as in the\ndiagram, \u0085g 7. The body is sliding so we take frictional force Ff=\u0016N. There is no resultant force\nFigure 7: Mass pulled up an inclined plane\nperpendicular to the plane (it remains in contact) so\nN=mgcos\u000b: (57)\nResolving forces parallel to plane surface,\nF\u0000Ff\u0000mgsin\u000b=ma=mdv\ndt(58)\nF\u0000\u0016mg cos\u000b\u0000mgsin\u000b=mdv\ndt: (59)\nExample 2 What is largest value for the angle of inclination of the plane for which body remains at rest\non the plane without sliding down . In this case the body wants to slide down, so the frictional force Ff\nacts up the plane, as in \u0085g 8. For equilibrium there is no resultant force on the particle in any direction.\nFigure 8: Body sliding down an inclined plane\nResolving forces perpendicular to the plane\nN=mgcos\u000b (60)\n8",
      "key_point": "is constant.",
      "context_label": "Paragraph 8",
      "importance_rank": 76
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_8064d363",
      "content": "and parallel to the plane\nFf=mgsin\u000b: (61)\nThe maximum value of Ffis\u0016N, so\nFf=\u0016N=\u0016mg cos\u000b (62)\nso the maximum value of \u000bis when\n\u0016mg cos\u000b=mgsin\u000b (63)\ntan\u000b=\u0016: (64)\n8.2 Role of friction in accelerating a car\nForces are as shown for a rear-wheel drive car in \u0085g 9. The frictional force between the rear wheels and\nFigure 9: Rear-wheel driven vehicle\nthe ground is Ff, and this force provides the force needed to accelerate the car, Ff=ma.\n9 Kinematical relations\nBefore considering other one-dimensional problems we need to develop some other general aspects of\nmechanics.\n9.1 Work\nForce Fis applied to a body. If point of application of the force, i.e. body moves a distance dras in \u0085g\n10, the work done by the force is de\u0085ned to be\ndW=F\u0001dr= (Fcos\u000b) dr (65)\nwhere Fcos\u000bis component of force in direction of motion of the body. Hence work is a scalar\nquantity .\nFor \u0085nite displacements of a particle from position r1tor2as in \u0085g 10 the work done bythe force is\nW=Zr2\nr1F\u0001dr (66)\nNote that Fmay vary with position.\n9",
      "key_point": "and parallel to the plane\nFf=mgsin\u000b: (61)\nThe maximum value of Ffis\u0016N, so\nFf=\u0016N=\u0016mg cos\u000b (62)\nso ...",
      "context_label": "Paragraph 9",
      "importance_rank": 75
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_0245388f",
      "content": "Figure 10: Force displaced\nFigure 11: Body moving over curved path\nFor a constant force (in both magnitude anddirection ), work done is\nW=F\u0001(r2\u0000r1): (67)\nWork isenergy and the S.I. unit is the newton metre ( N m) .\nIf force acts in the x-direction and the particle can only move in the x-direction, then we can drop\nthe scalar product in eq(66) and write\nW=Zx2\nx1Fdx (68)\nas the work done by force Fin moving particle from position x1tox2.\nExample 3 Work that must be done to stretch a spring, as illustrated in \u0085g 12: Tension in the spring\nFigure 12: Stretched spring\nwhen extended is proportional to the (small) extension, (Hooke\u0092 s law), so T=\u0000kxwhere kis the sti¤ness\nconstant. To stretch the spring we must apply a force F= +kx. The work done by force F(i.e. by us)\nto stretch spring to an extension x1is\nW=Zx1\n0Fdx=Zx1\n0kxdx=1\n2kx2\n1: (69)\n10",
      "key_point": "Figure 10: Force displaced\nFigure 11: Body moving over curved path\nFor a constant force (in both ...",
      "context_label": "Paragraph 10",
      "importance_rank": 74
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_4d1aece4",
      "content": "We assume there are no dissipative forces (e.g. friction) so this energy is stored in the stretched spring\naspotential energy . Potential energy will be discussed in more detail later.\nExample 4 Work done bygravity when particle falls from position x1tox2where (x1\u0000x2) =h. The\nFigure 13: Body falling through distance hunder gravity\nforce F=\u0000mgand the work\nW=Zx2\nx1Fdx=Zx2\nx1(\u0000mg) dx= (\u0000mgx )jx2\nx1=\u0000mg(x2\u0000x1) =mgh: (70)\nThe work done manifests itself as kinetic energy of the particle.\nExample 5 Suppose particle is constrained to fall under gravity inside a smooth tube, as in the \u0085g\n14. Force of tube onthe particle is Nand is normal to the tube. (The tube being smooth produces no\nFigure 14: Contrained motion of particle under gravity\nfrictional force - an idealized situation!) So resultant force on particle is N+F. Work done by these\nforces as particle moves a distance dralong the tube is\ndW= (N+F)\u0001dr=N\u0001dr+F\u0001dr: (71)\n11",
      "key_point": "We assume there are no dissipative forces (e.g.",
      "context_label": "Paragraph 11",
      "importance_rank": 73
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_954529e6",
      "content": "ButNis orthogonal (perpendicular) to drat every point along tube, so N\u0001dr= 0. Hence\ndW=F\u0001dr (72)\nand constraining forces which are not dissipative (i.e. no friction) do no work. For this problem,\nF=\u0000mgbianddr= dxbi+ dybj, so\ndW=F\u0001dr=\u0000mgbi\u0001\u0010\ndxbi+ dybj\u0011\n=\u0000mgdx (73)\nand hence the work done by gravity when particle falls from height x1tox2is\nW=Zx2\nx1(\u0000mg) dx=mgh (74)\nas before.\n9.2 Power\nPower, P, is de\u0085ned as the rate of doing work,\nP=dW\ndt: (75)\nThe S.I. unit is the joule/second\u0000\nJ s\u00001\u0001\nor watt ( W). Since dW=F\u0001drthen\nP=dW\ndt=F\u0001dr\ndt=F\u0001v=Fxvx+Fyvy+Fzvz: (76)\nAverage power over extended time interval tisP=W=t, where Wis work done in time t.\n9.3 Impulse\nConsider a force Fwhich acts on a body of mass mduring a time interval from t1tot2. The impulse (a\nvector quantity) of Fduring this time interval is de\u0085ned as\nI=Zt2\nt1Fdt (77)\nBut from Newton\u0092 s second law\nF=dp\ndt(78)\nso\nI=Zt2\nt1dp\ndtdt=Zp2\np1dp= (p2\u0000p1) (79)\nwhere p1=mv1, the momentum of particle at time t, and similarly p2=mv2at time t2. Hence\nNewton\u0092 s second law can also be stated as Impulse = change in momentum,\nI= \u0001p= (p2\u0000p1): (80)\nIf force, F, is constant (in direction and magnitude) throughout the time interval \u0001t= (t2\u0000t1), then\nI=F(t2\u0000t1) =F\u0001t: (81)\nAn important special case is when force, F, is very large and \u0001tis very small, so that I= \u0001pis \u0085nite.\nNote as I=Rt2\nt1Fdtthen\nF=dp\ndt=dI\ndt(82)\nExample 6 Particle of mass mbouncing o¤ a wall elastically (no loss of kinetic energy) as in \u0085g 15.\nChange in momentum of particle is \u0001p= (\u0000mv)\u0000mv=\u00002mvis the impulse on the particle. Therefore\nby Newton\u0092 s third law the impulse on the wall is +2mv.\n12",
      "key_point": "ButNis orthogonal (perpendicular) to drat every point along tube, so N\u0001dr= 0.",
      "context_label": "Paragraph 12",
      "importance_rank": 72
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_fb055157",
      "content": "Figure 15: Particle bouncing elastically from a wall (very large mass)\n9.4 Kinetic energy and potential energy\nConsider a one-dimensional problem with the force Fin the x-direction acting on a particle of mass m.\nThe equation of motion is\nF=ma=mdv\ndt=mdv\ndxdx\ndt=mvdv\ndx: (83)\nThe work done by the force in moving the particle from position x1to position x2in \u0085g 16 is\nFigure 16: Work done between two points\nW=Zx2\nx1Fdx=Zx2\nx1mvdv\ndxdx=Zv2\nv1mvdv=1\n2mv2jv2\nv1=1\n2mv2\n2\u00001\n2mv2\n1; (84)\nwhere v1is velocity of particle at position x1and similarly at position 2. We de\u0085ne kinetic energy\n(K.E.) as KE=1\n2mv2. Hence the work done by the force is equal to the change (increase) in kinetic\nenergy.\nWe can also consider the work done by the force as the di¤erence inpotential energy (P.E.)\nbetween positions x1andx2, thus we de\u0085ne (mechanical) potential V(x)by\nW=Zx2\nx1Fdx=V(x1)\u0000V(x2) =\u0000[V(x2)\u0000V(x1)] =1\n2mv2\n2\u00001\n2mv2\n1 (85)\nand\nV(x1) +1\n2mv2\n1=V(x2) +1\n2mv2\n2: (86)\nThe above relationship only de\u0085nes the di¤erence in potential energy. To de\u0085ne an absolute\npotential energy of a particle at x1we need an arbitrary but conveniently chosen position, x0, at which\nthe potential V= 0by de\u0085nition. Then\nV(x1) =Zx0\nx1Fdx (87)\nand\nV(x1)\u0000V(x2) =Zx0\nx1Fdx\u0000Zx0\nx2Fdx=Zx0\nx1Fdx+Zx2\nx0Fdx=Zx2\nx1Fdx=W: (88)\n13",
      "key_point": "Figure 15: Particle bouncing elastically from a wall (very large mass)\n9.4 Kinetic energy and pot...",
      "context_label": "Paragraph 13",
      "importance_rank": 71
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_89e4e952",
      "content": "Since\nV(x1) +1\n2mv2\n1=V(x2) +1\n2mv2\n2 (89)\nthen potential energy + kinetic energy is constant, i.e. total energy is constant. Hence total energy ,\nE=V+KE,is conserved throughout the motion provided force Fis non-dissipative (i.e. no friction).\nIf we know the potential energy as a function of position, V(x)we can determine the force Ffrom\nF=\u0000dV\ndx: (90)\nNote Fis in the direction of decreasing V.\nExample 7 Gravitational force F=\u0000mg. Then\nFigure 17: Particle falling under gravity\nV(x1) =Zx0\nx1Fdx=Zx0\nx1(\u0000mg) dx= (\u0000mgx )jx0\nx1=mgx 1\u0000mgx 0: (91)\nWe can choose x0= 0as the ground, giving\nV(x) =mgx (92)\nand\nF=\u0000dV\ndx=\u0000mg (93)\nas above.\nExample 8 Equation for motion under constant acceleration of gravity given earlier,\nv2=u2\u00002g(x\u0000x0) (94)\ncan be re-written by multiplying by1\n2mas\n1\n2mv2=1\n2mu2\u00001\n2m2g(x\u0000x0) (95)\n1\n2mv2+mgx =1\n2mu2+mgx 0 (96)\ni.e. conservation of total energy.\nIn three-dimensions we have\nW=Zr2\nr1F\u0001dr=1\n2mv2\n2\u00001\n2mv2\n1: (97)\n14",
      "key_point": "Since\nV(x1) +1\n2mv2\n1=V(x2) +1\n2mv2\n2 (89)\nthen potential energy + kinetic energy is constant, i.e.",
      "context_label": "Paragraph 14",
      "importance_rank": 70
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_8380f4d1",
      "content": "also\nW=V(r1)\u0000V(r2) = change of P :E: (98)\nand\nV(r1) =Zr0\nr1F\u0001dr (99)\nV(r0) = 0 (100)\nF=\u0000rV (101)\nwhere the gradient operator\nr\u0011bi@\n@x+bj@\n@y+bk@\n@z: (102)\nWe can only write F=\u0000rVand de\u0085ne a potential energy function V(r)for a non-dissipative or\nconservative force. A conservative force is one such that the work done by the force in moving the\nparticle from position r1tor2isindependent of the path between r1andr2, see \u0085g 18 The work\nFigure 18: Work done over di¤erent paths by a conservative force\ndone just depends on the initial and end points,\nWAB=W=ZrB\nrAF\u0001dr=V(rA)\u0000V(rB): (103)\nExamples of conservative forces are: electrostatics, gravitation, force due to a stretched spring.\n10 Simple Harmonic motion\nConsider a particle of mass mattached to a light (massless) spring with a displacement xfrom the\nequilibrium (unstretched) position x= 0 as shown in \u0085g 19. Positive xmeans extension, negative x\nmeans compression of the spring. The restoring force is given by Hooke\u0092 s law, F=\u0000kx. The equation\nof motion is\nF=\u0000kx=md2x\ndt2(104)\nor, writing !=p\nk=m\nd2x\ndt2+!2x= 0: (105)\n15",
      "key_point": "also\nW=V(r1)\u0000V(r2) = change of P :E: (98)\nand\nV(r1) =Zr0\nr1F\u0001dr (99)\nV(r0) = 0 (100)\nF=\u0000rV (101)\n...",
      "context_label": "Paragraph 15",
      "importance_rank": 69
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_1dc1b47c",
      "content": "Figure 19: Stretched spring\nThis equation, in one form or another, is one of the most common equations in physics.\nThe general solution is\nx(t) =Acos!t+Bsin!t; (106)\nwhere AandBare two arbitrary constants of integration of the second-order di¤erential equation eq(105).\nThe functions sin!tandcos!tare shown in \u0085gs 20 and 21. This solution can also be written in the form\nx(t) =Cei!t+De\u0000i!t; (107)\nwhere CandDare two arbitrary constants of integration, or as\nx(t) =rcos (!t+\u001e) (108)\nwith distance rand angle \u001earbitrary constants. The values of these arbitrary constants are determined\nby the initial orboundary conditions .\n10 7.5 5 2.5 01\n0.5\n0\n-0.5\n-1tx\ntx\nFigure 20: sin !t\n10 7.5 5 2.5 01\n0.5\n0\n-0.5\n-1tx\ntx\nFigure 21: cos !t\nAny solution to the equation of motion is periodic , the time for one complete period/oscillation being\nT=2\u0019\n!= 2\u0019rm\nk: (109)\n16",
      "key_point": "Figure 19: Stretched spring\nThis equation, in one form or another, is one of the most common equa...",
      "context_label": "Paragraph 16",
      "importance_rank": 68
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_a904299c",
      "content": "The frequency of oscillation is\n\u0017=1\nT=!\n2\u0019=1\n2\u0019r\nk\nmHz: (110)\nand the angular frequency !=p\nk=m rad/s.\nExample 9 Suppose x=aanddx=dt= 0att= 0are the initial conditions. Then from\nx(t) = Acos!t+Bsin!t; (111)\ndx\ndt=\u0000!Asin!t+!Bcos!t (112)\nsubstituting the initial values gives,\na=A; (113)\n0 = !B: (114)\nThus a particular solution satisfying the initial conditions is\nx(t) = acos!t (115)\nv(t) = \u0000a!sin!t: (116)\nThe largest displacement ais called the amplitude.\n10.1 Potential and kinetic energy in simple harmonic motion\nWe now consider the variations of the potential energy and kinetic energy of the particle as it undergoes\nsimple harmonic motion. The force F=\u0000kxis a conservative force so the potential energy\nV(x) =1\n2kx2+V0: (117)\nWe can choose V(x= 0) = 0 giving V0= 0and the potential energy is\nV(x) =1\n2ka2cos2(!t) (118)\nThe kinetic energy KEis\nKE=1\n2mv2=1\n2ma2!2sin2(!t): (119)\nThe total energy E=KE+Vis\nE=1\n2ma2!2sin2(!t) +1\n2ka2cos2(!t): (120)\nBut!2=k=m so\nE=1\n2ma2k\nmsin2(!t) +1\n2ka2cos2(!t); (121)\n=1\n2ka2\u0002\nsin2(!t) + cos2(!t)\u0003\n; (122)\nE=1\n2ka2=KE+V: (123)\nFig 22 shows the potential energy curve for a stretched spring. If total energy is E, then the motion is\nrestricted to jxj< a. Atx=a,V=1\n2ka2=E, and KE= 0; atx= 0,V= 0, and KE=1\n2ka2=E.\nWhenever the potential energy function of a system has a rounded minimum, the vibrational motion\nabout the equilibrium position of minimum potential energy approximates to simple harmonic motion.\nAn example is two atoms bound together to form a molecule, such as in \u0085g 23,. If r0is the separation\nfor minimum potential energy, (the equilibrium separation), the two atoms vibrate about this value r0.\n17",
      "key_point": "The frequency of oscillation is\n\u0017=1\nT=!",
      "context_label": "Paragraph 17",
      "importance_rank": 67
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_141bd0c6",
      "content": "Figure 22: Potential energy curve for simple harmonic motion\n1.25 1.125 1 0.875 0.75 0.62575\n50\n25\n0\n-25\n-50\n-75\n-100rV\nrV\nFigure 23: Potential energy curve as a function of the separation of two atoms\nThis can be shown by taking a Taylor\u0092 s series expansion about the equilibrium position. If x0is the\nexquilibrium separation, then\nV(x)\u0000V(x0) =\u0012dV\ndx\u0013\nx=x0(x\u0000x0) +1\n2\u0012d2V\ndx2\u0013\nx=x0(x\u0000x0)2+: : : : (124)\nBut at x=x0is a minimum, so\u0000dV\ndx\u0001\nx=x0= 0and\u0010\nd2V\ndx2\u0011\nx=x0>0. Since the force for small displace-\nments (x\u0000x0)is\nF(x) = \u0000\u0012dV\ndx\u0013\n; (125)\n=\u0000\u0012d2V\ndx2\u0013\nx=x0(x\u0000x0): (126)\nHence force is of the form F=\u0000kxwhere xis displacement from equilibrium, with k > 0, i.e.S.H.M.\n18",
      "key_point": "Figure 22: Potential energy curve for simple harmonic motion\n1.25 1.125 1 0.875 0.75 0.62575\n50\n2...",
      "context_label": "Paragraph 18",
      "importance_rank": 66
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_4d2ee020",
      "content": "10.2 Damped oscillations\nIn all real mechanical oscillators there is some damping (or friction). The damping force opposes the\nmotion of the particle. Consider a damping force that is proportional to the velocity of the particle,\ni.e.Ff=\u0000\u0015dx\ndtwith \u0015a positive constant. Suppose the velocity is positive, i.e. motion in direction of\nincreasing x, then the damping force is in the opposite direction (see \u0085g 24). The equation of motion of\nFigure 24: Displacement and forces in a damped harmonic oscillator\nthe particle is\nF+Ff=md2x\ndt2; (127)\n\u0000kx\u0000\u0015dx\ndt=md2x\ndt2(128)\nor\nmd2x\ndt2+\u0015dx\ndt+kx= 0: (129)\nThis is a second-order, linear, homogeneous di¤erential equation with constant coe¢ cients, m,\u0015andk.\nThe general solution is\nx(t) =Aeq1t+Beq2t; (130)\nwhere q1andq2are the roots of the quadratic equation (the auxiliary equation)\nmq2+\u0015q+k= 0; (131)\nq=\u0000\u0015\u0006p\n\u00152\u00004mk\n2m: (132)\nIn the absence of damping, \u0015= 0, then the natural angular frequency of oscillation, denoted by !0=p\nk=m. Then\nq=\u0000\u0015\n2m\u0006s\n\u00152\n4m2\u0000k\nm=\u0000\u0015\n2m\u0006is\nk\nm\u0000\u00152\n4m2(133)\n=\u0000\u0015\n2m\u0006is\n!2\n0\u0000\u00152\n4m2(134)\n=\u0000\u0015\n2m\u0006i!; (135)\nwhere the angular frequency\n!=s\n!2\n0\u0000\u00152\n4m2: (136)\nThere are three possibilities;\n(a)\u00152<4mk, so\u00152=4m < k=m =!0, and !is real and positive and 0< ! < ! 0\n(b)\u00152= 4mk, so\u00152=4m=k=m =!0and!= 0,\n(c)\u00152>4mk, so\u00152=4m > k=m =!0so!is complex and qis wholly real, and there is no oscillation.\nWe will consider these cases in turn.\n19",
      "key_point": "10.2 Damped oscillations\nIn all real mechanical oscillators there is some damping (or friction).",
      "context_label": "Paragraph 19",
      "importance_rank": 65
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_99408d9b",
      "content": "(a)\u00152<4mk, known as light damping (0< ! < ! 0).\nThe roots are complex quantities, q1=\u0000\u0015\n2m+i!andq2=\u0000\u0015\n2m\u0000i!, so\nx(t) = Aeq1t+Beq2t; (137)\n= e\u0000(\u0015=2m)t\u0002\nAei!t+Be\u0000i!t\u0003\n: (138)\nFrom de Moivre\u0092 s theorem ei\u0012= cos \u0012+isin\u0012,x(t)can be re-written as\nx(t) = e\u0000(\u0015=2m)t[Ccos!t+Dsin!t] (139)\nwhich is a product of a function e\u0000(\u0015=2m)texponentially decaying with time and an oscillating function\n[Ccos!t+Dsin!t]of time with angular frequency !as shown in \u0085g 25.\n20 15 10 5 01\n0.5\n0\n-0.5\n-1tx\ntx\nFigure 25: Displacement as function of time in an under damped oscillator\nEnergy is continually being lost due to the damping force but at any given time the energy of the\noscillator is\nE=KE+V=1\n2mv2+1\n2kx2: (140)\nUsing the above expressions for x(t)it can be shown that for very light damping\nE(t)'E0e\u0000\u0015t=m; (141)\nwhere E0is the total energy at t= 0. Therefore E0=1\n2ka2for an initial displacement a, and\ndE\ndt' \u0000\u0015\nmE0e\u0000\u0015t=m' \u0000\u0015\nmE: (142)\nHence in time interval dtthe fractional energy loss\ndE\nE=\u0000\u0015\nmdt: (143)\n20",
      "key_point": "(a)\u00152<4mk, known as light damping (0< !",
      "context_label": "Paragraph 20",
      "importance_rank": 64
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_ccf6c6de",
      "content": "In a time interval dt= 1=!, the fractional energy loss is \u0015=(m!). The reciprocal of this quantity\nE\ndE=Q=m!\n\u0015'm!0\n\u0015(144)\nis called the Q-factor orquality factor . For a lightly damped oscillator the Q-factor is large.\n(b)\u00152= 4mk,(!= 0)known as critical damping\nThe two roots are equal to \u0000\u0015=(2m). In this case the general solution to the equation of motion is\nx(t) = (A+Bt)e\u0000(\u0015=2m)t: (145)\nIfx=aand dx=dt= 0att= 0,x(t)is never negative - there is no oscillation and the system returns\nto the equilibrium position is the shortest time (see \u0085g 26).\n80 60 40 20 01\n0.75\n0.5\n0.25\ntx\ntx\nFigure 26: Displacement as function of time for critical damping\nCritical damping is required for swing-doors and car suspensions.\n(c)\u00152>4mk, known as heavy damping, !is complex and qis wholly real. The two roots are\nq1=\u0000\u0015\n2m+s\n\u00152\n4m2\u0000!2\n0<0; (146)\nq2=\u0000\u0015\n2m\u0000s\n\u00152\n4m2\u0000!2\n0<0: (147)\nBoth roots are negative but q2is more negative then q1, i.e.jq2j>jq1j. The displacement\nx(t) =Ae\u0000jq1jt+Be\u0000jq2jt(148)\nis the addition of two term, the \u0085rst Ae\u0000jq1jtdies away slowly (middle curve in \u0085g 27), the second\nBe\u0000jq2jtdies away more quickly (lower curve in \u0085g 27). As damping increases jq1jbecomes smaller and\nthe displacement decreases more slowly with time.\n21",
      "key_point": "In a time interval dt= 1=!, the fractional energy loss is \u0015=(m!).",
      "context_label": "Paragraph 21",
      "importance_rank": 63
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_2b197428",
      "content": "35 30 25 20 15 10 5 02\n1.5\n1\n0.5\n0\nxy\nxyFigure 27: Displacement as function of time for overdamped (heavy) oscillator\n10.3 Forced damped oscillator\nConsider applying a periodic force F=F0cos!ftto a damped oscillator in order to keep it oscillating.\nThe equation of motion of the particle is\nmd2x\ndt2+\u0015dx\ndt+kx=F0cos!ft (149)\nwhere the term on the R.H.S. is the driving or forcing term. The general solution to this equation is the\nsum of the general solution to the homogeneous equation (zero on R.H.S., eq(129)) plus a particular\nsolution to the full equation. It was shown above that the solution to the homogeneous equation eq(129)\ndies away exponentially (this is called the transient solution) so that after a su¢ ciently long time the\nmotion of the particle is described by the particular solution alone.\nLet\u0092 s take as an ansatz solution a particular solution of the form\nx(t) =Acos (!ft+\u001e): (150)\nThat is one having the same frequency !fas the driving frequency but with an unknown phase di¤erence\n\u001eand amplitude A. To determine Aand\u001esubstitute the assumed solution into the di¤erential equation\nof motion. As\ndx\ndt=\u0000!fAsin (!f+\u001e); (151)\nd2x\ndt2=\u0000!2\nfAcos (!f+\u001e); (152)\nwe have\n\u0000m!2\nfAcos (!f+\u001e)\u0000\u0015!fAsin (!f+\u001e) +kAcos (!ft+\u001e) =F0cos!ft (153)\nA\u0000\nk\u0000m!2\nf\u0001\ncos (!f+\u001e)\u0000\u0015!fAsin (!f+\u001e) =F0cos!ft (154)\nExpanding the cosine and sine terms,\nA\u0000\nk\u0000m!2\nf\u0001\n[cos!ftcos\u001e\u0000sin!ftsin\u001e]\u0000\u0015!fA[sin!ftcos\u001e+ cos !ftsin\u001e] =F0cos!ft (155)\n22",
      "key_point": "35 30 25 20 15 10 5 02\n1.5\n1\n0.5\n0\nxy\nxyFigure 27: Displacement as function of time for overdampe...",
      "context_label": "Paragraph 22",
      "importance_rank": 62
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_54719631",
      "content": "This equation must be true for all values of t. (Note cosine and sine are orthogonal functions.) Choose\ntsuch that cos!ft= 1, then sin!ft= 0, and\nA\u0000\nk\u0000m!2\nf\u0001\ncos\u001e\u0000\u0015!fAsin\u001e=F0: (156)\nNow choose tsuch that sin!ft= 1, then cos!ft= 0, and\n\u0000A\u0000\nk\u0000m!2\nf\u0001\nsin\u001e\u0000\u0015!fAcos\u001e= 0: (157)\nSquaring eq(156) and eq(157) and adding gives,\nA2\u0000\nk\u0000m!2\nf\u00012+\u00152!2\nfA2=F2\n0; (158)\nand\nA=F0\u0014\u0010\nk\u0000m!2\nf\u00112\n+\u00152!2\nf\u00151=2: (159)\nFor an undamped, unforced oscillator the natural angular frequency is\n!0=r\nk\nm(160)\nsok=m!2\n0, which gives\nA=F0\u0014\nm2\u0010\n!2\n0\u0000!2\nf\u00112\n+\u00152!2\nf\u00151=2: (161)\nWe can now investigate the variation of Awith !f. If there were no damping, \u0015= 0, then\nA=F0\nm\f\f\f\u0010\n!2\n0\u0000!2\nf\u0011\f\f\f: (162)\nHence A! 1 as!f!!0. Even with damping, Ahas its maximum value when !f'!0. This is the\nphenomena of resonance .Amplitude of the oscillation becomes much larger when the angular frequency\n10.5 10.25 10 9.75 9.50.75\n0.5\n0.25\n0\nwfA\nwfA\nFigure 28: Amplitude of forced oscillator; Lower curve - heavy damping; Upper curve - light damping\nof the driving force is equal to the natural frequency of the undamped oscillator as shown in \u0085g 28.\nDramatic example - Facoma Narrows bridge.\n23",
      "key_point": "This equation must be true for all values of t. (Note cosine and sine are orthogonal functions.)",
      "context_label": "Paragraph 23",
      "importance_rank": 61
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_4bdbcedd",
      "content": "From eq(157)\ntan\u001e=\u0015!f\u0010\nm!2\nf\u0000k\u0011=\u0015!f\nm\u0010\n!2\nf\u0000!2\n0\u0011: (163)\nBelow the resonance frequency, !f< ! 0the phase angle \u001eis fairly small, but negative as shown in \u0085g\n20 15 10 5 0\n0\n-0.5\n-1\n-1.5\n-2\n-2.5\n-3wf\nphiwf\nphi\nFigure 29: Phase in forced oscillator as function of driving frequency\n29. Therefore the displacement xis approximately in phase with the driving force. As !fincreases\nthrough !0the phase angle increases rapidly and drops through \u0000\u0019=2to\u0000\u0019, at which stage xis then\nout of phase with the driving force for !f> ! 0.\n11 Motion in a plane (two-dimensions)\nParticle at point P as in \u0085g 30. Its position, velocity and acceleration are\nFigure 30: Vectors for motion in two dimensions\nr=xbi+ybj; (164)\nv=dr\ndt=dx\ndtbi+dy\ndtbj; (165)\na=dv\ndt=d2x\ndt2bi+d2y\ndt2bj: (166)\n24",
      "key_point": "From eq(157)\ntan\u001e=\u0015!f\u0010\nm!2\nf\u0000k\u0011=\u0015!f\nm\u0010\n!2\nf\u0000!2\n0\u0011: (163)\nBelow the resonance frequency, !f< !",
      "context_label": "Paragraph 24",
      "importance_rank": 60
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_766818e6",
      "content": "We will consider various examples of motion in a plane\n11.1 Trajectories of particle in a uniform gravitational \u0085eld (ballistic trajec-\ntories)\nInitial velocity u0makes an angle \u000bwith the horizontal (sometimes called the angle of elevation) as in\n\u0085g 31. Equation of motion is\nFigure 31: Ballistic trajectory\nmdv\ndt=m\u0012dvx\ndtbi+dvy\ndtbj\u0013\n=\u0000mgbj: (167)\nHence immediately we see that\ndvx\ndt= 0 (168)\nand so vxis constant, equal to its initial value\nvx(t) = u0cos\u000b; (169)\nx(t) = u0tcos\u000b: (170)\nAlso\ndvy\ndt=\u0000g; (171)\nvy=u0sin\u000b\u0000gt; (172)\ny=u0tsin\u000b\u00001\n2gt2; (173)\nand (from v2=u2+ 2as)\nv2\ny=u2\n0sin2\u000b\u00002gy: (174)\n11.1.1 Shape of trajectory\nSince x(t) =u0tcos\u000bthen t=x=(u0cos\u000b). Hence using the yposition, eq(173)\ny=u0\u0012x\nu0cos\u000b\u0013\nsin\u000b\u00001\n2g\u0012x\nu0cos\u000b\u00132\n(175)\n=xtan\u000b\u0000\u0012gx2\n2u2\n0cos2\u000b\u0013\n: (176)\nThis is the equation of a parabola.\n25",
      "key_point": "We will consider various examples of motion in a plane\n11.1 Trajectories of particle in a uniform...",
      "context_label": "Paragraph 25",
      "importance_rank": 59
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_3118c955",
      "content": "The range Ron the horizontal plane is found from setting y= 0. Then\n0 =xtan\u000b\u00001\n2g\u0012x2\nu2\n0cos2\u000b\u0013\n(177)\nwhich has one solution, x= 0, and the other\nx=R=2u2\n0\ngsin\u000bcos\u000b=u2\n0\ngsin 2\u000b: (178)\nTime to reach y= 0is found from\n0 =u0tsin\u000b\u00001\n2gt2(179)\ngiving either t= 0(the initial position) or for the whole range\nT=2u0sin\u000b\ng: (180)\nMaximum range occurs when sin 2\u000b= 1, so when \u000b=\u0019=4 = 45\u000e, and Rmax=u2\n0=g.\nFor a range R < R maxthere are two values of \u000bwhich give rise to the same range, as illustrated in\n\u0085g 32 and \u0085g 33.\nFigure 32: Angle for di¤erent ranges\nFigure 33: Two trajectories giving the same range\nSince R=Rmaxsin 2\u000b, and sin 2\u000b= sin ( \u0019\u00002\u000b)then\n2\u000b1= sin\u00001\u0012R\nRmax\u0013\n= sin\u00001\u0012gR\nu2\n0\u0013\n; (181)\n26",
      "key_point": "The range Ron the horizontal plane is found from setting y= 0.",
      "context_label": "Paragraph 26",
      "importance_rank": 58
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_f32a8fe1",
      "content": "(\u0019\u00002\u000b2) = sin\u00001\u0012R\nRmax\u0013\n= 2\u000b1: (182)\nHence\n\u000b2=\u0019\n2\u0000\u000b1 (183)\nand then\n\u000b2\u0000\u0019\n4=\u0019\n4\u0000\u000b1 (184)\nso we see that the two angles for the same range are symmetric about \u0019=4, see \u0085g 33. Maximum range\noccurs when \u000b1=\u000b2=\u0019=4.\n12 Conservation of momentum for isolated systems of particles\nFrom Newton\u0092 s second law, F=dp\ndt, ifF= 0, then pis constant. Consider a body of mass Mmoving with\nvelocity Vand not subject to any forces. Its momentum remains constant, i.e. p=MV=constant.\nThe body then explodes into several pieces (say at least three) with masses mi,i= 1,2,3: : :travelling\nwith velocities vi,i= 1,2,3: : :as illustrated in \u0085g 34. The total momentum of the pieces is\nFigure 34: Exploding mass\np1+p2+p3+: : :=m1v1+m2v2+m3v3+: : : : (185)\nThe explosion gives impulses Iito each of the three pieces. Because of Newton\u0092 s third law (action and\nreaction are equal an opposite). If impulse on particle 1 due to particle 2 is I12and that due to particle\n2 on particle 1 is I21, then\nI12=I21: (186)\nFor particle 1 the total impulse on it due to the other particles is\nI1=I12+I13 (187)\nand for the whole system we have\nI1+I2+I3= (I12+I13) + (I21+I23) + (I31+I32) (188)\n= (I12+I21) + (I23+I21) + (I31+I32) (189)\n= 0 + 0 + 0 (190)\nThus total impulse is zero and so the total momentum is the same before and after the explosion,\np=p1+p2+p3+: : : (191)\nMV=m1v1+m2v2+m3v3+: : : (192)\nthat is, total momentum is conserved . In this case (non-relativistic) mass is conserved,\nM=m1+m2+m3+: : : : (193)\n27",
      "key_point": "(\u0019\u00002\u000b2) = sin\u00001\u0012R\nRmax\u0013\n= 2\u000b1: (182)\nHence\n\u000b2=\u0019\n2\u0000\u000b1 (183)\nand then\n\u000b2\u0000\u0019\n4=\u0019\n4\u0000\u000b1 (184)\nso we see...",
      "context_label": "Paragraph 27",
      "importance_rank": 57
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_1342eb7f",
      "content": "On the other hand kinetic energy is not conserved ,\n1\n2MV26=1\n2m1v2\n1+1\n2m2v2\n2+1\n2m3v2\n3+: : : (194)\nbut the extra kinetic energy comes from chemical potential energy or energy stored in springs.\nExample 10 Two particles, one initially at rest, collide and stick together (opposite of the explosion).\nInitial momentum is\npi=m1v1+ 0: (195)\nFinal momentum is\npf=MV= (m1+m2)V: (196)\nSince total momentum is conserved, pi=pf, som1v1= (m1+m2)Vand\nV=m1\nm1+m2v1 (197)\nand combined particle moves in the same direction as the incoming one, but at a reduced speed. The\ninitial kinetic energy is\nKEi=1\n2m1v2\n1+ 0: (198)\nThe \u0085nal kinetic energy\nTf=1\n2(m1+m2)V2=1\n2(m1+m2)\u0012m1\nm1+m2v1\u00132\n=1\n2m2\n1\n(m1+m2)v2\n1<1\n2m1v2\n1: (199)\nThus there is a loss of kinetic energy in a \u0091 sticking\u0092collision. The energy is converted into heat and/or\nsound.\n13 Collisions between bodies\nThese are very important in many branches of physics and chemistry.\n13.1 With a rigid wall\nIf wall is smooth, i.e. no friction, then impulse given to the particle by the wall is perpendicular to the\nwall, there is no component parallel to the wall\u0092 s surface. as in \u0085g 35 Hence tangential component of\nvelocity is unaltered so\nvisin\u000b=vfsin\f: (200)\nIf collision is perfectly elastic, i.e. no loss of kinetic energy,\n1\n2mv2\ni=1\n2mv2\nf (201)\nand so\nvi=vf; (202)\n\u000b=\f: (203)\nThus the normal component of velocity is simply reversed in the collision.\nIn practice the normal component of velocity is reduced by a factor e < 1(called coe¢ cient of\nrestitution), such that\nvfcos\f=evicos\u000b: (204)\nSince\nvfsin\f\u0000visin\u000b (205)\nand\ntan\f=tan\u000b\ne; (206)\n28",
      "key_point": "On the other hand kinetic energy is not conserved ,\n1\n2MV26=1\n2m1v2\n1+1\n2m2v2\n2+1\n2m3v2\n3+: : : (...",
      "context_label": "Paragraph 28",
      "importance_rank": 56
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_1309a7dd",
      "content": "Figure 35: Collision of small mass with a rigid wall\nsovf< viand\f > \u000b . There is a loss of kinetic energy since\nv2\nf=v2\ni(sin2\u000b+e2cos2\u000b) =v2\ni+v2\ni\u0000\ne2\u00001\u0001\ncos2\u000b (207)\n1\n2mv2\nf\u00001\n2mv2\ni=1\n2mv2\ni\u0000\ne2\u00001\u0001\ncos2\u000b < 0: (208)\nFor an elastic collision, e= 1, and kinetic energy is conserved\n13.2 Between two bodies of \u0085nite mass, one initially at rest\nNo external forces act during the collision so the total momentum is conserved (always true).\n13.2.1 Head-on elastic collision ( e= 1)\nFigure 36: Head-on elastic collision\nConservation of momentum gives from \u0085g 36\nm1u1+ 0 = m1v1+m2v2; (209)\nv2=m1\nm2(u1\u0000v1) (210)\n29",
      "key_point": "Figure 35: Collision of small mass with a rigid wall\nsovf< viand\f > \u000b .",
      "context_label": "Paragraph 29",
      "importance_rank": 55
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_0a0be605",
      "content": "Conservation of kinetic energy gives\n1\n2m1u2\n1+ 0 =1\n2m1v2\n1+1\n2m2v2\n2 (211)\nm1u2\n1=m1v2\n1+m2\u0014m1\nm2(u1\u0000v1)\u00152\n(212)\nu2\n1=v2\n1+m1\nm2(u1\u0000v1)2(213)\nu2\n1\u0000v2\n1=m1\nm2(u1\u0000v1)2(214)\n(u1\u0000v1) (u1+v1) =m1\nm2(u1\u0000v1)2: (215)\nThus one solution is v1=u1. The other is found from\n(u1+v1) =m1\nm2(u1\u0000v1); (216)\nv1=(m1\u0000m2)\n(m1+m2)u1: (217)\nThe corresponding velocities for particle 2 are\nv2= 0 ; (218)\nv2=m1\nm2\u0012\nu1\u0000(m1\u0000m2)\n(m1+m2)u1\u0013\n(219)\nv2=2m1u1\n(m1+m2): (220)\nThe solution v1=u1,v2= 0corresponds to no collision. The non-trivial solution is\nv1=(m1\u0000m2)\n(m1+m2)u1< u1 v2=2m1u1\n(m1+m2)>0: (221)\nIfm1> m 2then v1is positive; if m1< m 2then v1is negative. If m1=m2then v1= 0andv2=u1,\nthe incident particle is brought to rest and the struck one moves of with the initial velocity. If m1\u001dm2\nthen v1'u1andv2'2u1. Ifm2\u001dm1then v1' \u0000u1andv2'0, i.e. collision with a \"\u0085xed\" wall.\n13.2.2 Glancing collision of two balls\nWe shall assume balls are smooth, so that the impulse on each ball can only be along line of their centres.\nSuppose ball 2 is initially at rest as shown in \u0085g 37. The impulse on it, I2=m2v2, is along the line of\ncentres, so the direction of v2is along line of ball centres at impact. Impulse on ball 1 is\nI1=\u0000I2=mv1\u0000m1u1: (222)\nThe direction of v2is determined by angle \u001e, the angle between line of centres and the initial direction\nofu1.\nMomentum is conserved in the collision, so\nm1u1+ 0 = m1v1+m2v2 (223)\nIf collision is elastic then kinetic energy is conserved and\n1\n2m1u2\n1+ 0 =1\n2m1v2\n1+1\n2m2v2\n2: (224)\nExpressing momentum in the xandydirections\nm1u1=m1v1cos\u0012+m2v2cos\u001e; (225)\nm1v1sin\u0012\u0000m2v2sin\u001e= 0: (226)\n30",
      "key_point": "Conservation of kinetic energy gives\n1\n2m1u2\n1+ 0 =1\n2m1v2\n1+1\n2m2v2\n2 (211)\nm1u2\n1=m1v2\n1+m2\u0014m1\n...",
      "context_label": "Paragraph 30",
      "importance_rank": 54
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_32fa0095",
      "content": "Figure 37: Glancing collision\nThe angle \u001eis determined by the geometry of the collision. Thus we have three equations to solve for\nthree unknowns v1,v2and\u0012. The solution is rather complicated for general masses m1andm2but is\nquite simple for the special case of m1=m2. Then conservation of momentum gives\nmu1=mv1+mv2; (227)\nu1=v1+v2: (228)\nKinetic energy conservation gives\n1\n2mu2\n1=1\n2mv2\n1+1\n2mv2\n2 (229)\nu2\n1=v2\n1+v2\n2 (230)\nBut from the magnitude of u1\nu1\u0001u1= (v1+v2)\u0001(v1+v2) (231)\nu2\n1=v2\n1+v2\n2+ 2v1\u0001v2 (232)\nComparing equations eq(230) and eq(232) we see that\nv1\u0001v2= 0 (233)\nand so v1is perpendicular to v2, and \u0012+\u001e=\u0019=2.\n14 Motion in a plane expressed in plane polar coordinates\nParticle of mass mis at position P de\u0085ned by Cartesian coordinates (x; y)or polar coordinates (r; \u0012)or\nvector ras shown in \u0085g 38. Let us introduce a unit radial vector brand unit transverse vector b\u0012;brandb\u0012\nare orthogonal (perpendicular) to each other. The position P is r=rbr. In terms of unit vectors along\nthe \u0085xed Cartesian axes\nbr= cos \u0012bi+ sin \u0012bj (234)\nb\u0012=\u0000sin\u0012bi+ cos \u0012bj: (235)\nAs the particle moves the directions ofbrandb\u0012vary .\n31",
      "key_point": "Figure 37: Glancing collision\nThe angle \u001eis determined by the geometry of the collision.",
      "context_label": "Paragraph 31",
      "importance_rank": 53
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_9ee48cb5",
      "content": "Figure 38: Diagram for unit vectors for two-dimensional motion\nConsider velocity of the particle,\nv=dr\ndt=d\ndt(rbr) =dr\ndtbr+rdbr\ndt: (236)\nAn expression for dbrcan be found algebraically or graphically as shown in \u0085g 39. Algebraically we have\nbr= cos \u0012bi+ sin \u0012bj; (237)\ndbr\ndt=\u0000sin\u0012d\u0012\ndtbi+ cos \u0012d\u0012\ndtbj; (238)\n=d\u0012\ndt\u0010\n\u0000sin\u0012bi+ cos \u0012bj\u0011\n; (239)\ndbr\ndt=d\u0012\ndtb\u0012: (240)\nSo\nv=dr\ndt=dr\ndtbr+rd\u0012\ndtb\u0012: (241)\nThe radial component of visdr\ndt; transverse component is rd\u0012\ndt.\nAn often used abbreviation for di¤erentiation with respect to time is to put a dot above the quantity,\nso the above expression for vis written as\nv=\u0005r=\u0005rbr+r\u0005\n\u0012b\u0012 (242)\nSpeed of the particle is\nv=jvj=pv\u0001v=q\n:r2+r2:\n\u00122\n: (243)\nConsider acceleration of the particle\na=dv\ndt=d\ndt\u0012dr\ndtbr+rd\u0012\ndtb\u0012\u0013\n(244)\n=d2r\ndt2br+dr\ndtdbr\ndt+dr\ndtd\u0012\ndtb\u0012+rd2\u0012\ndt2b\u0012+rd\u0012\ndtdb\u0012\ndt: (245)\n32",
      "key_point": "Figure 38: Diagram for unit vectors for two-dimensional motion\nConsider velocity of the particle,...",
      "context_label": "Paragraph 32",
      "importance_rank": 52
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_3625a5c4",
      "content": "Figure 39: Time dependence of polar vectors\nThe time derivativedb\u0012\ndtcan be found also algebraically or graphically, as illustrated in \u0085g 39.\nb\u0012=\u0000sin\u0012bi+ cos \u0012bj; (246)\ndb\u0012\ndt=\u0000cos\u0012d\u0012\ndtbi\u0000sin\u0012d\u0012\ndtbj; (247)\ndb\u0012\ndt=\u0000d\u0012\ndt\u0010\ncos\u0012bi+ sin \u0012bj\u0011\n=\u0000d\u0012\ndtbr: (248)\nHence the acceleration\na=d2r\ndt2br+dr\ndtd\u0012\ndtb\u0012+dr\ndtd\u0012\ndtb\u0012+rd2\u0012\ndt2b\u0012\u0000rd\u0012\ndtd\u0012\ndtbr; (249)\n=\"\nd2r\ndt2\u0000r\u0012d\u0012\ndt\u00132#\nbr+\u0014\n2dr\ndtd\u0012\ndt+rd2\u0012\ndt2\u0015\nb\u0012; (250)\na=\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012: (251)\nThe radial component of the acceleration is\u0012\n::r\u0000r:\n\u00122\u0013\n, the transverse component is\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n.\n14.1 Circular motion\nConsider a particle moving in a circle of radius ras shown in \u0085g 40. Then ris constant, so\u0001r= 0,\u0001\u0001r= 0.\nHence\nv=r\u0005\n\u0012b\u0012 (252)\n33",
      "key_point": "Figure 39: Time dependence of polar vectors\nThe time derivativedb\u0012\ndtcan be found also algebraica...",
      "context_label": "Paragraph 33",
      "importance_rank": 51
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_b81e1630",
      "content": "Figure 40: Motion in a circle\nand the velocity is purely transverse.\nWe sometimes write !=d\u0012\ndt=\u0005\n\u0012, in which case\nv=r!b\u0012: (253)\nThe acceleration\na=\u0012\n\u0000r:\n\u00122\u0013\nbr+r::\n\u0012b\u0012: (254)\nIf the angular velocity is constant,\u0001!=\u0001\u0001\n\u0012= 0, and\na=\u0000r:\n\u00122\nbr=\u0000r!2br: (255)\nSince v=r!b\u0012then for the magnitudes v=!rand so\na=\u0000v2\nrbr (256)\nand the acceleration is directed towards the centre of the circle. This acceleration is called the centripetal\nacceleration . It follows that there must be a force F=ma=\u0000m!2rbr=\u0000mv2\nrbracting radially.\n15 Central force\nA central force is one which is purely directed along a radius, either towards or away from the centre, so\nthat\nF(r) =F(r)br: (257)\nIfF(r)ispositive the force is repulsive orcentrifugal ; ifF(r)isnegative the force is attractive\norcentripetal . Examples of central forces are\n(a) electrostatic force between point or spherically symmetric charges; like charges repel and unlike\ncharges attract,\n(b) gravitational force\nF(r) =\u0000GM1M2\nr2br (258)\nbetween point or spherically symmetric masses; this is always attractive.\n(c) tension in a string or spring.\nThe expressions above for velocity (see \u0085g 41) and acceleration in plane polar coordinates are partic-\nularly important in the case of central forces. The equation of motion is\nma=F=F(r)br; (259)\n34",
      "key_point": "Figure 40: Motion in a circle\nand the velocity is purely transverse.",
      "context_label": "Paragraph 34",
      "importance_rank": 50
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_6df24119",
      "content": "Figure 41: Vectors for rotational motion\nm\u0014\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012\u0015\n=F(r)br (260)\nWe see that that the force only enters into the radial component,\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=F(r) (261)\nand the transverse component\nm\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n= 0: (262)\nis independent of the nature of the force. Hence one may therefore make signi\u0085cant deductions about the\nmotion regardless of the force. The radial component of velocity is vr=\u0001rand the transverse component\nisv\u0012=r\u0001\n\u0012. Wede\u0085ne the magnitude of the angular momentum ,L, of the particle about point O\nas\nL= (mv\u0012)r=mr2\u0001\n\u0012: (263)\n[In general, to be discussed later, angular momentum L=r\u0002p=mr\u0002v. For randvin the plane of\nthe paper, then Lis out of the paper and perpendicular to it.] Thus\nL=mr2\u0001\n\u0012 (264)\ndL\ndt=d\ndt\u0012\nmr2\u0001\n\u0012\u0013\n=m\u0012\n2r\u0001r\u0001\n\u0012+r2\u0001\u0001\n\u0012\u0013\n(265)\n=mr\u0012\n2\u0001r\u0001\n\u0012+r\u0001\u0001\n\u0012\u0013\n=mra \u0012 (266)\nwhere we have used the expression for the transverse acceleration a\u0012= 2\u0001r\u0001\n\u0012+r\u0001\u0001\n\u0012. But for a central force\nthe transverse acceleration must be zero, so\ndL\ndt= 0; (267)\nand hence the angular momentum Lisconstant during the motion for any central force .\n15.1 Examples of central force motion\n15.1.1 Motion in a circle\n(1) Consider a planet, mass m, moving in a circular orbit about a star of mass Mas in \u0085g 42 The\n35",
      "key_point": "Figure 41: Vectors for rotational motion\nm\u0014\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012\u0015\n=F(r)br (260)\nWe s...",
      "context_label": "Paragraph 35",
      "importance_rank": 49
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_9f3e9d9f",
      "content": "Figure 42: Planet in circular motion about Sun\ncentripetal force is due to gravity,\nF(r) = \u0000GMm\nr2br (268)\n\u0000GMm\nr2br=m\u0012\n\u0000r:\n\u00122\u0013\nbr (269)\nr:\n\u00122\n=GM\nr2(270)\n:\n\u00122\n=!2=GM\nr3: (271)\nThe period of rotation T= 2\u0019=!, so\n\u00122\u0019\nT\u00132\n=GM\nr3(272)\nT2=4\u00192\nGMr3(273)\nT2/r3; (274)\nas expressed in Kepler\u0092 s third law of planetary motion.\nSpeed of the planet is v=r!, so\nv=r\nGM\nr: (275)\n(2) Consider a car of mass mmoving in a circular path of radius ron a horizontal surface with\ncoe¢ cient of friction \u0016as in \u0085g 43. What is the maximum speed without skidding sideways (ignore\ntoppling over for the moment)? The centripetal force necessary for it to travel round the circular path is\nFigure 43: Car in circular motion on horizontal track\nF=m\u0012\n\u0000v2\nr\u0013\nbr (276)\n36",
      "key_point": "Figure 42: Planet in circular motion about Sun\ncentripetal force is due to gravity,\nF(r) = \u0000GMm\nr...",
      "context_label": "Paragraph 36",
      "importance_rank": 48
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_493c6a21",
      "content": "and this must be provided by the frictional force between the wheels and the ground. So as the normal\nreaction N=mg, then\nm\u0012\n\u0000v2\nr\u0013\nbr=\u0000Ffriction (277)\nm\u0012v2\nr\u0013\n=\u0016mg (278)\nvmax =p\u0016gr: (279)\nIf\u0016= 1,g'10 m s\u00002then vmax'p\n10rm s\u00001. Thus for r= 20 m ,vmax'14 m s\u00001'31mph.\nExample 11 (From 2000 exam paper, question 11.)\nParticle of mass mmoves on a smooth horizontal table subjected to a force\nF=\u0000K\nr3br: (280)\nIf particle is initially moving in a circle of radius ras in \u0085g 44we will determine the speed of the particle\nand its angular momentum. For this motion,\nFigure 44: Motion in a circle\nF=\u0000K\nr3br=m\u0012\n\u0000r:\n\u00122\u0013\nbr; (281)\nso\n\u0005\n\u0012=1\nr2r\nK\nm: (282)\nThe initial value of the angular momentum at r=r0is\nL=mr2\u0005\n\u0012=p\nmK; (283)\nis independent of r0and so is the only possible value for the angular momentum for motion in a circle\nunder an inverse cube force law.\nSuppose particle is given a radially outward impulse. The impulse does not change the angular\nmomentum so it remains at a valuep\nmK for any subsequent motion. Radial equation of motion after\nthe impulse is\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=\u0000K\nr3: (284)\nBut\u0005\n\u0012=1\nr2q\nK\nmso\nm2\n4::r\u0000r \n1\nr2r\nK\nm!23\n5=\u0000K\nr3; (285)\nm::r= 0 : (286)\nHence\u0001ris constant. So particle moves in a spiral with constant radial component of velocity as illustrated\nin \u0085g 45.\n37",
      "key_point": "and this must be provided by the frictional force between the wheels and the ground.",
      "context_label": "Paragraph 37",
      "importance_rank": 47
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_76f19a5d",
      "content": "Figure 45: Trajectory of particle\nExample 12 Motion of a particle attached to a string and moving in a vertical circle, radius R, under\ngravity, see \u0085g 46. Assume string remains taut throughout the motion. At highest point, A, force is\nFigure 46: Motion of mass on string swung in circle in vertical plane\nF=\u0000(TA+mg)br=m\u0012\n\u0000R:\n\u00122\nA\u0013\nbr (287)\ngiving A\n\u0005\n\u0012A=r\n(TA+mg)\nmR: (288)\nThe velocity at A\nvA=R\u0005\n\u0012A=r\n(TA+mg)R\nm: (289)\nThe minimum speed at A is when the tension TA= 0, i.e.\nvAmin=p\ngR: (290)\nBy conservation of energy at lowest point B\n1\n2mv2\nB=1\n2mv2\nA+mg(2R) (291)\nv2\nB=v2\nA+ 4mgR: (292)\n38",
      "key_point": "Figure 45: Trajectory of particle\nExample 12 Motion of a particle attached to a string and moving...",
      "context_label": "Paragraph 38",
      "importance_rank": 46
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_45602353",
      "content": "At lowest point B the tension in the string TB, is given by\n(\u0000TB+mg)br=m\u0012\n\u0000R:\n\u00122\nB\u0013\nbr (293)\nTB\u0000mg =m\u0012\nR:\n\u00122\nB\u0013\n=mv2\nB\nR(294)\n=m\nR\u0000\nv2\nA+ 4mgR\u0001\n: (295)\nIfvA=vAmin=pgRthen\nTB=mg+m\nR(gR+ 4mgR ) = 6 mg: (296)\n16 Motion under inverse square law of force\nMotion under an inverse square law of force has been extensively analyzed because gravitation is such a\nforce. This is a central force with\nF=K\nr2br: (297)\nThus the potential energy function is\nV=K\nr(298)\nsince\nF=\u0000rV=\u0000br@V\n@r=K\nr2br: (299)\nNote V!0asr! 1 . IfKis positive the force is repulsive; if Kis negative the force is attractive.\nFor the gravitational force K=\u0000GMm and is always attractive. The gravitational constant G=\n6:67\u000210\u000011N m2kg\u00002. For the electrostatic force K=Q1Q2=(4\u0019\"0)where Q1andQ2are the charges\nwhich can be of either sign. The equation of motion of the particle is (see eq(260) and \u0085g 47)\nFigure 47: Rotational motion in a plane\nm\u0014\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012\u0015\n=K\nr2br: (300)\nThus for the radial component\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=K\nr2(301)\nand for the transverse component\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n= 0: (302)\n39",
      "key_point": "At lowest point B the tension in the string TB, is given by\n(\u0000TB+mg)br=m\u0012\n\u0000R:\n\u00122\nB\u0013\nbr (293)\nTB\u0000m...",
      "context_label": "Paragraph 39",
      "importance_rank": 45
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_4522605b",
      "content": "It was noted earlier that\nd\ndt\u0010\nr2:\n\u0012\u0011\n= 2r\u0005r:\n\u0012+r2\u0001\u0001\n\u0012=r\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n= 0: (303)\nThus as r6= 0, then r2:\n\u0012is constant, and so the angular momentum L=mr2:\n\u0012is also constant. Hence\n:\n\u0012=L\nmr2(304)\nand the radial equation can therefore be written in the form\nm\u0012\n::r\u0000L2\nm2r3\u0013\n=K\nr2: (305)\nInstead of solving for rand\u0012as functions of time we will consider the shape of the orbit, i.e. determine\nras a function of \u0012. To do this we de\u0085ne u= 1=r. We then have\n\u0001r=dr\ndt=d\ndt\u00121\nu\u0013\n=\u00001\nu2du\ndt=\u00001\nu2du\nd\u0012d\u0012\ndt; (306)\n\u0001r=\u00001\nu2du\nd\u0012\u0012L\nmr2\u0013\n=\u0000L\nmdu\nd\u0012: (307)\nDi¤erentiating again we get\n::r=d\u0001r\ndt=d\ndt\u0012\n\u0000L\nmdu\nd\u0012\u0013\n=d\nd\u0012\u0012\n\u0000L\nmdu\nd\u0012\u0013d\u0012\ndt=\u0000L\nmd2u\nd\u00122\u0012L\nmr2\u0013\n(308)\n::r=\u0000L2\nm2u2d2u\nd\u00122: (309)\nIn terms of uthe radial equation (305)is\nm\u0012\n\u0000L2\nm2u2d2u\nd\u00122\u0000u3L2\nm2\u0013\n=Ku2: (310)\nMultiplying through by \u0000m=\u0000\nL2u2\u0001\ngives\nd2u\nd\u00122+u=\u0000mK\nL2: (311)\nIn terms of the variable y=u+mK=L2this is the equation of simple harmonic motion,\nd2y\nd\u00122+y= 0 (312)\nwith solution y=Acos (\u0012\u0000\u00120). Thus the general solution of eq(311) is\nu=Acos (\u0012\u0000\u00120)\u0000mK\nL2=1\nr: (313)\nThis is of the same form as the general equation of a conic section , (see eq(317))\nu=1\nr=1\nh(1 +ecos\u0012): (314)\nWe can choose \u00120= 0as this de\u0085nes the orientation of the trajectory.\nIfKis negative, i.e. attractive force, the trajectory is of the form shown in \u0085g 48.\nIfKis positive, i.e. repulsive force, the trajectory is of this form in \u0085g 49\n40",
      "key_point": "It was noted earlier that\nd\ndt\u0010\nr2:\n\u0012\u0011\n= 2r\u0005r:\n\u0012+r2\u0001\u0001\n\u0012=r\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n= 0: (303)\nThus as r6= 0...",
      "context_label": "Paragraph 40",
      "importance_rank": 44
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_b093b212",
      "content": "Figure 48: Trajectory for attractive inverse square force law, focus at O\nFigure 49: Trajectory for repulsive inverse square law, focus at O\n41",
      "key_point": "Figure 48: Trajectory for attractive inverse square force law, focus at O\nFigure 49: Trajectory f...",
      "context_label": "Paragraph 41",
      "importance_rank": 43
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_5796a75e",
      "content": "Figure 50: De\u0085nition of terms for conic section\n16.1 Conic sections\nA conic section is a locus of a point which moves in a plane such that its distance from a \u0085xed point, the\nfocus, is a constant ratio e, the eccentricity, to the distance from a \u0085xed straight line, the directrix, see\n\u0085g 50.\nConsider an attractive force so that the relevant conic section is as in the diagram, \u0085g50. The quantity\nhis the value of rwhen \u0012=\u0019=2. From the geometry and de\u0085nitions of eandh, we have\nrcos\u0012+r\ne=h\ne; (315)\nand\nr(1 +ecos\u0012) =h; (316)\nor in terms of u= 1=r,\nu=1\nr=1\nh(1 +ecos\u0012): (317)\nWe shall see that possible forms of the trajectory depend on whether the force is repulsive or attractive.\nFor the attractive force it matters whether the total energy is positive, zero or negative.\n16.1.1 Trajectories - Attractive force ( Kis negative)\nFor an attractive central force , such as gravity there are three types of orbit:\n1. If total energy E > 0, eccentricity e >1the trajectory is a hyperbola, as in \u0085g 51.\n2. If E= 0,e= 0, the trajectory is a parabola, as in \u0085g 52.\n3. If E < 0,e <1, the trajectory is an ellipse, as in \u0085g 53.\nA circle is a special case of an ellipse with zero eccentricity.\n42",
      "key_point": "Figure 50: De\u0085nition of terms for conic section\n16.1 Conic sections\nA conic section is a locus of...",
      "context_label": "Paragraph 42",
      "importance_rank": 42
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_abe7a65e",
      "content": "Figure 51: Hyperbola trajectory, E > 0,e >1\nFigure 52: Parabola trajectory, E= 0,e= 0\nFigure 53: Ellipse trajectory, E < 0,e <1\n43",
      "key_point": "Figure 51: Hyperbola trajectory, E > 0,e >1\nFigure 52: Parabola trajectory, E= 0,e= 0\nFigure 53: ...",
      "context_label": "Paragraph 43",
      "importance_rank": 41
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_aa7d19c2",
      "content": "16.1.2 Determination of eccentricity\nWe shall determine the eccentricity of an orbit for given total energy Eand angular momentum L. The\ntotal energy of the particle is\nE=1\n2mv2+V (318)\nand constant throughout the motion (gravitation is a conservative force). So\nE=1\n2m\u0012\n\u0001r2\n+r2:\n\u00122\u0013\n+K\nr: (319)\nBut\u0001r=\u0000L\nmdu\nd\u0012, and:\n\u0012=L\nmr2=L\nmu2so\nE=1\n2m\"\u0012L\nmdu\nd\u0012\u00132\n+1\nu2\u0012L\nmu2\u00132#\n+Ku (320)\n=1\n2m\"\nL2\nm2\u0012du\nd\u0012\u00132\n+L2\nm2u2#\n+Ku (321)\n= [positive kinetic energy] + potential energy : (322)\nHence we have that\n(i) if Kis positive then Emust also be positive.\n(ii) if Kis negative then Emay be positive, zero or negative.\nThe equation of the orbit is (see eq(313))\nu=Acos\u0012\u0000mK\nL2; (323)\nsodu\nd\u0012=\u0000Asin\u0012 (324)\nand the expression for the total energy becomes\nE=1\n2m\"\nL2\nm2(\u0000Asin\u0012)2+L2\nm2\u0012\nAcos\u0012\u0000mK\nL2\u00132#\n+K\u0012\nAcos\u0012\u0000mK\nL2\u0013\n: (325)\nSince the energy is constant throughout the motion we can evaluate the expression for Eat any convenient\npoint. Choose \u0012=\u0019=2. The energy is\nE=1\n2m\u0014L2A2\nm2+L2\nm2m2K2\nL4\u0015\n\u0000mK2\nL2(326)\n=A2L2\n2m\u0000mK2\n2L2: (327)\nWe can use this to determine the arbitrary constant A, since re-arranging\nA2=2m\nL2\u0012\nE+mK2\n2L2\u0013\n=m2K2\nL4\u0012\n1 +2EL2\nmK2\u0013\n; (328)\nand\nA=mjKj\nL2s\u0012\n1 +2EL2\nmK2\u0013\n: (329)\nThus the orbit is determined completely if the values of EandLare known for a given Kandm.\nThe solution for the motion is\nu=Acos\u0012\u0000mK\nL2(330)\nand the general form of a conic section is\nu=1\nh(1 +ecos\u0012) (331)\n=e\nhcos\u0012+1\nh: (332)\n44",
      "key_point": "16.1.2 Determination of eccentricity\nWe shall determine the eccentricity of an orbit for given to...",
      "context_label": "Paragraph 44",
      "importance_rank": 40
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_65825943",
      "content": "Hence we have\ne\nh=A; (333)\n1\nh=\u0000mK\nL2; (334)\ne=\u0000L2A\nmK=\u0000jKj\nKs\u0012\n1 +2EL2\nmK2\u0013\n: (335)\nFor an attractive inverse square law (such as gravitation) Kis negative and so\ne=s\u0012\n1 +2EL2\nmK2\u0013\n: (336)\nClearly\n(a) if E > 0then e >1and the motion is a hyperbola,\n(b) if E= 0then e= 1and motion is a parabola,\n(c) if E < 0then e <1and motion is an ellipse. In this case the particle cannot escape to in\u0085nity\nbecause at in\u0085nity V= 0and the kinetic energy \u00150. Therefore to escape to in\u0085nity requires E\u00150.\nConsider an elliptic orbit as in the diagram, If we know speed of particle at position of closest approach,\nFigure 54: Parameters for an elliptical orbit\nwe know everything about the orbit. The angular momentum is\nL=mrAvA (337)\nand energy is\nE=1\n2mv2\nA\u0000jKj\nrA: (338)\nWe can determine the eccentricity eand the length of the semi-major axis, a. From general equation\nr(1 +ecos\u0012) =h (339)\nwe have for rA(\u0012= 0) and rB(\u0012=\u0019),\nrA(1 +e) = h; rB(1\u0000e) =h; (340)\n2a=rA+rB=h\n(1 +e)+h\n(1\u0000e)=2h\n(1\u0000e2); (341)\na=h\n(1\u0000e2): (342)\n45",
      "key_point": "Hence we have\ne\nh=A; (333)\n1\nh=\u0000mK\nL2; (334)\ne=\u0000L2A\nmK=\u0000jKj\nKs\u0012\n1 +2EL2\nmK2\u0013\n: (335)\nFor an attra...",
      "context_label": "Paragraph 45",
      "importance_rank": 39
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_ca6f5bf8",
      "content": "From the expressions for handeabove in terms of EandL,\na=\u0000L2\nmK\n\u00002EL2\nmK2=K\n2E=\f\f\f\fK\n2E\f\f\f\f: (343)\nFor the gravitational force, K=\u0000GMm with Gthe gravitational constant, 6:67\u000210\u000011N m2kg\u00002. The\npoint A is the perihelion if the Sun is at the focus, and perigee if the Earth is at the focus. Similarly\npoint B is the aphelion (Sun at the focus) or apogee (Earth at the focus).\nIf origin of coordinates is taken at mid-point of the major axis, the focus is at (ae;0)and the Cartesian\nequation of the orbit is\nx2\nh\nh2\n(1\u0000e2)2i+y2\nh\nh2\n1\u0000e2i= 1 ; (344)\nx2\na2+y2\nb2= 1 (345)\nwith\na=h\n1\u0000e2; b =hp\n1\u0000e2: (346)\n16.2 Kepler\u0092 s laws of planetary motion\n1. Planets move in elliptic orbits with Sun at a focus,\n2. The radius vector sweeps out equal areas in equal times as illustrated in \u0085g 55.\nFigure 55: Areas for Kepler\u0092 s law\n3. (Period of rotation)2/(semi-major axis)3.\nFrom \u0085g 56, the area of triangle is\ndA=1\n2rv\u0012dt=1\n2rr\u0001\n\u0012dt (347)\ndA\ndt=1\n2r2\u0001\n\u0012: (348)\nBut the angular momentum L=mr2\u0001\n\u0012is a constant for any central force so\n46",
      "key_point": "From the expressions for handeabove in terms of EandL,\na=\u0000L2\nmK\n\u00002EL2\nmK2=K\n2E=\f\f\f\fK\n2E\f\f\f\f: (343...",
      "context_label": "Paragraph 46",
      "importance_rank": 38
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_41cdb4de",
      "content": "Figure 56: Kepler\u0092 s law diagram\ndA\ndt=1\n2L\nm=const : (349)\nHence we have Kepler\u0092 s second law.\nThe third law was derived earlier for a circular orbit where a=rand will not be done again for the\ngeneral elliptical motion.\n17 Equivalent one-dimensional equation of motion\nThe radial equation of motion for a central force is\nm\u0012\n::r\u0000r:\n\u00122\u0013\n=F(r) (350)\nand\nL=mr2\u0001\n\u0012= cons tan t : (351)\nThus\n\u0001\n\u0012=L\nmr2(352)\nand\nm \n::r\u0000r\u0012L\nmr2\u00132!\n=F(r) (353)\nm::r\u0000L2\nmr3=F(r) (354)\nm::r=F(r) +L2\nmr3: (355)\nThis is the same equation of motion for a particle moving in one-dimension under an e¤ective force\nFeff=F(r) +L2\nmr3: (356)\nThe second termL2\nmr3is called a centrifugal force\nFC=L2\nmr3: (357)\n47",
      "key_point": "Figure 56: Kepler\u0092 s law diagram\ndA\ndt=1\n2L\nm=const : (349)\nHence we have Kepler\u0092 s second law.",
      "context_label": "Paragraph 47",
      "importance_rank": 37
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_58ea7f4c",
      "content": "IfF(r)is a conservative force we can introduce a potential function V(r)such that\nF(r) =\u0000dV\ndr: (358)\nWe can also introduce the centrifugal potential\nVC=1\n2L2\nmr2(359)\nso that\nFC(r) =\u0000dVC\ndr: (360)\nconsider an attractive inverse square law, F(r) =\u0000jKj=r2, then V=\u0000jKj=rand the total e¤ective\npotential function (see \u0085g 57) is\nVeff=\u0000jKj\nr+L2\n2mr2: (361)\nIf total energy E < 0then the energy line crosses Veffatr=rminandr=rmax, with rmin+rmax= 2a,\nFigure 57: E¤ective potential\nas in \u0085g 57. If total energy E > 0then rmaxis in\u0085nite and orbit is a hyperbola. If E= 0,rmaxis in\u0085nite\nbut particle has zero kinetic energy at in\u0085nity.\n18 Reduced mass\nWhen considering a planet orbiting the Sun we have assumed that the Sun is \u0085xed at the focus. However\nthe mass of the Sun, M, is \u0085nite and therefore the Sun and planet both move with respect to their overall\ncentre of mass. The centre of mass is at point O in \u0085g 58 such that\n48",
      "key_point": "IfF(r)is a conservative force we can introduce a potential function V(r)such that\nF(r) =\u0000dV\ndr: (...",
      "context_label": "Paragraph 48",
      "importance_rank": 36
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_449b8665",
      "content": "Figure 58: Rotation about centre of mass of two bodies\nR=M\n(M+m)r: (362)\nThe acceleration of mrelative to O is\na=d2R\ndt2=M\n(M+m)d2r\ndt2: (363)\nThus the equation of motion of the planet is\nF=ma=mM\n(M+m)d2r\ndt2=\u0016d2r\ndt2: (364)\nThat is the same as a particle of mass\n\u0016=mM\n(M+m)< m (365)\nat a position rrelative to the \u0085xed point O (centre of mass). The real system in which both bodies\norbit about a common centre of mass is equivalent to a body of the reduced mass \u0016orbiting at a distance\nrfrom the (centre of mass) \u0085xed point, see \u0085g 59.\nFigure 59: Equivalent system: reduced mass\nNote that \u0016=mM\n(M+m)< m < M . Ifm\u001cM, then \u0016'm; ifm=Mthen \u0016=m=2.\nNow let\u0092 s look at the kinetic energy of the system. If velocity of mass MisV, that of mass misv,\nthen the total kinetic energy is\nE=1\n2MV2+1\n2mv2: (366)\nSince from \u0085g 58\nR=M\n(M+m)r (367)\nand both masses must have the same angular velocity about the centre of mass, then\nv=!R=!\u0012M\nm+M\u0013\nr; V=!\u0012m\nm+M\u0013\nr: (368)\n49",
      "key_point": "Figure 58: Rotation about centre of mass of two bodies\nR=M\n(M+m)r: (362)\nThe acceleration of mrel...",
      "context_label": "Paragraph 49",
      "importance_rank": 35
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_85bc183a",
      "content": "The kinetic energy of the system\nE=1\n2M!2r2\u0012m\nm+M\u00132\n+1\n2m!2r2\u0012M\nm+M\u00132\n(369)\n=1\n2!2r2\u00121\nm+M\u00132\u0000\nMm2+mM2\u0001\n=1\n2!2r2\u00121\nm+M\u00132\nmM (m+M) (370)\n=\u0012mM\nm+M\u0013\n!2r2=1\n2\u0016!2r2(371)\nis the same as that of a mass \u0016orbiting the centre of mass at a radius rat angular velocity !. Thus the\nreduced mass and the combined masses have the same kinetic energy.\nSimilarly if we look at the angular momentum of the system\nL=m(!R)R+M!(r\u0000R) (r\u0000R): (372)\nSince\nR=M\n(M+m)r (373)\nthen\n(r\u0000R) =m\n(m+M)r (374)\nand\nL=m!\u0014M\n(M+m)r\u00152\n+M!\u0014m\n(m+M)r\u00152\n(375)\n=mM\n(m+M)2(M+m) =mM\n(m+M)!r2=\u0016!r2: (376)\nThe angular,omentum of the reduced mass particle is the same as that of the two particles.\n19 Frames of reference\nA frame of reference is de\u0085ned by a set of coordinate axes (x; y; z )at rest relative to a particular\nobserver. The observer can express position ,velocity andacceleration of a particle relative to this\nframe of reference . We want to consider transformations of these quantities between di¤erent frames\nof reference. This is particularly important in the theory of relativity .\nConsider one frame of reference S, \u0085xed relative to the Earth and another frame of reference S0\u0085xed\nrelative to a car moving with constant velocity valong the x-axis, as in \u0085g 60. Suppose origins Oand\nO0coincide at time t= 0. A point Phas coordinates xat time tinSandx0inS0, so that\nx0=x\u0000vt: (377)\nIf the point Pis not on the x-axis the yandzcoordinates are the same in both frames, i.e.\nx0=x\u0000vt; (378)\ny0=y; (379)\nz0=z: (380)\nNow suppose the point Pis a bird \u0087 ying at a constant velocity ualong the x-axis relative to the Earth,\nthen\nu=dx\ndt: (381)\nVelocity of the bird relative to the car is\nu0=dx0\ndt=dx\ndt\u0000v=u\u0000v: (382)\n50",
      "key_point": "The kinetic energy of the system\nE=1\n2M!2r2\u0012m\nm+M\u00132\n+1\n2m!2r2\u0012M\nm+M\u00132\n(369)\n=1\n2!2r2\u00121\nm+M\u00132\u0000\nMm2...",
      "context_label": "Paragraph 50",
      "importance_rank": 34
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_bcaf9ae8",
      "content": "Figure 60: Two Cartesian inertial frames of reference\nGenerally if the bird has velocity uand the car has velocity vrelative to the Earth, the velocity of the\nbird relative to the car is\nu0=u\u0000v: (383)\nIn terms of components\nu0\nx=ux\u0000vx; (384)\nu0\ny=uy\u0000vy; (385)\nu0\nz=uz\u0000vz: (386)\nThe velocity diagram is (see \u0085g 61)\nFigure 61: Velocity diagram\nExample 13 Rain falling vertically down with velocity urelative to the Earth; pedestrian is walking\nhorizontally with velocity vrelative to the Earth. Velocity of rain relative to pedestrian is u0=u\u0000v=\nu+ (\u0000v), see \u0085g 62.\nExample 14 Ship sailing north-east at velocity u0relative to the water. Current of water \u0087 owing with\nvelocity vfrom east to west. What is velocity of ship relative to the Earth? Then u0=u\u0000v, sou=u0+v\nis velocity of ship relative to the Earth, as in \u0085g 63. Note ship is pointing in the direction of velocity u0\nbut is travelling along direction of velocity u.\n51",
      "key_point": "Figure 60: Two Cartesian inertial frames of reference\nGenerally if the bird has velocity uand the...",
      "context_label": "Paragraph 51",
      "importance_rank": 33
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_dcf5a483",
      "content": "Figure 62: Velocity diagram fro rain and pedestrian\nFigure 63: Velocity diagram for boat and water\n19.1 Appropriate direction for interception\nConsider two ships that want to intercept. Ship 1 is travelling with constant velocity u1on a given\nbearing. Ship 2 is travelling at a constant speed u2. We need to determine the bearing (direction)\nof ship 2 such that the two ships will intercept, given that the ships are at known positions AandB\nrespectively at time t. What must angle \fbe for interception in \u0085g 64? Consider motion of ship 2 relative\nto ship 1, i.e. u0\n2=u2\u0000u1. For interception ship 2 must appear relative to ship 1 to be travelling along\nthe direction BtoA. Thus u0\n2=u2\u0000u1is in direction\u0000 \u0000 !BA. Time to intercept is\nt1=D\nju0\n2j: (387)\nWe can draw the velocity diagram with u1,u2,\u000bgiven and use sine rule to determine \f.\nu1\nsin\f=u2\nsin\u000b=u0\n2\nsin\r: (388)\nThe problem could be solved in the Earth frame, since the positions of ship 1 and 2 are given by\nrA(t) = rA+u1t; (389)\nrB(t) = rB+u2t: (390)\nInterception occurs when rB(t) =rA(t)i.e.\nrB+u2t=rA+u1t; (391)\nrA\u0000rB=u2t\u0000u1t; (392)\nt=ju2\u0000u1j\njrA\u0000rBj: (393)\n52",
      "key_point": "Figure 62: Velocity diagram fro rain and pedestrian\nFigure 63: Velocity diagram for boat and wate...",
      "context_label": "Paragraph 52",
      "importance_rank": 32
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_45106c38",
      "content": "Figure 64: (a) Spatial and (b) velocity diagrams for interception\nThus u0\n2is along rA\u0000rBandtis the time to interception.\nExample 15 Q3 1B27 Exam 2003. u1= 25 km =h,u2= 35 km =h, distance AB= 10 km . Velocity\ndiagram \u0085g 65. u0\n2must lie in direction of line BA, i.e. due N, and \u000b+\f= 45\u000e. From sine rule\nFigure 65: Space and velocity diagram for exam problem\nu1\nsin\u000b=u2\nsin 135\u000e=u2\n1=p\n2; (394)\nsin\u000b=u1\nu2p\n2=25\n35p\n2= 0:505; (395)\n\u000b= 30 :34\u000e: (396)\nTherefore \f= 45\u0000\u000b= 14:66\u000e. Also\nu0\n2\nsin\f=u1\nsin\u000b(397)\nu0\n2=u1sin\f\nsin\u000b=25\u00020:253\n0:505= 12:52 km =h: (398)\n53",
      "key_point": "Figure 64: (a) Spatial and (b) velocity diagrams for interception\nThus u0\n2is along rA\u0000rBandtis t...",
      "context_label": "Paragraph 53",
      "importance_rank": 31
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_2f8e8aa4",
      "content": "Time to interception is\nt=10 km\n12:52 km =h= 0:80 h: (399)\n19.2 Transformation of velocity and acceleration\nConsider again a car travelling along the x-axis with velocity vand a bird \u0087 ying along the x-axis with\nvelocity urelative to the ground as in \u0085g 66.\nFigure 66: Diagram for acceleration as seen in two frames\nVelocity of bird relative to car is (from x0=x\u0000vt),\nu0=u\u0000v: (400)\nSuppose vis constant but bird is accelerating relative to the ground, then\ndu0\ndt=du\ndt(401)\nand the acceleration of the bird is the same in both frames of reference. Suppose now that the car is\nalso accelerating relative to the Earth, then\ndu0\ndt=du\ndt\u0000dv\ndt; (402)\nwithdu0\ndtbeing the acceleration of the bird relative to the car,du\ndtbeing the acceleration of the bird\nrelative to the Earth, anddv\ndtbeing the acceleration of the car relative to the Earth. The force on the\nbird necessary to accelerate it in frame S (Earth) is\nF=mdu\ndt: (403)\nThe equation of motion of the bird in the reference frame of the car, S0, isNOT\nF=mdu0\ndt: (404)\nIt is correctly\nF0=mdu\ndt\u0000mdv\ndt; (405)\ni.e. the e¤ective force on the bird in the car\u0092 s frame of reference, S0, is\nF0=F\u0000ma; (406)\nwhere a=dv\ndtis the acceleration of the car (in frame S). Thus if we want to apply Newton\u0092 s laws of\nmotion in an accelerating frame we must add to the real force Fthe\u0085ctitious force (\u0000ma). An\naccelerating frame of reference is also called a non-inertial frame. An inertial (or non-accelerating)\nframe of reference is one in which Newton\u0092 s laws of motion apply without needing to introduce \u0085ctitious\nforces.\n54",
      "key_point": "Time to interception is\nt=10 km\n12:52 km =h= 0:80 h: (399)\n19.2 Transformation of velocity and ac...",
      "context_label": "Paragraph 54",
      "importance_rank": 30
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_bdcfe27f",
      "content": "20 Rotating frame of reference\nConsider a person standing on a rotating roundabout as in \u0085g 67. Real force of friction at the feet\nFigure 67: Observer in a rotating frame\nprovides the centripetal acceleration r!2, therefore F=mr!2.Relative to the roundabout the\nperson is at rest under the in\u0087 uence of a real centripetal force F=mr!2and a \u0085ctitious centrifugal\nforce F=mr!2acting through the centre of mass. If !is large enough, the person may fall over\noutwards under the in\u0087 uence of these two forces, which constitute a couple acting on the person (see\nsection on rotational motion and couples later).\n20.1 Geostationary satellite\nSatellite appears stationary relative to an observer on a rotating Earth as shown in \u0085g 67. Real force on\nFigure 68: Geostationary satellite\nthe satellite if the gravitational force (centripetal force)\nF=\u0000GMm\nR2=\u0000mR!2: (407)\nThe observer on Earth thinks there is also a \u0085ctitious centrifugal force\nF=mR!2=GMm\nR2(408)\nso there is no net force, and so the satellite is at rest and in equilibrium in this frame.\n20.2 Observing a moving body in a rotating frame\nConsider a person Bat rest on the roundabout observing a moving body, e.g. a \u0087 ying bird, as in \u0085g\n69 Consider the same bird being observed by a second person Aat rest on the ground and not on\nthe roundabout. To observer Athe path of the bird is a straight line. Relative to observer Bon the\n55",
      "key_point": "20 Rotating frame of reference\nConsider a person standing on a rotating roundabout as in \u0085g 67.",
      "context_label": "Paragraph 55",
      "importance_rank": 29
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_56c83518",
      "content": "Figure 69: Observers in rotaing and inertial frames\nroundabout the path of the bird is curved. Hence observer Bassumes there is a transverse horizontal\nforce Fcoracting on the bird de\u0087 ecting the bird to the right for the given sense of rotation. This is the\nCoriolis force .\nThe general expression for the Coriolis force is\nFcor=\u00002m!\u0002v; (409)\nwhere !is the angular velocity vector of rotating frame, vis velocity of particle of mass mrelative to\nthe rotating frame of reference. Note Fcoris perpendicular to both !andvand so always transverse to\nthe direction of motion. There are several interesting consequences of the Coriolis force:\nConsider the e¤ect of the rotating Earth:\nThrow a ball horizontally due East at three di¤erent places on the Earth\u0092 s surface, A,B, and Cas in\n\u0085g 70 - dotted line is the local horizontal at each place on the Earth. In the northern hemisphere (point\nA) the Coriolis force de\u0087 ects the ball to the right as it has a component in this direction. On the equator\n(point B) the Coriolis force has no horizontal component so the ball is not de\u0087 ected. (Coriolis force is\nvertical so a¤ects the local e¤ective force due to gravity.) In the southern hemisphere the ball is de\u0087 ected\nto the left.\nWeather systems are determined by the Coriolis force. Wind blows anticlockwise (clockwise) around\nregion of low pressure in the northern (southern) hemispheres. Winds blow approximately along isobars\ninstead of down the pressure gradient.\nOne should set the size of the Coriolis force on the rotating Earth into context. The maximum value\nof the Coriolis acceleration is a=\u00002!v. Since != (2\u0019)=(24\u000260\u000260) rad s\u00001= 7:272 2\u000210\u00005rad s\u00001\nthen for a speed of 15 m s\u00001('33 mph) ,a= 2:2\u000210\u00003m s\u00002, (quite small compared to the vertical\ncomponent of acceleration due to gravity on the Earth\u0092 s surface).\n20.3 Simple derivation of expression for Coriolis force\nConsider a massless smooth rod on which there is a small ring of mass m. The rod is rotating with\nconstant angular velocity !in a horizontal plane. As the rod is smooth there can be no radial force (from\nfriction) on the ring. The only force on the ring is a transverse normal reaction force Nas shown in \u0085g\n71.\n56",
      "key_point": "Figure 69: Observers in rotaing and inertial frames\nroundabout the path of the bird is curved.",
      "context_label": "Paragraph 56",
      "importance_rank": 28
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_99a98743",
      "content": "Figure 70: E¤ect of Coriolis force at Earth\u0092 s surface\nFigure 71: Diagram for simple derivation of expression for Coriolis force\nThe equation of motion of the ring is, relative to the inertial reference frame,\nma=N (410)\nm\u0014\u0012\n::r\u0000r:\n\u00122\u0013\nbr+\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\nb\u0012\u0015\n=Nb\u0012: (411)\nTherefore the radial equation of motion is\nm\u0012\n::r\u0000r:\n\u00122\u0013\n= 0 (412)\nand the transverse one is\nm\u0010\n2:r:\n\u0012+r::\n\u0012\u0011\n=N: (413)\nBut:\n\u0012=!=constant, so\nm\u0000::r\u0000r!2\u0001\n= 0 ; (414)\n2m\u0001r! =N: (415)\n57",
      "key_point": "Figure 70: E¤ect of Coriolis force at Earth\u0092 s surface\nFigure 71: Diagram for simple derivation o...",
      "context_label": "Paragraph 57",
      "importance_rank": 27
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_3dc0d98e",
      "content": "Now consider the equation of motion of the ring relative to the rotating rod. In this frame the ring can\nonly move in one dimension along the rod. If we work in this frame we must add to the real forces the\n\u0085ctitious centrifugal force Fcand, because the ring is moving relative to the rotating frame, the Coriolis\nforce Fcoras in \u0085g 72 In the rotating frame the equations of motion is radially\nFigure 72: Forces on ring in inertial and rotating frames\nm\u0001\u0001r=Fc (416)\nand transversely,\nN\u0000Fcor= 0 (417)\nas there is no transverse motion in the rotating frame. Comparing eq(414) with eq(416) gives a centrifugal\nforce\nFc=mr!2(418)\nand comparing eq(415) and eq(417) gives a Coriolis force\nFcor= 2m\u0001r!: (419)\nIn the rotating frame the ring has only radial velocity v=\u0001r. Thus the magnitude of the Coriolis force\nFcor= 2mv!: (420)\nThe direction of Fcorand its magnitude is consistent with the general expression quoted previously, i.e.\nFcor=\u00002m!\u0002v (421)\nas!is out of the page and vis along the rod.\n21 Angular momentum and torques\nParticle of mass mhas velocity vat position vector ras in \u0085g 73. The angular momentum is de\u0085ned\nby\nL=r\u0002p=mr\u0002v (422)\nabout point O. The direction of Lis given by the usual right-hand rule for a vector product.\nConsider a force Facting on the particle. The torque ormoment of force about point Oisde\u0085ned\nby\n\u001c=r\u0002F: (423)\nBut\nF=mdv\ndt(424)\n58",
      "key_point": "Now consider the equation of motion of the ring relative to the rotating rod.",
      "context_label": "Paragraph 58",
      "importance_rank": 26
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_a31f199e",
      "content": "Figure 73: Position and velocity vectors for rotational motion\nso\n\u001c=mr\u0002dv\ndt: (425)\nConsider\nd (r\u0002v)\ndt=dr\ndt\u0002v+r\u0002dv\ndt(426)\n=v\u0002v+r\u0002dv\ndt= 0 + r\u0002dv\ndt(427)\nd (r\u0002v)\ndt=r\u0002dv\ndt(428)\nand therefore\n\u001c=mr\u0002dv\ndt=md (r\u0002v)\ndt=d (mr\u0002v)\ndt(429)\n\u001c=dL\ndt: (430)\nHence torque is equal to the rate of change of angular momentum . This is analogous to the\nlinear case of force equal to rate of change of linear momentum, i.e. Newton\u0092 s second law. If \u001c=0thenL\nis constant in magnitude and direction. If \u001c=0then either force F= 0orr\u0002Fin which case force Fand\nrare parallel and the force is a central force. Thus Lis constant for any central force, F(r) =F(r)br.\nFor a system in equilibrium, L= 0and constant so there is no net torque about any point. This is\nthe basis of taking moments to determine the magnitude of forces.\nExample 16 A massless beam is supported at points AandBand masses m1andm2are attached as in\nthe \u0085g 74. Resolving vertically,\nN1+N2=m1g+m2g= (m1+m2)g: (431)\nTake moments about A, (assume clockwise moment is positive, anti-clockwise moment is negative)\nm1gx1\u0000N2x2+m2gx3= 0 (432)\nN2=(m1x1+m2x3)g\nx2; (433)\nN1= (m1+m2)g\u0000N2: (434)\nExample 17 Motorcyclist with uniform acceleration such that front wheels lift o¤ the ground as in \u0085g\n75!The real forces are, weight mg, friction F=maand normal reaction N=mg. In motorcyclists\u0092own\nframe of reference (which is accelerating relative to the ground) he is in equilibrium under in\u0087 uences of\n59",
      "key_point": "Figure 73: Position and velocity vectors for rotational motion\nso\n\u001c=mr\u0002dv\ndt: (425)\nConsider\nd (r...",
      "context_label": "Paragraph 59",
      "importance_rank": 25
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_1ebda4a5",
      "content": "Figure 74: Masses on supported beam\nFigure 75: Accelerating cyclist\nrealand \u0085ctitious force F=maacting through the centre of mass as shown. Taking moments about point\nof contact of rear wheel with the ground,\nmgd\u0000Fh= 0: (435)\nExample 18 An accelerating car as shown in \u0085g 76:We will assume rear-wheel drive; that centre of mass\nis at height habove the ground; distances d1andd2from wheels as shown in the diagram. Real forces\nare: weight mg; friction F=maat the driven rear wheels contact with the ground (There is also friction\nbetween front wheels and the ground acting in the opposite sense causing the front wheels to turn rather\nthan skid.); normal reactions at wheels, N1andN2. We have\nN1+N2=mg: (436)\nIn the car\u0092 s accelerating frame we add a \u0085ctitious force F=maas shown. In this frame the car is now\nin equilibrium. Taking moments about point A,\nmgd 1\u0000N2(d1+d2)\u0000Fh= 0; (437)\nN2=1\n(d1+d2)(mgd 1\u0000mah ) =m\n(d1+d2)(gd1\u0000ah); (438)\n60",
      "key_point": "Figure 74: Masses on supported beam\nFigure 75: Accelerating cyclist\nrealand \u0085ctitious force F=maa...",
      "context_label": "Paragraph 60",
      "importance_rank": 24
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_f001a0f5",
      "content": "Figure 76: Accelerating vehicle\nand\nN1=mg\u0000N2=mg\u0000m\n(d1+d2)(gd1\u0000ah) (439)\nN1=m\n(d1+d2)(gd2+ah): (440)\nFor a rear-wheel drive car the maximum acceleration of the car is either when (a) F=ma=\u0016N1where\n\u0016is coe¢ cient of friction, whence\na=\u0016\n(d1+d2)(gd2+ah); (441)\nor (b) if \u0016is large enough when N2= 0whence\na=gd1\nh: (442)\n(Hence the need for a low centre of mass in racing cars!) Any higher acceleration than this will cause the\ncar to somersault backwards. For a front-wheel drive car, maximum acceleration occurs for F=ma=\n\u0016N2. The front wheels can never leave the ground because they will skid \u0085rst.\n22 Systems of particles - properties of centre of mass\nConsider a system of nparticles of masses, mi(i= 1;2; : : : ; n )at position vectors ri(i= 1;2; : : : ; n )as\nshown in \u0085g 77. Total mass is\nM=nX\ni=1mi: (443)\nThecentre of mass is at position\nR=Pn\ni=1miriPn\ni=1mi=Pn\ni=1miri\nM: (444)\nThe position Ris such that if the total mass Mwere at Rit would have the same moment about origin\nOas the actual system, i.e.\nMR=nX\ni=1miri: (445)\nThe centre of mass is therefore that point about which a rigid body will balance if in a uniform gravita-\ntional \u0085eld.\n61",
      "key_point": "Figure 76: Accelerating vehicle\nand\nN1=mg\u0000N2=mg\u0000m\n(d1+d2)(gd1\u0000ah) (439)\nN1=m\n(d1+d2)(gd2+ah): (44...",
      "context_label": "Paragraph 61",
      "importance_rank": 23
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_de231619",
      "content": "Figure 77: System of particles acted on by forces\nIf the system of particles is not subjected to any external forces the centre of mass remains at\nrest or in uniform motion , i.e. no acceleration of the centre of mass. This is true even if the particles\nin the system are moving relative to each other and interact with each other. Also, if system of particles\nis subjected to external forces the centre of mass behaves as if all the forces acted at that\nposition . In addition, any \u0085ctitious force appears to act at through the centre of mass.\nProof. LetFibe force on i-th particle, then\nFi=Fiext+Fiint; (446)\nwhere Fiextis external force on particle i, and Fiintis the internal force on particle idue to internal\ninteractions with all other particles. The equation of motion of particle iis\nFi=mid2ri\ndt2(447)\nand the resultant force on the system is\nF=nX\ni=1Fi=nX\ni=1mid2ri\ndt2=d2\ndt2 nX\ni=1miri!\n(448)\nF=d2\ndt2(MR) =Md2R\ndt2: (449)\nTherefore the centre of mass moves as if all the forces act on a mass Mat the position of the centre of\nmass.\nSince\nF=nX\ni=1Fi=nX\ni=1Fiext+nX\ni=1Fiint (450)\nandnX\ni=1Fiint= 0 (451)\nby Newton\u0092 s third law, we have\nF=nX\ni=1Fi=Md2R\ndt2: (452)\n62",
      "key_point": "Figure 77: System of particles acted on by forces\nIf the system of particles is not subjected to ...",
      "context_label": "Paragraph 62",
      "importance_rank": 22
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_f752eb6b",
      "content": "Therefore only external forces in\u0087 uence the motion of the centre of mass. If F= 0(no resultant external\nforce) then\nd2R\ndt2= 0 (453)\nand velocity of centre of massdR\ndtis constant.\n23 Rigid bodies\n23.1 Centre of mass\nRigid bodies can be considered as a system of particles rigidly joined together. An example is a uniform\nthin rod of length Land mass Mas in \u0085g 78. We can determine the position of the centre of mass as\nFigure 78: Uniform thin rod\nfollows:\nMass per unit length is\n\u001b=M\nL(454)\nso the mass of an element of length dxisdm=\u001bdx. Therefore from the de\u0085nition, the position of the\ncentre of mass is given by\nX=RL\n0xdm\nRL\n0dm=RL\n0x \u001bdx\nRL\n0\u001bdx=1\n2\u001bx2jL\n0\nM=1\n2\u001bL2\nM=1\n2\u001bL2\nM=1\n2M\nLL2\nM=1\n2L (455)\nas might have been expected. Note this procedure works even when \u001bis not constant.\nExample 19 Position of centre of mass of a thin wedge shaped rod (as shown in \u0085g 79) where the mass\nper unit length is proportional to distance from one end, i.e. \u001b=kxwith ka constant. Then mass of\nFigure 79: Centre of mass of wedge rod\nelement of length dxisdm=\u001bdx=kxdxand total mass is\nM=ZL\n0dm=ZL\n0\u001bdx=ZL\n0kxdx=1\n2kL2: (456)\nThe position of the centre of mass is\nX=RL\n0xdm\nRL\n0dm=RL\n0x \u001bdx\nM=RL\n0kx2dx\nM=1\n3kL3\n1\n2kL2=2\n3L: (457)\n63",
      "key_point": "Therefore only external forces in\u0087 uence the motion of the centre of mass.",
      "context_label": "Paragraph 63",
      "importance_rank": 21
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_3322c669",
      "content": "23.2 Rotation of a rigid body about a \u0085xed axis\nConsider rotation of a rigid body as depicted in \u0085g 80, with the axis of rotation perpendicular to the\npage. Let !be the angular velocity. A mass element miis at a perpendicular distance rifrom the pivot.\nThe only velocity is transverse to this direction of magnitude vi=!ri. For a rigid body, all elements\nmust have the same angular velocity. The kinetic energy of rotation is\nFigure 80: Rotating rigid body\nKE=nX\ni=11\n2miv2\ni=nX\ni=11\n2mi(!ri)2=1\n2!2nX\ni=1mir2\ni: (458)\nThe last summation depends only on the distribution of mass within the body. We can de\u0085ne the\nmoment of inertia, I,of the body about this axis by\nI=nX\ni=1mir2\ni; (459)\nand\nKE=1\n2I!2: (460)\nFor a continuous mass distribution with density \u001awhich may vary with position, an element of volume dv\nhas mass dm=\u001adv. Ifr?is the perpendicular distance from the axis, the moment of inertia is obtained\nfrom\nI=Z\nvolr2\n?\u001adv: (461)\nThe value of the moment of inertia depends on the mass distribution in the body and the position of\nthe pivot . Later we will calculate the moment of inertia of various bodies.\n23.3 Angular momentum of a rotating rigid body.\nThe angular momentum of a point mass mmoving in a circle of radius rwith angular velocity !is\nL=mr2!=mvr: (462)\n64",
      "key_point": "23.2 Rotation of a rigid body about a \u0085xed axis\nConsider rotation of a rigid body as depicted in ...",
      "context_label": "Paragraph 64",
      "importance_rank": 20
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_6c5d7a23",
      "content": "Therefore the angular momentum of an extended rigid body is\nL=nX\ni=1mir2\ni!=!nX\ni=1mir2\ni=I!: (463)\nAngular momentum is a vector quantity so we should write\nL=I! (464)\nwhere direction of vector is along the axis of rotation in a sense given by a right-handed screw.\n23.4 Correspondence between rotational and translational motion\nThe previous sections show that we can establish a table of correspondences between quantities related\nto linear motion and to rotational motion.\nLinear Rotation\nmass m I moment of inertia\nvelocity v ! angular velocity\nlinear momentum p=mv L =I! angular momentum\nlinear kinetic energy1\n2mv2 1\n2I!2rotational kinetic energy\nforce F=dp\ndt\u001c=dL\ndttorque\nF=mdv\ndtF=Id!\ndt\n23.5 Compound pendulum\nThe mass of the body is M. The centre of mass is a distance `from the pivot as shown in \u0085g81. It will be\nassumed that the moment of inertia, I, of this body about an axis through the pivot point Ais known.\nTorque of the weight about Ais\nFigure 81: Compound pendulum\n\u001c=\u0000Mg` sin\u0012: (465)\nNote the negative sign as the torque is in the sense of decreasing \u0012.\nThe equation of motion for rotation about the axis through Ais\n\u001c=dL\ndt=d\ndt(I!) =Id!\ndt=Id2\u0012\ndt2(466)\nId2\u0012\ndt2=\u0000Mg` sin\u0012: (467)\n65",
      "key_point": "Therefore the angular momentum of an extended rigid body is\nL=nX\ni=1mir2\ni!=!nX\ni=1mir2\ni=I!",
      "context_label": "Paragraph 65",
      "importance_rank": 19
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_e2a414c8",
      "content": "If the angle \u0012is always small, then sin\u0012'\u0012(in radians) and\nId2\u0012\ndt2+Mg`\u0012 = 0 ; (468)\nd2\u0012\ndt2+Mg`\nI\u0012= 0 ; (469)\nd2\u0012\ndt2+!2\u0012= 0 ; (470)\nwhere\n!=r\nMg`\nI: (471)\nThis is the equation for simple harmonic motion (in \u0012) with a period\nT=2\u0019\n!= 2\u0019s\nI\nMg`: (472)\nIf we express the moment of inertia by\nI=Mk2(473)\nwith kcalled the radius of gyration\u0010\nk=p\nI=M\u0011\nthen\nT= 2\u0019s\nMk2\nMg`= 2\u0019s\nk2\ng`: (474)\nAsimple pendulum is a point mass Mon the end of a massless inextensible string (!). The moment\nof inertia of a point mass Mat a distance `from a pivot is I=M`2, sok=`. The period becomes\nT= 2\u0019s\n`2\ng`= 2\u0019s\n`\ng: (475)\n23.6 Determination of moment of inertia\nThe basic de\u0085nition is\nI=nX\ni=1mir2\ni\u0000!Z\nvolr2\n?\u001adv: (476)\n1. Point mass Mat distance `from axis of rotation, I=M`2.\n2. Ring of mass Mand of radius Rabout an axis through O, the centre of the ring as in \u0085g 82, and\nperpendicular to the plane of the ring. As all the mass is the same distance from O, then eq(476)\nFigure 82: Moment of inertia of a ring\nimmediately gives I=MR2. It is important to note that for all other axes the moment of inertia\nis di¤erent.\n66",
      "key_point": "If the angle \u0012is always small, then sin\u0012'\u0012(in radians) and\nId2\u0012\ndt2+Mg`\u0012 = 0 ; (468)\nd2\u0012\ndt2+Mg`\n...",
      "context_label": "Paragraph 66",
      "importance_rank": 18
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_358bf27e",
      "content": "Figure 83: Moment of inertia of a uniform rod\n3. Uniform thin rod, mass M, length Labout an axis through one end of the rod and perpendicular\nto the rod, as in \u0085g 83. Mass per unit length is \u001a=M\nLso mass of length dxisdm=\u001adx. Thus\nfrom eq(476)\nIA=Z\nx2dm=ZL\n0x2\u001adx=1\n3\u001aL3=1\n3M\nLL3=1\n3ML2: (477)\nIf the axis were through the centre of the rod, point O, and perpendicular to it then\nIO=ZL=2\n\u0000L=2x2\u001adx=1\n3\u001ax3jL=2\n\u0000L=2=1\n24\u001aL3+1\n24\u001aL3=1\n12\u001aL3=1\n12M\nLL3=1\n12ML2: (478)\nThis clearly illustrates that the moment of inertia is not a \u0085xed quantity for a rigid body but\ndepends on the choice of axis about which rotation is to occur. Two important theorems help us\ndetermine moments of inertia. These theorems are called (a) the theorem of perpendicular axes\nand (b) the theorem of parallel axes.\n23.7 Theorem of perpendicular axes\nIt is important to note that this theorem only applies to plane lamina . Consider a lamina (sheet)\nlying in the x\u0000yplane, with mass per unit area \u001a(not necessarily constant) as shown in \u0085g 84. Mass\nof an element of area dxdyisdm=\u001adxdy. Thus moment of inertia of lamina about the z-axis is\nIz=ZZ\narear2dm=ZZ\u0002\n\u001a\u0000\nx2+y2\u0001\u0003\ndxdy; (479)\n=ZZ\u0002\n\u001a\u0000\nx2+y2\u0001\u0003\ndxdy= (480)\n=ZZ\n\u001ax2dxdy+ZZ\n\u001ay2dxdy (481)\n=Z\nxx2\u0012Z\ny\u001adxdy\u0013\n+Z\nyy2\u0012Z\nx\u001adxdy\u0013\n: (482)\nSince \u0012Z\ny\u001adxdy\u0013\n= dM (483)\nis the mass of a strip of width dxparallel to the y-axis, the \u0085rst integral on the right-hand side\nZ\nxx2dM=Iy; (484)\nis the moment of inertia of the lamina about the y-axis as shown in \u0085g 85. Similarly the second integral\n67",
      "key_point": "Figure 83: Moment of inertia of a uniform rod\n3.",
      "context_label": "Paragraph 67",
      "importance_rank": 17
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_f21e60bc",
      "content": "Figure 84: Diagram for perpendicular axes theorem of moments of inertia\nFigure 85: Diagram for identi\u0085cation of integrals\ngives Ixthe moment of inertia of the lamina about the x-axis. Therefore\nIz=Ix+Iy: (485)\nNote the xandyaxes can be chosen anywhere in the lamina, but the z-axismust be taken through the\npoint of intersection of the xandyaxes.\n23.8 Theorem of parallel axes\nThis theorem applies to any solid body. Consider any axis through the centre of mass. Let I0be the\nmoment of inertia of the body about this axis. Now consider a parallel axis at a distance afrom the\naxis through the centre of mass (see \u0085g 86). The moment of inertia about a given axis depends only\non the perpendicular distance from the axis of each mass element. Therefore we may squash the three-\ndimensional body down onto a plane perpendicular to the axis. Suppose this is the x\u0000yplane. Then\nthe distance of an element from the axis through Oisrand\nr2=x2+y2; (486)\nand\na2=a2\nx+a2\ny: (487)\n68",
      "key_point": "Figure 84: Diagram for perpendicular axes theorem of moments of inertia\nFigure 85: Diagram for id...",
      "context_label": "Paragraph 68",
      "importance_rank": 16
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_31307516",
      "content": "Figure 86: Diagram for parallel axes theorem of moments of inertia\nDistance from Ato mass element is Rsuch that\nR2= (x+ax)2+ (y+ay)2: (488)\nMoment of inertia of body about axis through Operpendicular to the x\u0000yplane is\nI0=Z\nvolr2dm=Z\nvol\u0000\nx2+y2\u0001\ndm (489)\nand the total mass\nM=Z\ndm: (490)\nMoment of inertia about parallel axis through Ais\nIA=Z\nvolR2dm (491)\n=Z\nvolh\n(x+ax)2+ (y+ay)2i\ndm (492)\n=Z\nvol\u0002\u0000\nx2+y2\u0001\n+\u0000\na2\nx+a2\ny\u0001\n+ 2xax+ 2yay\u0003\ndm (493)\nIA=Z\nvol\u0000\nx2+y2\u0001\ndm+a2Z\ndm+ 2axZ\nxdm+ 2ayZ\nydm: (494)\nBut by de\u0085nition of the centre of mass\nZ\nxdm=Z\nydm= 0 (495)\nand so\nIA=I0+Ma2: (496)\nThis theorem is true for any body.\nExample 20 Consider previous example of a uniform rod of length L. We showed explicitly that I0=\n1\n12ML2. Thus by the parallel axes theorem the moment of inertia about a parallel axis through one end\nof the rod is IA=I0+M\u0000L\n2\u00012=1\n3ML2as explicitly shown previously.\n69",
      "key_point": "Figure 86: Diagram for parallel axes theorem of moments of inertia\nDistance from Ato mass element...",
      "context_label": "Paragraph 69",
      "importance_rank": 15
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_b7bf0578",
      "content": "23.9 Kinetic energy of rigid body with rotation and translation\nWe shall \u0085nd an expression for the kinetic energy of a body which is rotating through its centre of mass\nand also is in rectilinear motion. Body has mass Mand moment of inertia about axis through centre of\nFigure 87: Rotational and translational motion\nmass of I0. The kinetic energy of rotation about axis through centre of mass is1\n2I0!2. Kinetic energy of\nrectilinear motion is1\n2Mv2. Thus the total kinetic energy is simply\nKE=1\n2I0!2+1\n2Mv2: (497)\nConsider a wheel rolling on a surface without skidding . As the point in contact with the surface is\nnot slipping, it must be momentarily stationary. Thus the speed of the centre of mass v=!R. The total\nFigure 88: Rolling wheel\nkinetic energy is\nKE=1\n2I0!2+1\n2Mv2(498)\n=1\n2I0!2+1\n2M!2R2(499)\n=1\n2\u0000\nI0+MR2\u0001\n!2(500)\n=1\n2IA!2; (501)\nwhere\nIA=I0+MR2(502)\nis the moment of inertia of the wheel about an axis through A(the point of contact with the surface)\nperpendicular to the plane of the wheel. Therefore the wheel can be considered as momentarily rotating\nabout point A(the point of contact with the surface) with angular velocity !. The moment of inertia\n70",
      "key_point": "23.9 Kinetic energy of rigid body with rotation and translation\nWe shall \u0085nd an expression for th...",
      "context_label": "Paragraph 70",
      "importance_rank": 14
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_0af38719",
      "content": "about axis through centre of mass of the wheel (ring) perpendicular to the wheel is I0=MR2. In this\ncase\nKE=1\n2\u0000\nI0+MR2\u0001\n!2=1\n2\u0000\nMR2+MR2\u0001\n!2=M!2r2=Mv2: (503)\n23.10 E¤ect of external force\nWe wish to see what is the e¤ect of an external force applied to a free rigid body if the force does not\nact through the centre of mass of the body, see \u0085g 89. If we now add forces Fand\u0000Facting through the\nFigure 89: Left: External force not through C.o.M; Right: equivalent force system\ncentre of mass we now have a system with a force Fthrough the centre of mass and a couple made up\nfrom the force \u0000Fthrough the centre of mass and the original force F. Force acting through the centre\nof mass accelerates the mass according to\nF=Md2R\ndt2: (504)\nThe couple, with a torque \u001c=Fh, produces an angular acceleration\n\u001c=dL\ndt=I0d!\ndt(505)\nabout an axis through the centre of mass and perpendicular to the plane de\u0085ned by the direction of the\nforce and the centre of mass.\nSuppose force Fis applied for a very short time dtto a system initially at rest. Then\nFdt=MV (506)\nwhere Vis velocity of centre of mass, and\n\u001cdt=I0!; (507)\nwhere !is the angular velocity about axis through the centre of mass. Immediately after the impulse is\napplied the speeds of the points AandB(see \u0085g 90) are\nvA=V+`A! (508)\nvB=V\u0000`B!: (509)\nIt may be that vB= 0. The point at which the impulse is applied for which vB= 0is called the centre\nof percussion . If a body, e.g. a door is hinged at Band is struck at the centre of percussion there is no\nimpulsive reaction at the hinge. Similarly if a cricket bat or tennis racket is held at one end (i.e. B) and\nthe ball strikes the centre of percussion there is no painful jarring sensation at the player\u0092 s hand.\n71",
      "key_point": "about axis through centre of mass of the wheel (ring) perpendicular to the wheel is I0=MR2.",
      "context_label": "Paragraph 71",
      "importance_rank": 13
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_de50a2c6",
      "content": "Figure 90: Impulse given to body free to rotate\nDetermination of position of centre of percussion IfvB= 0then V=`B!. But\nMV =Fdt (510)\nand\nI0!=\u001cdt=Fhdt=MV h (511)\nso\nI0!=M`B!h (512)\nh=I0\nM`B: (513)\nFor a uniform rod of length Land mass M, we have I0=1\n12ML2and`B=1\n2L, soh=1\n6L, i.e. 2/3 of\nthe length of the rod from B.\n23.11 Simple theory of the gyroscope\nConsider spinning a disc with moment of inertia I0about an axis perpendicular to the disc, as in \u0085g91.The\ntorque of the weight about Ois\u001c=Mgx . The direction of the torque vector \u001cis into the paper. Since\n\u001c=dL\ndt(514)\nthen in time dtthe angular momentum of the spinning disc changes by an amount\ndL=\u001cdt (515)\nin the direction of \u001c. Thus viewed from above we have the vector diagram with L(t)the angular\nmomentum at time t. As can be seen from the diagram, the angular momentum vector Lis rotated\nthrough an angle d\u000bin time dtbut it is still horizontal and of the same magnitude. Hence\nd\u000b=dL\nL=\u001cdt\nL=Mgx dt\nI0!: (516)\n72",
      "key_point": "Figure 90: Impulse given to body free to rotate\nDetermination of position of centre of percussion...",
      "context_label": "Paragraph 72",
      "importance_rank": 12
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_dba3e330",
      "content": "Figure 91: Spinning disc\nFigure 92: Vector diagram\nThe rate of rotation of L, orrate of precession , is\nd\u000b\ndt=\u001c\nL=Mgx\nI0!: (517)\nThis simple theory is valid ifd\u000b\ndt\u001c!.\nThere are many applications of gyroscopes in maintaining stability of rotating bodies and in various\ncontrol systems.\n24 Fluid Mechanics\nA \u0087 uid is a substance that can readily be deformed, that \u0087 ows when an external force is applied. Obvious\nexamples are gases and liquids.\nHydrostatics - is study of \u0087 uids at rest and in equilibrium.\nHydrodynamics - study of \u0087 uids in motion.\n24.1 Hydrostatics\nConsider equilibrium of a small cube of liquid in a tank under gravity as in \u0085g 93. Density of the liquid\nis\u001a. There is no horizontal net force so forces on each pair of opposite parallel vertical faces must cancel.\nHence if P1is average pressure on face 1, and P2is average pressure on face 2, then force on face 1 is\ndF1=P1dydz (518)\n73",
      "key_point": "Figure 91: Spinning disc\nFigure 92: Vector diagram\nThe rate of rotation of L, orrate of precessio...",
      "context_label": "Paragraph 73",
      "importance_rank": 11
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_f2b92ac1",
      "content": "Figure 93: Small element of volume of a \u0087 uid\nand force of face 2 is\ndF2=P2dydz (519)\nbutdF1= dF2and hence P1=P2. Therefore pressure is same at all points of same depth .\nConsider forces on upper and lower horizontal faces. Downward force on top force is\ndF5=Pdxdz: (520)\nUpward force on bottom face is\ndF6= (P+ dP) dxdz: (521)\nTherefore for equilibrium of mass of liquid \u001a(dxdydz),\ndF6\u0000dF5=\u001a(dxdydz)g; (522)\ndPdxdz=\u001a(dxdydz)g (523)\ndP=\u001agdy : (524)\nOn integrating\nP=\u001agy+P0; (525)\nwhere P0is pressure at y= 0. Hence pressure in a static liquid under gravity varies only with the vertical\nheight.\nPressure is measured in Pascals (Pa), 1 Pa = 1 Nm\u00002.\n24.1.1 Hydraulic press\nApply force F2to piston 2 of area A2as in \u0085g 94 The pressure in the liquid P2=F2=A2. Same pressure\nunder piston 1 of area A1so upward force on piston 1 is\nF1=P1A1=A1\nA2F2: (526)\nIfA1> A 2then F1> F 2.\nPiston 2 moves a distance x2, piston 1 moves distance x2then if liquid is incompressible,\nA1x1=A2x2 (527)\nand\nx1=A2\nA1x2: (528)\n74",
      "key_point": "Figure 93: Small element of volume of a \u0087 uid\nand force of face 2 is\ndF2=P2dydz (519)\nbutdF1= dF2...",
      "context_label": "Paragraph 74",
      "importance_rank": 10
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_e3b662e0",
      "content": "Figure 94: Hydraulic press\nWork done by force F1is\nF1x1=A1\nA2F2A2\nA1=F2x2 (529)\nif there are no dissipative forces such as friction at the pistons or viscosity of the liquid.\n24.1.2 Buoyancy\nConsider a cylinder of mass mwith end-face area A\u0087 oating partially submerged in a liquid of density \u001a\nas in \u0085g 95. Force on top face FT=P0A. Force on bottom face is FB=P1A= (P0+\u001agy)A. Thus for\nFigure 95: Floating cylinder\nequilibrium\nmg=FB\u0000FT=\u001agyA = [(yA)\u001a]g; (530)\ni.e. upthrust = FB\u0000FTis equal to the weight of liquid displaced.\nConsider a fully immersed body. Let Nbe reaction of cylinder on legs as in \u0085g 96. Force on top face\nis\nFT=P1A: (531)\n75",
      "key_point": "Figure 94: Hydraulic press\nWork done by force F1is\nF1x1=A1\nA2F2A2\nA1=F2x2 (529)\nif there are no d...",
      "context_label": "Paragraph 75",
      "importance_rank": 9
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_8c722889",
      "content": "Figure 96: Submerged cylinder\nForce on bottom face is\nFB=P2A+\u001ag(lA): (532)\nThus upthrust FB\u0000FT=\u001a(lA)g. Again upthrust equals weight of liquid displaced. For equilibrium\nmg= upthrust + N: (533)\nWhether body is partially or fully immersed there is an upthrust equal to weight of \u0087 uid displaced. This\nisArchimedes\u0092Principle . The result applies to any shape of body.\n24.2 Hydrodynamics - \u0087 uids in motion\nConsider an ideal liquid which is\n1. incompressible,\n2. non-viscous,\n3. constant temperature throughout,\n4. \u0087 owing steadily, i.e. no time variation in \u0087 ow pattern,\n5. non-turbulent.\nAt each point with coordinates (x; y; z )the liquid has a velocity vector vand pressure p(scalar).\nConsider following a small element of liquid as it travels along, as in \u0085g 97. The velocity may change in\nmagnitude and direction along the path. This path of a \u0087 uid element is called a streamline . Consider\nanother \u0087 uid element. This will follow another streamline. Two streamlines can never cross because\nit would mean that the velocity vector would have two di¤erent directions at the same point which is\nimpossible (see \u0085g 98).\nFlow along stream lines, with the velocity vector changing smoothly is called streamline \u0087 ow .\nConsider a thin bundle of adjacent streamlines as in \u0085g 99 forming a stream tube . Because streamlines\ncannot cross any \u0087 uid that enters a stream tube at end A must exit through end B. There is no loss of\n\u0087 uid through the side of the stream tube.\n76",
      "key_point": "Figure 96: Submerged cylinder\nForce on bottom face is\nFB=P2A+\u001ag(lA): (532)\nThus upthrust FB\u0000FT=\u001a(...",
      "context_label": "Paragraph 76",
      "importance_rank": 8
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_1276c50a",
      "content": "Figure 97: A streamline\nFigure 98: Two streamlines\nFigure 99: A streamtube\n77",
      "key_point": "Figure 97: A streamline\nFigure 98: Two streamlines\nFigure 99: A streamtube\n77",
      "context_label": "Paragraph 77",
      "importance_rank": 7
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_82746dce",
      "content": "If density of \u0087 uid at A is \u001a1and density at B is \u001a2, mass of \u0087 uid entering tube at A in time tis\nm1=\u001a1v1tdA1and the mass of \u0087 uid leaving through end B is m2=\u001a2v2tdA2. Since mass is conserved,\nm1=m2and\n\u001a1v1tdA1=\u001a2v2tdA2; (534)\n\u001a1v1dA1=\u001a2v2dA2: (535)\nThis is the equation of continuity . This is true for liquids and gases. For an ideal liquid which is\nincompressible, so \u001a1=\u001a2, then\nv1dA1=v2dA2: (536)\nExample 21 Hose-pipe nozzle of area A2; volume rate of \u0087 ow of water along the pipe of cross sectional\nareaA1isv1A1=v2A2, sov2=v1A1=A2at the nozzle, and hence v2> v1since A2< A 1.\n24.2.1 Bernoulli\u0092 s equation\nThis is a most important equation relating to \u0087 uid \u0087 ow. Consider an ideal liquid \u0087 owing along under\ngravity as in \u0085g 100. Assume there is no viscosity (i.e. no dissipative forces) so that the total energy of\na small volume of liquid as it \u0087 ows along a stream tube must be conserved.\nFigure 100: Diagram for Bernoulli\u0092 s eqaution\nConsider the work done by the pressure in time dt. Work done bypressure at end A1is\ndW1= (p1dA1)v1dt; (537)\nand work done against pressure at end A2is\ndW2= (p2dA2)v2dt: (538)\nBy the continuity equation, mass of liquid element dmis (note \u001a1=\u001a2=\u001aas liquid is incompressible)\ndm=\u001adA1v1dt=\u001adA2v2dt: (539)\nChange of kinetic energy of this mass from end A1to end A2is\ndW3=1\n2dm\u0000\nv2\n2\u0000v2\n1\u0001\n(540)\n=1\n2\u001adA1v1dt\u0000\nv2\n2\u0000v2\n1\u0001\n: (541)\n78",
      "key_point": "If density of \u0087 uid at A is \u001a1and density at B is \u001a2, mass of \u0087 uid entering tube at A in time ti...",
      "context_label": "Paragraph 78",
      "importance_rank": 6
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_5e58980f",
      "content": "Work done against gravity in raising this mass of liquid from h1toh2is\ndW4= d m g(h2\u0000h1) (542)\n=\u001adA1v1dt g(h2\u0000h1): (543)\nTherefore from conservation of energy\ndW1\u0000dW2= d W3+ dW4 (544)\n(p1dA1)v1dt\u0000(p2dA2)v2dt=1\n2\u001adA1v1dt\u0000\nv2\n2\u0000v2\n1\u0001\n+\u001adA1v1dt g(h2\u0000h1): (545)\nThe continuity equation gives dA1v1= dA2v2, so\np1\u0000p2=1\n2\u001a\u0000\nv2\n2\u0000v2\n1\u0001\n+\u001ag(h2\u0000h1) (546)\np1+1\n2\u001av2\n1+\u001agh1=p2+1\n2\u001av2\n2+\u001agh2: (547)\nThus in general along a stream tube\np+1\n2\u001av2+\u001agh=cons tant: (548)\nThis is Bernoulli\u0092 s equation. This has been derived for an ideal liquid, but is approximately true for\ngases if there is no great change in density, otherwise the equation becomes\nZdp\n\u001a+1\n2v2+gh=cons tant: (549)\nIf \u0087 uid is not moving, v= 0, then Bernoulli\u0092 s equation becomes\np+\u001agh= cons tan t (550)\ni.e. pressure increases with depth as derived earlier. as his measured in upwards sense.\nExample 22 Flow of water through a small hole in a tank, as in \u0085g 101. At the surfaces p0=p1is the\natmospheric pressure and v'0as the water level falls slowly(!) So\np0+1\n2\u001av2\n1+\u001agh1=p0+ 0 + \u001agh2 (551)\nv2\n1= 2g(h2\u0000h1): (552)\nThis is the same speed as free fall under gravity through a height h=h2\u0000h1.\nRate of \u0087 ow (volume per second) through area AisAv.\nFigure 101: Flow from ori\u0085ce in tank\n79",
      "key_point": "Work done against gravity in raising this mass of liquid from h1toh2is\ndW4= d m g(h2\u0000h1) (542)\n=\u001a...",
      "context_label": "Paragraph 79",
      "importance_rank": 5
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_9648f817",
      "content": "24.2.2 Venturi meter\nIf the \u0087 ow is horizontal so with no change in height then\np+1\n2\u001av2=cons tant (553)\nand pressure is greater where speed of \u0087 ow is less. This is the basis of the Venturi meter as illustrated in\n\u0085g 102.\nFigure 102: Venturi meter\nFrom the diagram\np1+1\n2\u001av2\n1=p2+1\n2\u001av2\n2 (554)\nand\np1\u0000p2=\u001a0gh (555)\nso\n\u001a0gh=1\n2\u001av2\n2\u00001\n2\u001av2\n1: (556)\nBut the continuity equation is v1A1=v2A2sov2=v1A1=A2so substituting for v2\n\u001a0gh =1\n2\u001av2\n1\u0012A2\n1\nA2\n2\u00001\u0013\n(557)\nv1=s\n2\u001a0ghA2\n2\n\u001a(A2\n1\u0000A2\n2)(558)\nand volume rate of \u0087 ow along pipe is\nA1v1=s\n2\u001a0ghA2\n1A2\n2\n\u001a(A2\n1\u0000A2\n2): (559)\nExample 23 Flow of air over an aircraft wing as in \u0085g 103.Air \u0087 ow over the top of the wing, v1is faster\nthan under the bottom, v2so pressure above wing, p1is less than than under the wing p2which gives rise\nto the upward force (lift) on the wing.\n80",
      "key_point": "24.2.2 Venturi meter\nIf the \u0087 ow is horizontal so with no change in height then\np+1\n2\u001av2=cons tan...",
      "context_label": "Paragraph 80",
      "importance_rank": 4
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_4ba981a9",
      "content": "Figure 103: Flow over an aerofoil\nFigure 104: Ball suspended in upward air jet\nExample 24 Stability of table-tennis ball suspended on air jet. The air speed v1> v 2sop1< p 2\nproducing a resultant force pushing the ball towards the centre of the air jet (see \u0085g 104).\nExample 25 De\u0087 ection of a spinning rough ball. Ball moving at speed vthrough the air and spinning\nabout a vertical axis as in \u0085g 105.\nAs ball is rough it slows down air at A and tend to increase speed of air at B, such that v1< v2,\nso that p1> p2producing a resultant force in direction from A to B. The ball is de\u0087 ected horizontally.\nNote the ball is rough, a smooth ball does not drag the air round with it and the e¤ect is not observed.\n81",
      "key_point": "Figure 103: Flow over an aerofoil\nFigure 104: Ball suspended in upward air jet\nExample 24 Stabili...",
      "context_label": "Paragraph 81",
      "importance_rank": 3
    },
    {
      "id": "6763f3f7-2541-497c-ab67-3817ddf2f30d_chunk_4392f428",
      "content": "Figure 105: De\u0087 ection of spinning ball\n82",
      "key_point": "Figure 105: De\u0087 ection of spinning ball\n82",
      "context_label": "Paragraph 82",
      "importance_rank": 2
    }
  ]
}